CLOTHES_TNVED_DICT = {'АНОРАК': {'Без указания пола': (('6102109000', '6102209000', '6102309000', '6102909000'),
                                  (('6102109000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, '
                                    'кроме одежды из товарной позиции 6104'),
                                   ('6102209000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной '
                                    'позиции 6104'),
                                   ('6102309000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из химических нитей, трикотажные, кроме изделий товарной позиции '
                                    '6104'),
                                   ('6102909000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной '
                                    'позиции 6104'))),
            'Жен.': (('6102109000', '6102209000', '6102309000', '6102909000'),
                     (('6102109000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из товарной '
                       'позиции 6104'),
                      ('6102209000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102309000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102909000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'))),
            'Муж.': (('6101209000', '6101309000', '6101908000'),
                     (('6101209000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия из хлопчатобумажной пряжи '
                       'трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                      ('6101309000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские или для мальчиков '
                       'из химических нитей, трикотажные, кроме изделий товарной позиции 6103'),
                      ('6101908000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих текстильных '
                       'материалов'))),
            'Унисекс': (('6102109000', '6102209000', '6102309000', '6102909000'),
                        (('6102109000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из '
                          'товарной позиции 6104'),
                         ('6102209000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102309000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102909000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104')))},
 'БАБОЧКА': {'Без указания пола': (('6117808001', '6215100000', '6215200000', '6215900000'),
                                   (('6117808001',
                                     'Галстуки, галстуки-бабочки и шейные платки трикотажные машинного или ручного '
                                     'вязания готовые'),
                                    ('6215100000',
                                     'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из '
                                     'шелковых отходов'),
                                    ('6215200000',
                                     'Галстуки, галстуки-бабочки и шейные платки, из химических '
                                     'нитей                                                                     '
                                     '<6215900000> Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                                     'материалов                                                       <6117808001> '
                                     'Галстуки, галстуки-бабочки и шейные платки трикотажные машинного или ручного '
                                     'вязания готовые                                <6117808009> Прочие '
                                     'принадлежности к одежде трикотажные машинного или ручного вязания '
                                     'готовые                                                   <6117801009> Прочие '
                                     'принадлежности к одежде трикотажные машинного или ручного вязания, эластичные '
                                     'или прорезиненные'),
                                    ('6215900000',
                                     'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов'))),
             'Жен.': (('6117808001', '6215100000', '6215200000', '6215900000'),
                      (('6117808001',
                        'Галстуки, галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания готовые'),
                       ('6215100000',
                        'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из шелковых отходов'),
                       ('6215200000',
                        'Галстуки, галстуки-бабочки и шейные платки, из химических '
                        'нитей                                                                     <6215900000> '
                        'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                        'материалов                                                       <6117808001> Галстуки, '
                        'галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания '
                        'готовые                                <6117808009> Прочие принадлежности к одежде '
                        'трикотажные машинного или ручного вязания '
                        'готовые                                                   <6117801009> Прочие принадлежности '
                        'к одежде трикотажные машинного или ручного вязания, эластичные или прорезиненные'),
                       ('6215900000', 'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов'))),
             'Муж.': (('6117808001', '6215100000', '6215200000', '6215900000'),
                      (('6117808001',
                        'Галстуки, галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания готовые'),
                       ('6215100000',
                        'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из шелковых отходов'),
                       ('6215200000',
                        'Галстуки, галстуки-бабочки и шейные платки, из химических '
                        'нитей                                                                     <6215900000> '
                        'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                        'материалов                                                       <6117808001> Галстуки, '
                        'галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания '
                        'готовые                                <6117808009> Прочие принадлежности к одежде '
                        'трикотажные машинного или ручного вязания '
                        'готовые                                                   <6117801009> Прочие принадлежности '
                        'к одежде трикотажные машинного или ручного вязания, эластичные или прорезиненные'),
                       ('6215900000', 'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов'))),
             'Унисекс': (('6117808001', '6215100000', '6215200000', '6215900000'),
                         (('6117808001',
                           'Галстуки, галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания '
                           'готовые'),
                          ('6215100000',
                           'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из шелковых '
                           'отходов'),
                          ('6215200000',
                           'Галстуки, галстуки-бабочки и шейные платки, из химических '
                           'нитей                                                                     <6215900000> '
                           'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                           'материалов                                                       <6117808001> Галстуки, '
                           'галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания '
                           'готовые                                <6117808009> Прочие принадлежности к одежде '
                           'трикотажные машинного или ручного вязания '
                           'готовые                                                   <6117801009> Прочие '
                           'принадлежности к одежде трикотажные машинного или ручного вязания, эластичные или '
                           'прорезиненные'),
                          ('6215900000',
                           'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов')))},
 'БАТНИК': {'Без указания пола': (('6106100000', '6106200000', '6106901000', '6106903000', '6106905000', '6106909000'),
                                  (('6106100000', '- - из хлопчатобумажной пряжи'),
                                   ('6106200000', '- - из химических нитей'),
                                   ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                                   ('6106905000', '- -- из льняных волокон или волокна рами'),
                                   ('6106909000', '- -- из прочих текстильных материалов'))),
            'Жен.': (('6106100000', '6106200000', '6106901000', '6106903000', '6106905000', '6106909000'),
                     (('6106100000', '- - из хлопчатобумажной пряжи'),
                      ('6106200000', '- - из химических нитей'),
                      ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                      ('6106905000', '- -- из льняных волокон или волокна рами'),
                      ('6106909000', '- -- из прочих текстильных материалов'))),
            'Муж.': (('6105100000', '6105201000', '6105209000', '6105901000', '6105909000'),
                     (('6105100000', 'Рубашки мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6105201000',
                       'Рубашки трикотажные, мужские или для мальчиков, из химических синтетических нитей, машинного '
                       'или ручного вязания'),
                      ('6105209000',
                       'Рубашки трикотажные, мужские или для мальчиков, из химических искусственных нитей, машинного '
                       'или ручного вязания'),
                      ('6105901000',
                       'Рубашки трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных, машинного или ручного вязания'),
                      ('6105909000',
                       'Рубашки трикотажные, мужские или для мальчиков, из прочих текстильных материалов, машинного '
                       'или ручного вязания'))),
            'Унисекс': (('6106100000', '6106200000', '6106901000', '6106903000', '6106905000', '6106909000'),
                        (('6106100000', '- - из хлопчатобумажной пряжи'),
                         ('6106200000', '- - из химических нитей'),
                         ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                         ('6106905000', '- -- из льняных волокон или волокна рами'),
                         ('6106909000', '- -- из прочих текстильных материалов')))},
 'БЕЗРУКАВКА': {'Без указания пола': (('6110119000',
                                       '6110129009',
                                       '6110199009',
                                       '6110209900',
                                       '6110309900',
                                       '6110901000',
                                       '6110909000'),
                                      (('6110119000',
                                        'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или '
                                        'девочек, из шерстяной пряжи, машинного или ручного вязания'),
                                       ('6110129009',
                                        'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                        'вязания, из пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                                       ('6110199009',
                                        'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                        'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных, для женщин '
                                        'или девочек'),
                                       ('6110209900',
                                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                        'из хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного '
                                        'вязания'),
                                       ('6110309900',
                                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                        'из химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                       ('6110901000',
                                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                        'льняных волокон или волокна рами, машинного или ручного вязания'),
                                       ('6110909000',
                                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                        'из прочих текстильных материалов, машинного или ручного вязания'))),
                'Жен.': (('6110119000',
                          '6110129009',
                          '6110199009',
                          '6110209900',
                          '6110309900',
                          '6110901000',
                          '6110909000'),
                         (('6110119000',
                           'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                           'шерстяной пряжи, машинного или ручного вязания'),
                          ('6110129009',
                           'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                           'пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                          ('6110199009',
                           'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                           'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                          ('6110209900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                          ('6110309900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                          ('6110901000',
                           'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                           'или волокна рами, машинного или ручного вязания'),
                          ('6110909000',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                           'текстильных материалов, машинного или ручного вязания'))),
                'Муж.': (('6110113000',
                          '6110121009',
                          '6110191009',
                          '6110209100',
                          '6110309100',
                          '6110901000',
                          '6110909000'),
                         (('6110113000',
                           'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для мужчин или мальчиков, из '
                           'шерстяной пряжи, машинного или ручного вязания'),
                          ('6110121009',
                           'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                           'пряжи из тонкого волоса кашмирской козы, для мужчин или мальчиков'),
                          ('6110191009',
                           'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                           'шерстяной пряжи или пряжи из тонкого волоса животных, для мужчин или мальчиков'),
                          ('6110209100',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                          ('6110309100',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'химических нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                          ('6110901000',
                           'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                           'или волокна рами, машинного или ручного вязания'),
                          ('6110909000',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                           'текстильных материалов, машинного или ручного вязания'))),
                'Унисекс': (('6110119000',
                             '6110129009',
                             '6110199009',
                             '6110209900',
                             '6110309900',
                             '6110901000',
                             '6110909000'),
                            (('6110119000',
                              'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                              'шерстяной пряжи, машинного или ручного вязания'),
                             ('6110129009',
                              'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                              'пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                             ('6110199009',
                              'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                              'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                             ('6110209900',
                              'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                              'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                             ('6110309900',
                              'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                              'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                             ('6110901000',
                              'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                              'волокон или волокна рами, машинного или ручного вязания'),
                             ('6110909000',
                              'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                              'текстильных материалов, машинного или ручного вязания')))},
 'БЕКЕША': {'Без указания пола': (('4203100001',
                                   '4304000000',
                                   '6202200000',
                                   '6202300000',
                                   '6202400001',
                                   '6202400009',
                                   '6202900001',
                                   '6202900009'),
                                  (('4203100001', '- -- из натуральной кожи'),
                                   ('4304000000', 'Мех искусственный и изделия из него'),
                                   ('6202200000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'),
                                   ('6202400001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из химических нитей, массой одного изделия '
                                    'более 1 кг'),
                                   ('6202400009',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                   ('6202900001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов'),
                                   ('6202900009',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов, прочие'))),
            'Жен.': (('4203100001',
                      '4304000000',
                      '6202200000',
                      '6202300000',
                      '6202400001',
                      '6202400009',
                      '6202900001',
                      '6202900009'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('4304000000', 'Мех искусственный и изделия из него'),
                      ('6202200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'),
                      ('6202400001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                      ('6202400009',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из химических нитей, прочие'),
                      ('6202900001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов'),
                      ('6202900009',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов, прочие'))),
            'Муж.': (('4203100001', '4304000000', '6201200000', '6201300000', '6201400000', '6201900000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('4304000000', 'Мех искусственный и изделия из него'),
                      ('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                       'пряжи'),
                      ('6201400000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'))),
            'Унисекс': (('4203100001',
                         '4304000000',
                         '6202200000',
                         '6202300000',
                         '6202400001',
                         '6202400009',
                         '6202900001',
                         '6202900009'),
                        (('4203100001', '- -- из натуральной кожи'),
                         ('4304000000', 'Мех искусственный и изделия из него'),
                         ('6202200000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6202400001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                         ('6202400009',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из химических нитей, прочие'),
                         ('6202900001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов'),
                         ('6202900009',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов, прочие')))},
 'БЛЕЙЗЕР': {'Без указания пола': (('4203100001',
                                    '6204310000',
                                    '6204321000',
                                    '6204329000',
                                    '6204331000',
                                    '6204339000',
                                    '6204391100',
                                    '6204391900',
                                    '6204399000'),
                                   (('4203100001', '- -- из натуральной кожи'),
                                    ('6204310000',
                                     'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из '
                                     'тонкого волоса животных'),
                                    ('6204321000',
                                     'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                     'из хлопчатобумажной пряжи'),
                                    ('6204329000',
                                     'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                                    ('6204331000',
                                     'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                     'из синтетических нитей'),
                                    ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                    ('6204391100',
                                     'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                     'из искусственных нитей'),
                                    ('6204391900',
                                     'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                                    ('6204399000',
                                     'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                     'материалов'))),
             'Жен.': (('4203100001',
                       '6204310000',
                       '6204321000',
                       '6204329000',
                       '6204331000',
                       '6204339000',
                       '6204391100',
                       '6204391900',
                       '6204399000'),
                      (('4203100001', '- -- из натуральной кожи'),
                       ('6204310000',
                        'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                        'животных'),
                       ('6204321000',
                        'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                        'хлопчатобумажной пряжи'),
                       ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                       ('6204331000',
                        'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                        'синтетических нитей'),
                       ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                       ('6204391100',
                        'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                        'искусственных нитей'),
                       ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                       ('6204399000',
                        'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'))),
             'Муж.': (('4203100001',
                       '6203310000',
                       '6203321000',
                       '6203329000',
                       '6203331000',
                       '6203339000',
                       '6203391100',
                       '6203391900',
                       '6203399000'),
                      (('4203100001', '- -- из натуральной кожи'),
                       ('6203310000',
                        'Пиджаки и блайзеры мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                        'животных'),
                       ('6203321000',
                        'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                        'хлопчатобумажной пряжи'),
                       ('6203329000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из хлопчатобумажной пряжи'),
                       ('6203331000',
                        'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                        'синтетических нитей'),
                       ('6203339000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из синтетических нитей'),
                       ('6203391100',
                        'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                        'искусственных нитей'),
                       ('6203391900', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из искусственных нитей'),
                       ('6203399000',
                        'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов'))),
             'Унисекс': (('4203100001',
                          '6204310000',
                          '6204321000',
                          '6204329000',
                          '6204331000',
                          '6204339000',
                          '6204391100',
                          '6204391900',
                          '6204399000'),
                         (('4203100001', '- -- из натуральной кожи'),
                          ('6204310000',
                           'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                           'животных'),
                          ('6204321000',
                           'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                           'хлопчатобумажной пряжи'),
                          ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                          ('6204331000',
                           'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                           'синтетических нитей'),
                          ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                          ('6204391100',
                           'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                           'искусственных нитей'),
                          ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                          ('6204399000',
                           'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов')))},
 'БЛУЗА': {'Без указания пола': (('6106100000',
                                  '6106200000',
                                  '6106901000',
                                  '6106903000',
                                  '6106905000',
                                  '6106909000',
                                  '6206100000',
                                  '6206200000',
                                  '6206300000',
                                  '6206400000',
                                  '6206901000',
                                  '6206909000'),
                                 (('6106100000', '- - из хлопчатобумажной пряжи'),
                                  ('6106200000', '- - из химических нитей'),
                                  ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                  ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                                  ('6106905000', '- -- из льняных волокон или волокна рами'),
                                  ('6106909000',
                                   '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны '
                                   'женские или для девочек, из прочих текстильных материалов'),
                                  ('6206100000',
                                   'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из '
                                   'шелковых отходов'),
                                  ('6206200000',
                                   'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из '
                                   'тонкого волоса животных'),
                                  ('6206300000',
                                   'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                                  ('6206400000',
                                   'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                                  ('6206901000',
                                   'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна '
                                   'рами'),
                                  ('6206909000',
                                   'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных '
                                   'материалов'))),
           'Жен.': (('6106100000',
                     '6106200000',
                     '6106901000',
                     '6106903000',
                     '6106905000',
                     '6106909000',
                     '6206100000',
                     '6206200000',
                     '6206300000',
                     '6206400000',
                     '6206901000',
                     '6206909000'),
                    (('6106100000', '- - из хлопчатобумажной пряжи'),
                     ('6106200000', '- - из химических нитей'),
                     ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                     ('6106905000', '- -- из льняных волокон или волокна рами'),
                     ('6106909000',
                      '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны женские или для '
                      'девочек, из прочих текстильных материалов'),
                     ('6206100000',
                      'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых отходов'),
                     ('6206200000',
                      'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                     ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                     ('6206901000',
                      'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                     ('6206909000',
                      'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов'))),
           'Унисекс': (('6106100000',
                        '6106200000',
                        '6106901000',
                        '6106903000',
                        '6106905000',
                        '6106909000',
                        '6206100000',
                        '6206200000',
                        '6206300000',
                        '6206400000',
                        '6206901000',
                        '6206909000'),
                       (('6106100000', '- - из хлопчатобумажной пряжи'),
                        ('6106200000', '- - из химических нитей'),
                        ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                        ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                        ('6106905000', '- -- из льняных волокон или волокна рами'),
                        ('6106909000',
                         '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны женские или для '
                         'девочек, из прочих текстильных материалов'),
                        ('6206100000',
                         'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых '
                         'отходов'),
                        ('6206200000',
                         'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                         'волоса животных'),
                        ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                        ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                        ('6206901000',
                         'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                        ('6206909000',
                         'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов')))},
 'БЛУЗКА': {'Без указания пола': (('6106100000',
                                   '6106200000',
                                   '6106901000',
                                   '6106903000',
                                   '6106905000',
                                   '6106909000',
                                   '6206100000',
                                   '6206200000',
                                   '6206300000',
                                   '6206400000',
                                   '6206901000',
                                   '6206909000'),
                                  (('6106100000', '- - из хлопчатобумажной пряжи'),
                                   ('6106200000', '- - из химических нитей'),
                                   ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                                   ('6106905000', '- -- из льняных волокон или волокна рами'),
                                   ('6106909000',
                                    '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны '
                                    'женские или для девочек, из прочих текстильных материалов'),
                                   ('6206100000',
                                    'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из '
                                    'шелковых отходов'),
                                   ('6206200000',
                                    'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из '
                                    'тонкого волоса животных'),
                                   ('6206300000',
                                    'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6206400000',
                                    'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                                   ('6206901000',
                                    'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна '
                                    'рами'),
                                   ('6206909000',
                                    'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных '
                                    'материалов'))),
            'Жен.': (('6106100000',
                      '6106200000',
                      '6106901000',
                      '6106903000',
                      '6106905000',
                      '6106909000',
                      '6206100000',
                      '6206200000',
                      '6206300000',
                      '6206400000',
                      '6206901000',
                      '6206909000'),
                     (('6106100000', '- - из хлопчатобумажной пряжи'),
                      ('6106200000', '- - из химических нитей'),
                      ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                      ('6106905000', '- -- из льняных волокон или волокна рами'),
                      ('6106909000',
                       '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны женские или для '
                       'девочек, из прочих текстильных материалов'),
                      ('6206100000',
                       'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых '
                       'отходов'),
                      ('6206200000',
                       'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                       'волоса животных'),
                      ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                      ('6206901000',
                       'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                      ('6206909000',
                       'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов'))),
            'Унисекс': (('6106100000',
                         '6106200000',
                         '6106901000',
                         '6106903000',
                         '6106905000',
                         '6106909000',
                         '6206100000',
                         '6206200000',
                         '6206300000',
                         '6206400000',
                         '6206901000',
                         '6206909000'),
                        (('6106100000', '- - из хлопчатобумажной пряжи'),
                         ('6106200000', '- - из химических нитей'),
                         ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                         ('6106905000', '- -- из льняных волокон или волокна рами'),
                         ('6106909000',
                          '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны женские или для '
                          'девочек, из прочих текстильных материалов'),
                         ('6206100000',
                          'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых '
                          'отходов'),
                         ('6206200000',
                          'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                          'волоса животных'),
                         ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                         ('6206901000',
                          'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                         ('6206909000',
                          'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов')))},
 'БЛУЗОН': {'Без указания пола': (('6106100000',
                                   '6106200000',
                                   '6106901000',
                                   '6106903000',
                                   '6106905000',
                                   '6106909000',
                                   '6206100000',
                                   '6206200000',
                                   '6206300000',
                                   '6206400000',
                                   '6206901000',
                                   '6206909000'),
                                  (('6106100000', '- - из хлопчатобумажной пряжи'),
                                   ('6106200000', '- - из химических нитей'),
                                   ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                                   ('6106905000', '- -- из льняных волокон или волокна рами'),
                                   ('6106909000',
                                    '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны '
                                    'женские или для девочек, из прочих текстильных материалов'),
                                   ('6206100000',
                                    'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из '
                                    'шелковых отходов'),
                                   ('6206200000',
                                    'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из '
                                    'тонкого волоса животных'),
                                   ('6206300000',
                                    'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6206400000',
                                    'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                                   ('6206901000',
                                    'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна '
                                    'рами'),
                                   ('6206909000',
                                    'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных '
                                    'материалов'))),
            'Жен.': (('6106100000',
                      '6106200000',
                      '6106901000',
                      '6106903000',
                      '6106905000',
                      '6106909000',
                      '6206100000',
                      '6206200000',
                      '6206300000',
                      '6206400000',
                      '6206901000',
                      '6206909000'),
                     (('6106100000', '- - из хлопчатобумажной пряжи'),
                      ('6106200000', '- - из химических нитей'),
                      ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                      ('6106905000', '- -- из льняных волокон или волокна рами'),
                      ('6106909000',
                       '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны женские или для '
                       'девочек, из прочих текстильных материалов'),
                      ('6206100000',
                       'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых '
                       'отходов'),
                      ('6206200000',
                       'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                       'волоса животных'),
                      ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                      ('6206901000',
                       'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                      ('6206909000',
                       'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов'))),
            'Унисекс': (('6106100000',
                         '6106200000',
                         '6106901000',
                         '6106903000',
                         '6106905000',
                         '6106909000',
                         '6206100000',
                         '6206200000',
                         '6206300000',
                         '6206400000',
                         '6206901000',
                         '6206909000'),
                        (('6106100000', '- - из хлопчатобумажной пряжи'),
                         ('6106200000', '- - из химических нитей'),
                         ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                         ('6106905000', '- -- из льняных волокон или волокна рами'),
                         ('6106909000',
                          '- -- из прочих текстильных материалов  <6206909000> Блузки, блузы и блузоны женские или для '
                          'девочек, из прочих текстильных материалов'),
                         ('6206100000',
                          'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых '
                          'отходов'),
                         ('6206200000',
                          'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                          'волоса животных'),
                         ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                         ('6206901000',
                          'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                         ('6206909000',
                          'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов')))},
 'БОДИ': {'Без указания пола': (('6108910000', '6108920000', '6114300000', '6212300000'),
                                (('6108910000',
                                  '. Прочие пеньюары, купальные и домашние халаты, аналогичные изделия трикотажные, '
                                  'женские или для девочек, из хлопчатобумажной пряжи, машинного или ручного вязания.'),
                                 ('6108920000',
                                  '. Прочие пеньюары, купальные и домашние халаты, аналогичные трикотажные изделия, '
                                  'женские или для девочек, из химических нитей, машинного или ручного вязания.'),
                                 ('6114300000',
                                  '. Предметы одежды прочие, трикотажные из химических нитей, машинного или ручного '
                                  'вязания.'),
                                 ('6212300000',
                                  '. Боди женские (для взрослых), трикотажные, машинного вязания из химических нитей, '
                                  'не военного назначения, размеры соответствуют размерам РФ, рост от 164 см'))),
          'Жен.': (('6108910000', '6108920000', '6114300000', '6212300000'),
                   (('6108910000',
                     '. Прочие пеньюары, купальные и домашние халаты, аналогичные изделия трикотажные, женские или для '
                     'девочек, из хлопчатобумажной пряжи, машинного или ручного вязания.'),
                    ('6108920000',
                     '. Прочие пеньюары, купальные и домашние халаты, аналогичные трикотажные изделия, женские или для '
                     'девочек, из химических нитей, машинного или ручного вязания.'),
                    ('6114300000',
                     '. Предметы одежды прочие, трикотажные из химических нитей, машинного или ручного вязания.'),
                    ('6212300000',
                     '. Боди женские (для взрослых), трикотажные, машинного вязания из химических нитей, не военного '
                     'назначения, размеры соответствуют размерам РФ, рост от 164 см'))),
          'Унисекс': (('6108910000', '6108920000', '6114300000', '6212300000'),
                      (('6108910000',
                        '. Прочие пеньюары, купальные и домашние халаты, аналогичные изделия трикотажные, женские или '
                        'для девочек, из хлопчатобумажной пряжи, машинного или ручного вязания.'),
                       ('6108920000',
                        '. Прочие пеньюары, купальные и домашние халаты, аналогичные трикотажные изделия, женские или '
                        'для девочек, из химических нитей, машинного или ручного вязания.'),
                       ('6114300000',
                        '. Предметы одежды прочие, трикотажные из химических нитей, машинного или ручного вязания.'),
                       ('6212300000',
                        '. Боди женские (для взрослых), трикотажные, машинного вязания из химических нитей, не '
                        'военного назначения, размеры соответствуют размерам РФ, рост от 164 см')))},
 'БРИДЖИ': {'Без указания пола': (('6104610001',
                                   '6104620000',
                                   '6104630000',
                                   '6104690001',
                                   '6104690009',
                                   '6204611000',
                                   '6204618500',
                                   '6204621100',
                                   '6204623100',
                                   '6204623300',
                                   '6204623900',
                                   '6204629000',
                                   '6204631100',
                                   '6204631800',
                                   '6204639000',
                                   '6204691100',
                                   '6204691800',
                                   '6204695000',
                                   '6204699000'),
                                  (('6104610001',
                                    'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                    'волоса животных'),
                                   ('6104620000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                    'трикотажные женские или для девочек, из хлопка'),
                                   ('6104630000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                    'трикотажные женские или для девочек, из синтетических нитей'),
                                   ('6104690001',
                                    'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                                   ('6104690009',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих '
                                    'текстильных материалов'),
                                   ('6204611000',
                                    'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                    'волоса животных'),
                                   ('6204618500',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6204621100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6204623100',
                                    'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                                   ('6204623300',
                                    'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным '
                                    'ворсом'),
                                   ('6204623900',
                                    'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6204629000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из хлопчатобумажной пряжи'),
                                   ('6204631100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'синтетических нитей'),
                                   ('6204631800',
                                    'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                                   ('6204639000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из синтетических нитей'),
                                   ('6204691100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'искусственных нитей'),
                                   ('6204691800',
                                    'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                                   ('6204695000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из искусственных нитей'),
                                   ('6204699000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                    'девочек,из прочих текстильных материалов'))),
            'Жен.': (('6104610001',
                      '6104620000',
                      '6104630000',
                      '6104690001',
                      '6104690009',
                      '6204611000',
                      '6204618500',
                      '6204621100',
                      '6204623100',
                      '6204623300',
                      '6204623900',
                      '6204629000',
                      '6204631100',
                      '6204631800',
                      '6204639000',
                      '6204691100',
                      '6204691800',
                      '6204695000',
                      '6204699000'),
                     (('6104610001',
                       'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6104620000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                       'женские или для девочек, из хлопка'),
                      ('6104630000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                       'женские или для девочек, из синтетических нитей'),
                      ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                      ('6104690009',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов'),
                      ('6204611000',
                       'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6204618500',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6204621100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                       'хлопчатобумажной пряжи'),
                      ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                      ('6204623300',
                       'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                      ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6204629000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'хлопчатобумажной пряжи'),
                      ('6204631100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из синтетических '
                       'нитей'),
                      ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                      ('6204639000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'синтетических нитей'),
                      ('6204691100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из искусственных '
                       'нитей'),
                      ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                      ('6204695000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'искусственных нитей'),
                      ('6204699000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из прочих '
                       'текстильных материалов'))),
            'Муж.': (('6103410000',
                      '6103420001',
                      '6103430001',
                      '6103490001',
                      '6103490009',
                      '6203411000',
                      '6203419000',
                      '6203421100',
                      '6203423100',
                      '6203423300',
                      '6203423500',
                      '6203429000',
                      '6203431100',
                      '6203431900',
                      '6203439000',
                      '6203491100',
                      '6203491900',
                      '6203495000',
                      '6203499000'),
                     (('6103410000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных) трикотажные, '
                       'мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6103420001', 'Брюки и бриджи, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6103430001', 'Брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                      ('6103490001', 'Брюки и бриджи мужские или для мальчиков, из прочих текстильных материалов'),
                      ('6103490009',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов, '
                       'мужские или для мальчиков'),
                      ('6203411000',
                       'Брюки и бриджи мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6203419000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6203421100',
                       'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                       'хлопчатобумажной пряжи'),
                      ('6203423100', 'Брюки и бриджи мужские или для мальчиков, из денима, или джинсовой ткани'),
                      ('6203423300', 'Брюки и бриджи мужские или для мальчиков, из вельвет-корда с разрезным ворсом'),
                      ('6203423500', 'Прочие брюки и бриджи мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6203429000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из хлопчатобумажной пряжи'),
                      ('6203431100',
                       'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                       'синтетических нитей'),
                      ('6203431900', 'Прочие брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                      ('6203439000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из синтетических нитей'),
                      ('6203491100',
                       'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                       'искусственных нитей'),
                      ('6203491900', 'Прочие брюки и бриджи мужские или для мальчиков, из искусственных нитей'),
                      ('6203495000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из искусственных нитей'),
                      ('6203499000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, мужские или для мальчиков, из '
                       'прочих текстильных материалов'))),
            'Унисекс': (('6104610001',
                         '6104620000',
                         '6104630000',
                         '6104690001',
                         '6104690009',
                         '6204611000',
                         '6204618500',
                         '6204621100',
                         '6204623100',
                         '6204623300',
                         '6204623900',
                         '6204629000',
                         '6204631100',
                         '6204631800',
                         '6204639000',
                         '6204691100',
                         '6204691800',
                         '6204695000',
                         '6204699000'),
                        (('6104610001',
                          'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6104620000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                          'женские или для девочек, из хлопка'),
                         ('6104630000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                          'женские или для девочек, из синтетических нитей'),
                         ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                         ('6104690009',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                          'материалов'),
                         ('6204611000',
                          'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6204618500',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6204621100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'хлопчатобумажной пряжи'),
                         ('6204623100',
                          'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                         ('6204623300',
                          'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                         ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6204629000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из хлопчатобумажной пряжи'),
                         ('6204631100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'синтетических нитей'),
                         ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                         ('6204639000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из синтетических нитей'),
                         ('6204691100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'искусственных нитей'),
                         ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                         ('6204695000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из искусственных нитей'),
                         ('6204699000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                          'прочих текстильных материалов')))},
 'БРЮКИ': {'Без указания пола': (('6104610001',
                                  '6104620000',
                                  '6104630000',
                                  '6104690001',
                                  '6104690009',
                                  '6204611000',
                                  '6204618500',
                                  '6204621100',
                                  '6204623100',
                                  '6204623300',
                                  '6204623900',
                                  '6204629000',
                                  '6204631100',
                                  '6204631800',
                                  '6204639000',
                                  '6204691100',
                                  '6204691800',
                                  '6204695000',
                                  '6204699000'),
                                 (('6104610001',
                                   'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                   'волоса животных'),
                                  ('6104620000',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                   'трикотажные женские или для девочек, из хлопка'),
                                  ('6104630000',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                   'трикотажные женские или для девочек, из синтетических нитей'),
                                  ('6104690001',
                                   'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                                  ('6104690009',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                                   'материалов'),
                                  ('6204611000',
                                   'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                   'волоса животных'),
                                  ('6204618500',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                  ('6204621100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'хлопчатобумажной пряжи'),
                                  ('6204623100',
                                   'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                                  ('6204623300',
                                   'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным '
                                   'ворсом'),
                                  ('6204623900',
                                   'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                                  ('6204629000',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из хлопчатобумажной пряжи'),
                                  ('6204631100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'синтетических нитей'),
                                  ('6204631800',
                                   'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                                  ('6204639000',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из синтетических нитей'),
                                  ('6204691100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'искусственных нитей'),
                                  ('6204691800',
                                   'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                                  ('6204695000',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из искусственных нитей'),
                                  ('6204699000',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек,из прочих текстильных материалов'))),
           'Жен.': (('6104610001',
                     '6104620000',
                     '6104630000',
                     '6104690001',
                     '6104690009',
                     '6204611000',
                     '6204618500',
                     '6204621100',
                     '6204623100',
                     '6204623300',
                     '6204623900',
                     '6204629000',
                     '6204631100',
                     '6204631800',
                     '6204639000',
                     '6204691100',
                     '6204691800',
                     '6204695000',
                     '6204699000'),
                    (('6104610001',
                      'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6104620000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                      'женские или для девочек, из хлопка'),
                     ('6104630000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                      'женские или для девочек, из синтетических нитей'),
                     ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                     ('6104690009',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов'),
                     ('6204611000',
                      'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6204618500',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6204621100',
                      'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                      'хлопчатобумажной пряжи'),
                     ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                     ('6204623300',
                      'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                     ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                     ('6204629000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'хлопчатобумажной пряжи'),
                     ('6204631100',
                      'Брюки и бриджи производственные и профессиональные, женские или для девочек, из синтетических '
                      'нитей'),
                     ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                     ('6204639000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'синтетических нитей'),
                     ('6204691100',
                      'Брюки и бриджи производственные и профессиональные, женские или для девочек, из искусственных '
                      'нитей'),
                     ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                     ('6204695000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'искусственных нитей'),
                     ('6204699000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из прочих '
                      'текстильных материалов'))),
           'Муж.': (('6103410000',
                     '6103420001',
                     '6103430001',
                     '6103490001',
                     '6103490009',
                     '6203411000',
                     '6203419000',
                     '6203421100',
                     '6203423100',
                     '6203423300',
                     '6203423500',
                     '6203429000',
                     '6203431100',
                     '6203431900',
                     '6203439000',
                     '6203491100',
                     '6203491900',
                     '6203495000',
                     '6203499000'),
                    (('6103410000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных) трикотажные, '
                      'мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6103420001', 'Брюки и бриджи, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6103430001', 'Брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                     ('6103490001', 'Брюки и бриджи мужские или для мальчиков, из прочих текстильных материалов'),
                     ('6103490009',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов, '
                      'мужские или для мальчиков'),
                     ('6203411000',
                      'Брюки и бриджи мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6203419000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6203421100',
                      'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                      'хлопчатобумажной пряжи'),
                     ('6203423100', 'Брюки и бриджи мужские или для мальчиков, из денима, или джинсовой ткани'),
                     ('6203423300', 'Брюки и бриджи мужские или для мальчиков, из вельвет-корда с разрезным ворсом'),
                     ('6203423500', 'Прочие брюки и бриджи мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6203429000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из хлопчатобумажной пряжи'),
                     ('6203431100',
                      'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из синтетических '
                      'нитей'),
                     ('6203431900', 'Прочие брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                     ('6203439000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из синтетических нитей'),
                     ('6203491100',
                      'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из искусственных '
                      'нитей'),
                     ('6203491900', 'Прочие брюки и бриджи мужские или для мальчиков, из искусственных нитей'),
                     ('6203495000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из искусственных нитей'),
                     ('6203499000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, мужские или для мальчиков, из '
                      'прочих текстильных материалов'))),
           'Унисекс': (('6104610001',
                        '6104620000',
                        '6104630000',
                        '6104690001',
                        '6104690009',
                        '6204611000',
                        '6204618500',
                        '6204621100',
                        '6204623100',
                        '6204623300',
                        '6204623900',
                        '6204629000',
                        '6204631100',
                        '6204631800',
                        '6204639000',
                        '6204691100',
                        '6204691800',
                        '6204695000',
                        '6204699000'),
                       (('6104610001',
                         'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6104620000',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                         'женские или для девочек, из хлопка'),
                        ('6104630000',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                         'женские или для девочек, из синтетических нитей'),
                        ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                        ('6104690009',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                         'материалов'),
                        ('6204611000',
                         'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6204618500',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                        ('6204621100',
                         'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                         'хлопчатобумажной пряжи'),
                        ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                        ('6204623300',
                         'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                        ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                        ('6204629000',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из хлопчатобумажной пряжи'),
                        ('6204631100',
                         'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                         'синтетических нитей'),
                        ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                        ('6204639000',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из синтетических нитей'),
                        ('6204691100',
                         'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                         'искусственных нитей'),
                        ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                        ('6204695000',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из искусственных нитей'),
                        ('6204699000',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                         'прочих текстильных материалов')))},
 'БУШЛАТ': {'Без указания пола': (('6202200000',
                                   '6202300000',
                                   '6202400001',
                                   '6202400009',
                                   '6202900001',
                                   '6202900009',
                                   '6211421000',
                                   '6211429000',
                                   '6211439000',
                                   '6211490001',
                                   '6211490009'),
                                  (('6202200000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'),
                                   ('6202400001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из химических нитей, массой одного изделия '
                                    'более 1 кг'),
                                   ('6202400009',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                   ('6202900001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов'),
                                   ('6202900009',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов, прочие'),
                                   ('6211421000',
                                    'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                    'одежда (пригодная или не пригодная для домашнего применения) женская или для '
                                    'девочек, из хлопчатобумажной пряжи'),
                                   ('6211429000',
                                    'Прочие предметы одежды женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6211439000',
                                    'Прочие предметы одежды женские или для девочек, из химических нитей'),
                                   ('6211490001',
                                    'Предметы одежды прочие женские или для девочек, из шерстяной пряжи или пряжи из '
                                    'тонкого волоса животных'),
                                   ('6211490009',
                                    'Предметы одежды прочие женские или для девочек, из прочих текстильных '
                                    'материалов'))),
            'Жен.': (('6202200000',
                      '6202300000',
                      '6202400001',
                      '6202400009',
                      '6202900001',
                      '6202900009',
                      '6211421000',
                      '6211429000',
                      '6211439000',
                      '6211490001',
                      '6211490009'),
                     (('6202200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'),
                      ('6202400001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                      ('6202400009',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из химических нитей, прочие'),
                      ('6202900001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов'),
                      ('6202900009',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов, прочие'),
                      ('6211421000',
                       'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                       '(пригодная или не пригодная для домашнего применения) женская или для девочек, из '
                       'хлопчатобумажной пряжи'),
                      ('6211429000', 'Прочие предметы одежды женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6211439000', 'Прочие предметы одежды женские или для девочек, из химических нитей'),
                      ('6211490001',
                       'Предметы одежды прочие женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6211490009',
                       'Предметы одежды прочие женские или для девочек, из прочих текстильных материалов'))),
            'Муж.': (('6201200000',
                      '6201300000',
                      '6201400000',
                      '6201900000',
                      '6211321000',
                      '6211329000',
                      '6211331000',
                      '6211339000',
                      '6211390000'),
                     (('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                       'пряжи'),
                      ('6201400000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'),
                      ('6211321000',
                       'Производственная и профессиональная одежда мужская или для мальчиков, из хлопчатобумажной '
                       'пряжи'),
                      ('6211329000',
                       '. Прочие предметы одежды мужские или для мальчиков из хлопчатобумажной пряжи, кроме '
                       'трикотажных.'),
                      ('6211331000',
                       'Производственная и профессиональная одежда мужская или для мальчиков, из химических нитей'),
                      ('6211339000', 'Прочие предметы одежды мужские или для мальчиков, из химических нитей'),
                      ('6211390000',
                       'Предметы одежды прочие мужские или для мальчиков, из прочих текстильных материалов'))),
            'Унисекс': (('6202200000',
                         '6202300000',
                         '6202400001',
                         '6202400009',
                         '6202900001',
                         '6202900009',
                         '6211421000',
                         '6211429000',
                         '6211439000',
                         '6211490001',
                         '6211490009'),
                        (('6202200000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6202400001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                         ('6202400009',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из химических нитей, прочие'),
                         ('6202900001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов'),
                         ('6202900009',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов, прочие'),
                         ('6211421000',
                          'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                          '(пригодная или не пригодная для домашнего применения) женская или для девочек, из '
                          'хлопчатобумажной пряжи'),
                         ('6211429000', 'Прочие предметы одежды женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6211439000', 'Прочие предметы одежды женские или для девочек, из химических нитей'),
                         ('6211490001',
                          'Предметы одежды прочие женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                          'волоса животных'),
                         ('6211490009',
                          'Предметы одежды прочие женские или для девочек, из прочих текстильных материалов')))},
 'ВЕТРОВКА': {'Без указания пола': (('6102109000',
                                     '6102209000',
                                     '6102309000',
                                     '6102909000',
                                     '6202200000',
                                     '6202300000',
                                     '6202400001',
                                     '6202900001',
                                     '6202900009'),
                                    (('6102109000',
                                      'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                      'для девочек из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                      'трикотажные, кроме одежды из товарной позиции 6104'),
                                     ('6102209000',
                                      'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                      'для девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной '
                                      'позиции 6104'),
                                     ('6102309000',
                                      'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                      'для девочек из химических нитей, трикотажные, кроме изделий товарной позиции '
                                      '6104'),
                                     ('6102909000',
                                      'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                      'для девочек из прочих текстильных материалов, трикотажные, кроме изделий '
                                      'товарной позиции 6104'),
                                     ('6202200000',
                                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                      'штормовки и аналогичные изделия женские или для девочек, кроме изделий товарной '
                                      'позиции 6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                     ('6202300000',
                                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                      'штормовки и аналогичные изделия женские или для девочек, кроме изделий товарной '
                                      'позиции 6204, из хлопчатобумажной пряжи'),
                                     ('6202400001',
                                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                      'девочек, кроме изделий товарной позиции 6204, из химических нитей, массой '
                                      'одного изделия более 1 кг'),
                                     ('6202900001',
                                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                      'девочек, кроме изделий товарной позиции 6204, из прочих текстильных материалов'),
                                     ('6202900009',
                                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                      'девочек, кроме изделий товарной позиции 6204, из прочих текстильных материалов, '
                                      'прочие'))),
              'Жен.': (('6102109000',
                        '6102209000',
                        '6102309000',
                        '6102909000',
                        '6202200000',
                        '6202300000',
                        '6202400001',
                        '6202900001',
                        '6202900009'),
                       (('6102109000',
                         'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                         'из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из '
                         'товарной позиции 6104'),
                        ('6102209000',
                         'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                         'из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                        ('6102309000',
                         'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                         'из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                        ('6102909000',
                         'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                         'из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                        ('6202200000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных'),
                        ('6202300000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                         'хлопчатобумажной пряжи'),
                        ('6202400001',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                        ('6202900001',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из прочих текстильных материалов'),
                        ('6202900009',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из прочих текстильных материалов, прочие'))),
              'Муж.': (('6101209000',
                        '6101309000',
                        '6101908000',
                        '6201200000',
                        '6201300000',
                        '6201400000',
                        '6201900000'),
                       (('6101209000',
                         'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия из хлопчатобумажной пряжи '
                         'трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                        ('6101309000',
                         'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские или для мальчиков '
                         'из химических нитей, трикотажные, кроме изделий товарной позиции 6103'),
                        ('6101908000',
                         'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих текстильных '
                         'материалов'),
                        ('6201200000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных'),
                        ('6201300000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                         'хлопчатобумажной пряжи'),
                        ('6201400000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                         'химических нитей'),
                        ('6201900000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                         'прочих текстильных материалов'))),
              'Унисекс': (('6102109000',
                           '6102209000',
                           '6102309000',
                           '6102909000',
                           '6202200000',
                           '6202300000',
                           '6202400001',
                           '6202900001',
                           '6202900009'),
                          (('6102109000',
                            'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                            'девочек из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме '
                            'одежды из товарной позиции 6104'),
                           ('6102209000',
                            'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                            'девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                           ('6102309000',
                            'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                            'девочек из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                           ('6102909000',
                            'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                            'девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции '
                            '6104'),
                           ('6202200000',
                            'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                            'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                            'шерстяной пряжи или пряжи из тонкого волоса животных'),
                           ('6202300000',
                            'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                            'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                            'хлопчатобумажной пряжи'),
                           ('6202400001',
                            'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                            'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                           ('6202900001',
                            'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                            'изделий товарной позиции 6204, из прочих текстильных материалов'),
                           ('6202900009',
                            'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                            'изделий товарной позиции 6204, из прочих текстильных материалов, прочие')))},
 'ВОДОЛАЗКА': {'Без указания пола': (('6110111000',
                                      '6110129001',
                                      '6110199001',
                                      '6110209900',
                                      '6110309900',
                                      '6110901000',
                                      '6110909000'),
                                     (('6110111000',
                                       'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и '
                                       'содержащие не менее 50 мас.% шерсти'),
                                      ('6110129001',
                                       'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного '
                                       'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                                       'девочек'),
                                      ('6110199001',
                                       'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                       'массой одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, '
                                       'для женщин или девочек'),
                                      ('6110209900',
                                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                       'из хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного '
                                       'вязания'),
                                      ('6110309900',
                                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                       'из химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                      ('6110901000',
                                       'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                       'льняных волокон или волокна рами, машинного или ручного вязания'),
                                      ('6110909000',
                                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                       'из прочих текстильных материалов, машинного или ручного вязания'))),
               'Жен.': (('6110111000',
                         '6110129001',
                         '6110199001',
                         '6110209900',
                         '6110309900',
                         '6110901000',
                         '6110909000'),
                        (('6110111000',
                          'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и содержащие '
                          'не менее 50 мас.% шерсти'),
                         ('6110129001',
                          'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                          'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                         ('6110199001',
                          'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                          'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                         ('6110209900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                          'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                         ('6110309900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                          'нитей, для женщин или девочек, машинного или ручного вязания'),
                         ('6110901000',
                          'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                          'или волокна рами, машинного или ручного вязания'),
                         ('6110909000',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                          'текстильных материалов, машинного или ручного вязания'))),
               'Муж.': (('6110111000',
                         '6110121001',
                         '6110191001',
                         '6110209100',
                         '6110309100',
                         '6110901000',
                         '6110909000'),
                        (('6110111000',
                          'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и содержащие '
                          'не менее 50 мас.% шерсти'),
                         ('6110121001',
                          'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                          'или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                         ('6110191001',
                          'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                          'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                         ('6110209100',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                          'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                         ('6110309100',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                          'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                         ('6110901000',
                          'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                          'или волокна рами, машинного или ручного вязания'),
                         ('6110909000',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                          'текстильных материалов, машинного или ручного вязания'))),
               'Унисекс': (('6110111000',
                            '6110129001',
                            '6110199001',
                            '6110209900',
                            '6110309900',
                            '6110901000',
                            '6110909000'),
                           (('6110111000',
                             'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и '
                             'содержащие не менее 50 мас.% шерсти'),
                            ('6110129001',
                             'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 '
                             'г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                            ('6110199001',
                             'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой '
                             'одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                             'девочек'),
                            ('6110209900',
                             'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                             'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                            ('6110309900',
                             'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                             'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                            ('6110901000',
                             'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                             'волокон или волокна рами, машинного или ручного вязания'),
                            ('6110909000',
                             'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                             'текстильных материалов, машинного или ручного вязания')))},
 'ГАЛСТУК': {'Без указания пола': (('6215100000', '6215200000', '6215900000', '6217100000'),
                                   (('6215100000',
                                     'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из '
                                     'шелковых отходов'),
                                    ('6215200000',
                                     'Галстуки, галстуки-бабочки и шейные платки, из химических '
                                     'нитей                                                                     '
                                     '<6215900000> Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                                     'материалов                                                       <6117808001> '
                                     'Галстуки, галстуки-бабочки и шейные платки трикотажные машинного или ручного '
                                     'вязания '
                                     'готовые                                                                                                                                       '
                                     '<6117808009> Прочие принадлежности к одежде трикотажные машинного или ручного '
                                     'вязания '
                                     'готовые                                                                                                                '
                                     '<6117801009> Прочие принадлежности к одежде трикотажные машинного или ручного '
                                     'вязания, эластичные или прорезиненные'),
                                    ('6215900000',
                                     'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов'),
                                    ('6217100000',
                                     'Принадлежности к одежде готовые прочие, кроме включенных в товарную позицию '
                                     '6212'))),
             'Жен.': (('6215100000', '6215200000', '6215900000', '6217100000'),
                      (('6215100000',
                        'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из шелковых отходов'),
                       ('6215200000',
                        'Галстуки, галстуки-бабочки и шейные платки, из химических '
                        'нитей                                                                     <6215900000> '
                        'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                        'материалов                                                       <6117808001> Галстуки, '
                        'галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания '
                        'готовые                                                                                                                                        '
                        '<6117808009> Прочие принадлежности к одежде трикотажные машинного или ручного вязания '
                        'готовые                                                                                                                '
                        '<6117801009> Прочие принадлежности к одежде трикотажные машинного или ручного вязания, '
                        'эластичные или прорезиненные'),
                       ('6215900000', 'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов'),
                       ('6217100000',
                        'Принадлежности к одежде готовые прочие, кроме включенных в товарную позицию 6212'))),
             'Муж.': (('6215100000', '6215200000', '6215900000', '6217100000'),
                      (('6215100000',
                        'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из шелковых отходов'),
                       ('6215200000',
                        'Галстуки, галстуки-бабочки и шейные платки, из химических '
                        'нитей                                                                     <6215900000> '
                        'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                        'материалов                                                       <6117808001> Галстуки, '
                        'галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания '
                        'готовые                                                                                                                                       '
                        '<6117808009> Прочие принадлежности к одежде трикотажные машинного или ручного вязания '
                        'готовые                                                                                                                '
                        '<6117801009> Прочие принадлежности к одежде трикотажные машинного или ручного вязания, '
                        'эластичные или прорезиненные'),
                       ('6215900000', 'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов'),
                       ('6217100000',
                        'Принадлежности к одежде готовые прочие, кроме включенных в товарную позицию 6212'))),
             'Унисекс': (('6215100000', '6215200000', '6215900000', '6217100000'),
                         (('6215100000',
                           'Галстуки, галстуки-бабочки и шейные платки, из шелковых нитей или пряжи из шелковых '
                           'отходов'),
                          ('6215200000',
                           'Галстуки, галстуки-бабочки и шейные платки, из химических '
                           'нитей                                                                     <6215900000> '
                           'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных '
                           'материалов                                                       <6117808001> Галстуки, '
                           'галстуки-бабочки и шейные платки трикотажные машинного или ручного вязания '
                           'готовые                                                                                                                                '
                           '<6117808009> Прочие принадлежности к одежде трикотажные машинного или ручного вязания '
                           'готовые                                                                                                                '
                           '<6117801009> Прочие принадлежности к одежде трикотажные машинного или ручного вязания, '
                           'эластичные или прорезиненные'),
                          ('6215900000',
                           'Галстуки, галстуки-бабочки и шейные платки, из прочих текстильных материалов'),
                          ('6217100000',
                           'Принадлежности к одежде готовые прочие, кроме включенных в товарную позицию 6212')))},
 'ДЖЕМПЕР': {'Без указания пола': (('6110201000', '6110209900', '6110301000', '6110309900', '6110901000', '6110909000'),
                                   (('6110201000',
                                     'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким '
                                     'одинарным или двойным воротом из хлопчатобумажной пряжи, машинного или ручного '
                                     'вязания'),
                                    ('6110209900',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                    ('6110301000',
                                     'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким '
                                     'одинарным или двойным воротом, из химических нитей, машинного или ручного '
                                     'вязания'),
                                    ('6110309900',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                    ('6110901000',
                                     'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'льняных волокон или волокна рами, машинного или ручного вязания'),
                                    ('6110909000',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'прочих текстильных материалов, машинного или ручного вязания'))),
             'Жен.': (('6110201000', '6110209900', '6110301000', '6110309900', '6110901000', '6110909000'),
                      (('6110201000',
                        'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                        'или двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                       ('6110209900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                       ('6110301000',
                        'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                        'или двойным воротом, из химических нитей, машинного или ручного вязания'),
                       ('6110309900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для женщин или девочек, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания'))),
             'Муж.': (('6110209100', '6110301000', '6110309100', '6110901000', '6110909000'),
                      (('6110209100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110301000',
                        'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                        'или двойным воротом, из химических нитей, машинного или ручного вязания'),
                       ('6110309100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания'))),
             'Унисекс': (('6110201000', '6110209900', '6110301000', '6110309900', '6110901000', '6110909000'),
                         (('6110201000',
                           'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                           'или двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                          ('6110209900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                          ('6110301000',
                           'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                           'или двойным воротом, из химических нитей, машинного или ручного вязания'),
                          ('6110309900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                          ('6110901000',
                           'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                           'или волокна рами, машинного или ручного вязания'),
                          ('6110909000',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                           'текстильных материалов, машинного или ручного вязания')))},
 'ДЖИНСЫ': {'Без указания пола': (('6104610001',
                                   '6104620000',
                                   '6104630000',
                                   '6104690001',
                                   '6104690009',
                                   '6204611000',
                                   '6204618500',
                                   '6204621100',
                                   '6204623100',
                                   '6204623300',
                                   '6204623900',
                                   '6204629000',
                                   '6204631100',
                                   '6204631800',
                                   '6204639000',
                                   '6204691100',
                                   '6204691800',
                                   '6204695000',
                                   '6204699000'),
                                  (('6104610001',
                                    'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                    'волоса животных'),
                                   ('6104620000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                    'трикотажные женские или для девочек, из хлопка'),
                                   ('6104630000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                    'трикотажные женские или для девочек, из синтетических нитей'),
                                   ('6104690001',
                                    'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                                   ('6104690009',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих '
                                    'текстильных материалов'),
                                   ('6204611000',
                                    'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                    'волоса животных'),
                                   ('6204618500',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6204621100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6204623100',
                                    'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                                   ('6204623300',
                                    'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным '
                                    'ворсом'),
                                   ('6204623900',
                                    'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6204629000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из хлопчатобумажной пряжи'),
                                   ('6204631100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'синтетических нитей'),
                                   ('6204631800',
                                    'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                                   ('6204639000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из синтетических нитей'),
                                   ('6204691100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'искусственных нитей'),
                                   ('6204691800',
                                    'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                                   ('6204695000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из искусственных нитей'),
                                   ('6204699000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                    'девочек,из прочих текстильных материалов'))),
            'Жен.': (('6104610001',
                      '6104620000',
                      '6104630000',
                      '6104690001',
                      '6104690009',
                      '6204611000',
                      '6204618500',
                      '6204621100',
                      '6204623100',
                      '6204623300',
                      '6204623900',
                      '6204629000',
                      '6204631100',
                      '6204631800',
                      '6204639000',
                      '6204691100',
                      '6204691800',
                      '6204695000',
                      '6204699000'),
                     (('6104610001',
                       'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6104620000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                       'женские или для девочек, из хлопка'),
                      ('6104630000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                       'женские или для девочек, из синтетических нитей'),
                      ('6104690001',
                       'Брюки и бриджи, женские или для девочек, из прочих текстильных '
                       'материалов                                                                                                  '
                       '<6204699000> Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                       'девочек,из прочих текстильных материалов'),
                      ('6104690009',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов'),
                      ('6204611000',
                       'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6204618500',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6204621100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                       'хлопчатобумажной пряжи'),
                      ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                      ('6204623300',
                       'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                      ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6204629000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'хлопчатобумажной пряжи'),
                      ('6204631100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из синтетических '
                       'нитей'),
                      ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                      ('6204639000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'синтетических нитей'),
                      ('6204691100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из искусственных '
                       'нитей'),
                      ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                      ('6204695000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'искусственных нитей'),
                      ('6204699000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из прочих '
                       'текстильных материалов'))),
            'Муж.': (('6103410000',
                      '6103420001',
                      '6103430001',
                      '6103490001',
                      '6103490009',
                      '6203411000',
                      '6203419000',
                      '6203421100',
                      '6203423100',
                      '6203423300',
                      '6203423500',
                      '6203429000',
                      '6203431100',
                      '6203431900',
                      '6203439000',
                      '6203491100',
                      '6203491900',
                      '6203495000',
                      '6203499000'),
                     (('6103410000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных) трикотажные, '
                       'мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6103420001', 'Брюки и бриджи, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6103430001', 'Брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                      ('6103490001',
                       'Брюки и бриджи мужские или для мальчиков, из прочих текстильных '
                       'материалов                                                                                                  '
                       '<6103490009> Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих '
                       'текстильных материалов, мужские или для мальчиков'),
                      ('6103490009',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов, '
                       'мужские или для мальчиков'),
                      ('6203411000',
                       'Брюки и бриджи мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6203419000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6203421100',
                       'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                       'хлопчатобумажной пряжи'),
                      ('6203423100', 'Брюки и бриджи мужские или для мальчиков, из денима, или джинсовой ткани'),
                      ('6203423300', 'Брюки и бриджи мужские или для мальчиков, из вельвет-корда с разрезным ворсом'),
                      ('6203423500', 'Прочие брюки и бриджи мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6203429000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из хлопчатобумажной пряжи'),
                      ('6203431100',
                       'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                       'синтетических нитей'),
                      ('6203431900', 'Прочие брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                      ('6203439000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из синтетических нитей'),
                      ('6203491100',
                       'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                       'искусственных нитей'),
                      ('6203491900', 'Прочие брюки и бриджи мужские или для мальчиков, из искусственных нитей'),
                      ('6203495000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из искусственных нитей'),
                      ('6203499000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, мужские или для мальчиков, из '
                       'прочих текстильных материалов'))),
            'Унисекс': (('6104610001',
                         '6104620000',
                         '6104630000',
                         '6104690001',
                         '6104690009',
                         '6204611000',
                         '6204618500',
                         '6204621100',
                         '6204623100',
                         '6204623300',
                         '6204623900',
                         '6204629000',
                         '6204631100',
                         '6204631800',
                         '6204639000',
                         '6204691100',
                         '6204691800',
                         '6204695000',
                         '6204699000'),
                        (('6104610001',
                          'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6104620000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                          'женские или для девочек, из хлопка'),
                         ('6104630000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                          'женские или для девочек, из синтетических нитей'),
                         ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                         ('6104690009',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                          'материалов'),
                         ('6204611000',
                          'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6204618500',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6204621100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'хлопчатобумажной пряжи'),
                         ('6204623100',
                          'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                         ('6204623300',
                          'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                         ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6204629000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из хлопчатобумажной пряжи'),
                         ('6204631100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'синтетических нитей'),
                         ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                         ('6204639000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из синтетических нитей'),
                         ('6204691100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'искусственных нитей'),
                         ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                         ('6204695000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из искусственных нитей'),
                         ('6204699000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                          'прочих текстильных материалов')))},
 'ДОЖДЕВИК': {'Без указания пола': (('6202900001',),
                                    (('6202900001',
                                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                      'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                      'материалов'),)),
              'Жен.': (('6202900001',),
                       (('6202900001',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из прочих текстильных материалов'),)),
              'Муж.': (('6201900000',),
                       (('6201900000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                         'прочих текстильных материалов'),)),
              'Унисекс': (('6202900001',),
                          (('6202900001',
                            'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                            'изделий товарной позиции 6204, из прочих текстильных материалов'),))},
 'ДУБЛЕНКА': {'Без указания пола': (('4203100001',
                                     '4203100009',
                                     '4303109010',
                                     '4303109050',
                                     '4303109060',
                                     '4304000000',
                                     '6210500000'),
                                    (('4203100001', '- -- из натуральной кожи'),
                                     ('4203100009', '- - прочие'),
                                     ('4303109010', '- - - предметы одежды из норки'),
                                     ('4303109050', '- - - предметы одежды из енота'),
                                     ('4303109060', '- - - предметы одежды из овчины'),
                                     ('4304000000', 'Мех искусственный и изделия из него'),
                                     ('6210500000', '- кожзам')))},
 'ЖАКЕТ': {'Без указания пола': (('6104310000',
                                  '6104320000',
                                  '6104330000',
                                  '6104390000',
                                  '6204310000',
                                  '6204321000',
                                  '6204329000',
                                  '6204331000',
                                  '6204339000',
                                  '6204391100',
                                  '6204391900',
                                  '6204399000'),
                                 (('6104310000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или '
                                   'пряжи из тонкого волоса животных, машинного или ручного вязания'),
                                  ('6104320000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной '
                                   'пряжи, машинного или ручного вязания'),
                                  ('6104330000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, '
                                   'машинного или ручного вязания'),
                                  ('6104390000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                                   'материалов, машинного или ручного вязания                                          '
                                   '<6204399000> Прочие жакеты и блайзеры женские или для девочек, из прочих '
                                   'текстильных материалов'),
                                  ('6204310000',
                                   'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                   'волоса животных'),
                                  ('6204321000',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'хлопчатобумажной пряжи'),
                                  ('6204329000',
                                   'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                                  ('6204331000',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'синтетических нитей'),
                                  ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                  ('6204391100',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'искусственных нитей'),
                                  ('6204391900',
                                   'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                                  ('6204399000',
                                   'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                   'материалов'))),
           'Жен.': (('6104310000',
                     '6104320000',
                     '6104330000',
                     '6104390000',
                     '6204310000',
                     '6204321000',
                     '6204329000',
                     '6204331000',
                     '6204339000',
                     '6204391100',
                     '6204391900',
                     '6204399000'),
                    (('6104310000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                      'тонкого волоса животных, машинного или ручного вязания'),
                     ('6104320000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, машинного '
                      'или ручного вязания'),
                     ('6104330000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного или '
                      'ручного вязания'),
                     ('6104390000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                      'машинного или ручного вязания                                          <6204399000> Прочие '
                      'жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'),
                     ('6204310000',
                      'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6204321000',
                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                      'хлопчатобумажной пряжи'),
                     ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                     ('6204331000',
                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                      'синтетических нитей'),
                     ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                     ('6204391100',
                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                      'искусственных нитей'),
                     ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                     ('6204399000',
                      'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'))),
           'Муж.': (('6103310000',
                     '6103320000',
                     '6103330000',
                     '6103390000',
                     '6203310000',
                     '6203321000',
                     '6203329000',
                     '6203331000',
                     '6203339000',
                     '6203391100',
                     '6203391900',
                     '6203399000'),
                    (('6103310000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из '
                      'тонкого волоса животных, машинного или ручного вязания'),
                     ('6103320000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6103330000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из синтетических нитей'),
                     ('6103390000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из прочих текстильных материалов'),
                     ('6203310000',
                      'Пиджаки и блайзеры мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6203321000',
                      'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                      'хлопчатобумажной пряжи'),
                     ('6203329000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6203331000',
                      'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                      'синтетических нитей'),
                     ('6203339000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из синтетических нитей'),
                     ('6203391100',
                      'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                      'искусственных нитей'),
                     ('6203391900', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из искусственных нитей'),
                     ('6203399000', 'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов'))),
           'Унисекс': (('6104310000',
                        '6104320000',
                        '6104330000',
                        '6104390000',
                        '6204310000',
                        '6204321000',
                        '6204329000',
                        '6204331000',
                        '6204339000',
                        '6204391100',
                        '6204391900',
                        '6204399000'),
                       (('6104310000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                         'тонкого волоса животных, машинного или ручного вязания'),
                        ('6104320000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                         'машинного или ручного вязания'),
                        ('6104330000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                         'или ручного вязания'),
                        ('6104390000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                         'машинного или ручного вязания                                          <6204399000> Прочие '
                         'жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'),
                        ('6204310000',
                         'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6204321000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'хлопчатобумажной пряжи'),
                        ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                        ('6204331000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'синтетических нитей'),
                        ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                        ('6204391100',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'искусственных нитей'),
                        ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                        ('6204399000',
                         'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов')))},
 'ЖИЛЕТ': {'Без указания пола': (('6110119000',
                                  '6110129009',
                                  '6110199009',
                                  '6110209900',
                                  '6110309900',
                                  '6110901000',
                                  '6110909000'),
                                 (('6110119000',
                                   'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или '
                                   'девочек, из шерстяной пряжи, машинного или ручного вязания'),
                                  ('6110129009',
                                   'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, '
                                   'из пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                                  ('6110199009',
                                   'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, '
                                   'из шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                                  ('6110209900',
                                   'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                   'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                  ('6110309900',
                                   'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                   'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                  ('6110901000',
                                   'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                                   'волокон или волокна рами, машинного или ручного вязания'),
                                  ('6110909000',
                                   'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                   'прочих текстильных материалов, машинного или ручного вязания'))),
           'Жен.': (('6110119000', '6110129009', '6110199009', '6110209900', '6110309900', '6110901000', '6110909000'),
                    (('6110119000',
                      'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                      'шерстяной пряжи, машинного или ручного вязания'),
                     ('6110129009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                      'тонкого волоса кашмирской козы, для женщин или девочек'),
                     ('6110199009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из шерстяной '
                      'пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                     ('6110209900',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                      'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                     ('6110309900',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                      'нитей, для женщин или девочек, машинного или ручного вязания'),
                     ('6110901000',
                      'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                      'волокна рами, машинного или ручного вязания'),
                     ('6110909000',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                      'текстильных материалов, машинного или ручного вязания'))),
           'Муж.': (('6110113000', '6110121009', '6110191009', '6110209100', '6110309100', '6110901000', '6110909000'),
                    (('6110113000',
                      'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для мужчин или мальчиков, из '
                      'шерстяной пряжи, машинного или ручного вязания'),
                     ('6110121009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                      'тонкого волоса кашмирской козы, для мужчин или мальчиков'),
                     ('6110191009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из шерстяной '
                      'пряжи или пряжи из тонкого волоса животных, для мужчин или мальчиков'),
                     ('6110209100',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                      'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                     ('6110309100',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                      'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                     ('6110901000',
                      'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                      'волокна рами, машинного или ручного вязания'),
                     ('6110909000',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                      'текстильных материалов, машинного или ручного вязания'))),
           'Унисекс': (('6110119000',
                        '6110129009',
                        '6110199009',
                        '6110209900',
                        '6110309900',
                        '6110901000',
                        '6110909000'),
                       (('6110119000',
                         'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                         'шерстяной пряжи, машинного или ручного вязания'),
                        ('6110129009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи '
                         'из тонкого волоса кашмирской козы, для женщин или девочек'),
                        ('6110199009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                        ('6110209900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                         'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                        ('6110309900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                         'нитей, для женщин или девочек, машинного или ручного вязания'),
                        ('6110901000',
                         'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                         'или волокна рами, машинного или ручного вязания'),
                        ('6110909000',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                         'текстильных материалов, машинного или ручного вязания')))},
 'ЗАЩИТНАЯ ФОРМА': {'Без указания пола': (('6204221000',
                                           '6204231000',
                                           '6204291100',
                                           '6204321000',
                                           '6204331000',
                                           '6204391100',
                                           '6204621100',
                                           '6204625100',
                                           '6204631100',
                                           '6204633100',
                                           '6204691100',
                                           '6204693100',
                                           '6211421000',
                                           '6211431000'),
                                          (('6204221000',
                                            'Комплекты женские или для девочек, производственные и профессиональные, '
                                            'из хлопчатобумажной пряжи'),
                                           ('6204231000',
                                            'Комплекты женские или для девочек, производственные и профессиональные, '
                                            'из синтетических нитей'),
                                           ('6204291100',
                                            'Комплекты женские или для девочек, производственные и профессиональные, '
                                            'из искусственных нитей'),
                                           ('6204321000',
                                            'Жакеты и блайзеры женские или для девочек, производственные и '
                                            'профессиональные, из хлопчатобумажной пряжи'),
                                           ('6204331000',
                                            'Жакеты и блайзеры женские или для девочек, производственные и '
                                            'профессиональные, из синтетических нитей'),
                                           ('6204391100',
                                            'Жакеты и блайзеры женские или для девочек, производственные и '
                                            'профессиональные, из искусственных нитей'),
                                           ('6204621100',
                                            'Брюки и бриджи производственные и профессиональные, женские или для '
                                            'девочек, из хлопчатобумажной пряжи'),
                                           ('6204625100',
                                            'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                            'женские или для девочек, из хлопчатобумажной пряжи'),
                                           ('6204631100',
                                            'Брюки и бриджи производственные и профессиональные, женские или для '
                                            'девочек, из синтетических нитей'),
                                           ('6204633100',
                                            'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                            'женские или для девочек, из синтетических нитей'),
                                           ('6204691100',
                                            'Брюки и бриджи производственные и профессиональные, женские или для '
                                            'девочек, из искусственных нитей'),
                                           ('6204693100',
                                            'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                            'женские или для девочек, из искусственных нитей'),
                                           ('6211421000',
                                            'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                            'профессиональная одежда (пригодная или не пригодная для домашнего '
                                            'применения) женская или для девочек, из хлопчатобумажной пряжи'),
                                           ('6211431000',
                                            'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                            'профессиональная одежда (пригодная или не пригодная для домашнего '
                                            'применения), из химических нитей, женская или для девочек'))),
                    'Жен.': (('6204221000',
                              '6204231000',
                              '6204291100',
                              '6204321000',
                              '6204331000',
                              '6204391100',
                              '6204621100',
                              '6204625100',
                              '6204631100',
                              '6204633100',
                              '6204691100',
                              '6204693100',
                              '6211421000',
                              '6211431000'),
                             (('6204221000',
                               'Комплекты женские или для девочек, производственные и профессиональные, из '
                               'хлопчатобумажной пряжи'),
                              ('6204231000',
                               'Комплекты женские или для девочек, производственные и профессиональные, из '
                               'синтетических нитей'),
                              ('6204291100',
                               'Комплекты женские или для девочек, производственные и профессиональные, из '
                               'искусственных нитей'),
                              ('6204321000',
                               'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                               'хлопчатобумажной пряжи'),
                              ('6204331000',
                               'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                               'синтетических нитей'),
                              ('6204391100',
                               'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                               'искусственных нитей'),
                              ('6204621100',
                               'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                               'хлопчатобумажной пряжи'),
                              ('6204625100',
                               'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                               'для девочек, из хлопчатобумажной пряжи'),
                              ('6204631100',
                               'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                               'синтетических нитей'),
                              ('6204633100',
                               'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                               'для девочек, из синтетических нитей'),
                              ('6204691100',
                               'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                               'искусственных нитей'),
                              ('6204693100',
                               'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                               'для девочек, из искусственных нитей'),
                              ('6211421000',
                               'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                               '(пригодная или не пригодная для домашнего применения) женская или для девочек, из '
                               'хлопчатобумажной пряжи'),
                              ('6211431000',
                               'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                               '(пригодная или не пригодная для домашнего применения), из химических нитей, женская '
                               'или для девочек'))),
                    'Муж.': (('6203221000',
                              '6203231000',
                              '6203291100',
                              '6203321000',
                              '6203331000',
                              '6203391100',
                              '6203421100',
                              '6203425100',
                              '6203431100',
                              '6203433100',
                              '6203491100',
                              '6203493100',
                              '6211321000',
                              '6211331000'),
                             (('6203221000',
                               'Комплекты производственные и профессиональные мужские или для мальчиков, из '
                               'хлопчатобумажной пряжи'),
                              ('6203231000',
                               'Комплекты производственные и профессиональные мужские или для мальчиков, из '
                               'синтетических нитей'),
                              ('6203291100',
                               'Комплекты производственные и профессиональные, мужские или для мальчиков, из '
                               'искусственных нитей'),
                              ('6203321000',
                               'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                               'хлопчатобумажной пряжи'),
                              ('6203331000',
                               'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                               'синтетических нитей'),
                              ('6203391100',
                               'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                               'искусственных нитей'),
                              ('6203421100',
                               'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                               'хлопчатобумажной пряжи'),
                              ('6203425100',
                               'Комбинезоны с нагрудниками и лямками производственные и профессиональные мужские или '
                               'для мальчиков, из хлопчатобумажной пряжи'),
                              ('6203431100',
                               'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                               'синтетических нитей'),
                              ('6203433100',
                               'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские или '
                               'для мальчиков, из синтетических нитей'),
                              ('6203491100',
                               'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                               'искусственных нитей'),
                              ('6203493100',
                               'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские или '
                               'для мальчиков, из искусственных нитей'),
                              ('6211321000',
                               'Производственная и профессиональная одежда мужская или для мальчиков, из '
                               'хлопчатобумажной пряжи'),
                              ('6211331000',
                               'Производственная и профессиональная одежда мужская или для мальчиков, из химических '
                               'нитей'))),
                    'Унисекс': (('6204221000',
                                 '6204231000',
                                 '6204291100',
                                 '6204321000',
                                 '6204331000',
                                 '6204391100',
                                 '6204621100',
                                 '6204625100',
                                 '6204631100',
                                 '6204633100',
                                 '6204691100',
                                 '6204693100',
                                 '6211421000',
                                 '6211431000'),
                                (('6204221000',
                                  'Комплекты женские или для девочек, производственные и профессиональные, из '
                                  'хлопчатобумажной пряжи'),
                                 ('6204231000',
                                  'Комплекты женские или для девочек, производственные и профессиональные, из '
                                  'синтетических нитей'),
                                 ('6204291100',
                                  'Комплекты женские или для девочек, производственные и профессиональные, из '
                                  'искусственных нитей'),
                                 ('6204321000',
                                  'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                  'хлопчатобумажной пряжи'),
                                 ('6204331000',
                                  'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                  'синтетических нитей'),
                                 ('6204391100',
                                  'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                  'искусственных нитей'),
                                 ('6204621100',
                                  'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                  'хлопчатобумажной пряжи'),
                                 ('6204625100',
                                  'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                  'или для девочек, из хлопчатобумажной пряжи'),
                                 ('6204631100',
                                  'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                  'синтетических нитей'),
                                 ('6204633100',
                                  'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                  'или для девочек, из синтетических нитей'),
                                 ('6204691100',
                                  'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                  'искусственных нитей'),
                                 ('6204693100',
                                  'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                  'или для девочек, из искусственных нитей'),
                                 ('6211421000',
                                  'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                  'одежда (пригодная или не пригодная для домашнего применения) женская или для '
                                  'девочек, из хлопчатобумажной пряжи'),
                                 ('6211431000',
                                  'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                  'одежда (пригодная или не пригодная для домашнего применения), из химических нитей, '
                                  'женская или для девочек')))},
 'ЗАЩИТНЫЙ КОМБИНЕЗОН': {'Без указания пола': (('6204221000',
                                                '6204231000',
                                                '6204291100',
                                                '6204321000',
                                                '6204331000',
                                                '6204391100',
                                                '6204621100',
                                                '6204625100',
                                                '6204631100',
                                                '6204633100',
                                                '6204691100',
                                                '6204693100',
                                                '6211421000',
                                                '6211431000'),
                                               (('6204221000',
                                                 'Комплекты женские или для девочек, производственные и '
                                                 'профессиональные, из хлопчатобумажной пряжи'),
                                                ('6204231000',
                                                 'Комплекты женские или для девочек, производственные и '
                                                 'профессиональные, из синтетических нитей'),
                                                ('6204291100',
                                                 'Комплекты женские или для девочек, производственные и '
                                                 'профессиональные, из искусственных нитей'),
                                                ('6204321000',
                                                 'Жакеты и блайзеры женские или для девочек, производственные и '
                                                 'профессиональные, из хлопчатобумажной пряжи'),
                                                ('6204331000',
                                                 'Жакеты и блайзеры женские или для девочек, производственные и '
                                                 'профессиональные, из синтетических нитей'),
                                                ('6204391100',
                                                 'Жакеты и блайзеры женские или для девочек, производственные и '
                                                 'профессиональные, из искусственных нитей'),
                                                ('6204621100',
                                                 'Брюки и бриджи производственные и профессиональные, женские или для '
                                                 'девочек, из хлопчатобумажной пряжи'),
                                                ('6204625100',
                                                 'Комбинезоны с нагрудниками и лямками производственные и '
                                                 'профессиональные, женские или для девочек, из хлопчатобумажной '
                                                 'пряжи'),
                                                ('6204631100',
                                                 'Брюки и бриджи производственные и профессиональные, женские или для '
                                                 'девочек, из синтетических нитей'),
                                                ('6204633100',
                                                 'Комбинезоны с нагрудниками и лямками производственные и '
                                                 'профессиональные, женские или для девочек, из синтетических нитей'),
                                                ('6204691100',
                                                 'Брюки и бриджи производственные и профессиональные, женские или для '
                                                 'девочек, из искусственных нитей'),
                                                ('6204693100',
                                                 'Комбинезоны с нагрудниками и лямками производственные и '
                                                 'профессиональные, женские или для девочек, из искусственных нитей'),
                                                ('6211421000',
                                                 'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                                 'профессиональная одежда (пригодная или не пригодная для домашнего '
                                                 'применения) женская или для девочек, из хлопчатобумажной пряжи'),
                                                ('6211431000',
                                                 'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                                 'профессиональная одежда (пригодная или не пригодная для домашнего '
                                                 'применения), из химических нитей, женская или для девочек'))),
                         'Жен.': (('6204221000',
                                   '6204231000',
                                   '6204291100',
                                   '6204321000',
                                   '6204331000',
                                   '6204391100',
                                   '6204621100',
                                   '6204625100',
                                   '6204631100',
                                   '6204633100',
                                   '6204691100',
                                   '6204693100',
                                   '6211421000',
                                   '6211431000'),
                                  (('6204221000',
                                    'Комплекты женские или для девочек, производственные и профессиональные, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6204231000',
                                    'Комплекты женские или для девочек, производственные и профессиональные, из '
                                    'синтетических нитей'),
                                   ('6204291100',
                                    'Комплекты женские или для девочек, производственные и профессиональные, из '
                                    'искусственных нитей'),
                                   ('6204321000',
                                    'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                    'из хлопчатобумажной пряжи'),
                                   ('6204331000',
                                    'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                    'из синтетических нитей'),
                                   ('6204391100',
                                    'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                    'из искусственных нитей'),
                                   ('6204621100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6204625100',
                                    'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                    'или для девочек, из хлопчатобумажной пряжи'),
                                   ('6204631100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'синтетических нитей'),
                                   ('6204633100',
                                    'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                    'или для девочек, из синтетических нитей'),
                                   ('6204691100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'искусственных нитей'),
                                   ('6204693100',
                                    'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                    'или для девочек, из искусственных нитей'),
                                   ('6211421000',
                                    'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                    'одежда (пригодная или не пригодная для домашнего применения) женская или для '
                                    'девочек, из хлопчатобумажной пряжи'),
                                   ('6211431000',
                                    'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                    'одежда (пригодная или не пригодная для домашнего применения), из химических '
                                    'нитей, женская или для девочек'))),
                         'Муж.': (('6203221000',
                                   '6203231000',
                                   '6203291100',
                                   '6203321000',
                                   '6203331000',
                                   '6203391100',
                                   '6203421100',
                                   '6203425100',
                                   '6203431100',
                                   '6203433100',
                                   '6203491100',
                                   '6203493100',
                                   '6211321000',
                                   '6211331000'),
                                  (('6203221000',
                                    'Комплекты производственные и профессиональные мужские или для мальчиков, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6203231000',
                                    'Комплекты производственные и профессиональные мужские или для мальчиков, из '
                                    'синтетических нитей'),
                                   ('6203291100',
                                    'Комплекты производственные и профессиональные, мужские или для мальчиков, из '
                                    'искусственных нитей'),
                                   ('6203321000',
                                    'Пиджаки и блайзеры производственные и профессиональные, мужские или для '
                                    'мальчиков, из хлопчатобумажной пряжи'),
                                   ('6203331000',
                                    'Пиджаки и блайзеры производственные и профессиональные, мужские или для '
                                    'мальчиков, из синтетических нитей'),
                                   ('6203391100',
                                    'Пиджаки и блайзеры производственные и профессиональные, мужские или для '
                                    'мальчиков, из искусственных нитей'),
                                   ('6203421100',
                                    'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6203425100',
                                    'Комбинезоны с нагрудниками и лямками производственные и профессиональные мужские '
                                    'или для мальчиков, из хлопчатобумажной пряжи'),
                                   ('6203431100',
                                    'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                                    'синтетических нитей'),
                                   ('6203433100',
                                    'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские '
                                    'или для мальчиков, из синтетических нитей'),
                                   ('6203491100',
                                    'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                                    'искусственных нитей'),
                                   ('6203493100',
                                    'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские '
                                    'или для мальчиков, из искусственных нитей'),
                                   ('6211321000',
                                    'Производственная и профессиональная одежда мужская или для мальчиков, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6211331000',
                                    'Производственная и профессиональная одежда мужская или для мальчиков, из '
                                    'химических нитей'))),
                         'Унисекс': (('6204221000',
                                      '6204231000',
                                      '6204291100',
                                      '6204321000',
                                      '6204331000',
                                      '6204391100',
                                      '6204621100',
                                      '6204625100',
                                      '6204631100',
                                      '6204633100',
                                      '6204691100',
                                      '6204693100',
                                      '6211421000',
                                      '6211431000'),
                                     (('6204221000',
                                       'Комплекты женские или для девочек, производственные и профессиональные, из '
                                       'хлопчатобумажной пряжи'),
                                      ('6204231000',
                                       'Комплекты женские или для девочек, производственные и профессиональные, из '
                                       'синтетических нитей'),
                                      ('6204291100',
                                       'Комплекты женские или для девочек, производственные и профессиональные, из '
                                       'искусственных нитей'),
                                      ('6204321000',
                                       'Жакеты и блайзеры женские или для девочек, производственные и '
                                       'профессиональные, из хлопчатобумажной пряжи'),
                                      ('6204331000',
                                       'Жакеты и блайзеры женские или для девочек, производственные и '
                                       'профессиональные, из синтетических нитей'),
                                      ('6204391100',
                                       'Жакеты и блайзеры женские или для девочек, производственные и '
                                       'профессиональные, из искусственных нитей'),
                                      ('6204621100',
                                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, '
                                       'из хлопчатобумажной пряжи'),
                                      ('6204625100',
                                       'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                       'женские или для девочек, из хлопчатобумажной пряжи'),
                                      ('6204631100',
                                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, '
                                       'из синтетических нитей'),
                                      ('6204633100',
                                       'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                       'женские или для девочек, из синтетических нитей'),
                                      ('6204691100',
                                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, '
                                       'из искусственных нитей'),
                                      ('6204693100',
                                       'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                       'женские или для девочек, из искусственных нитей'),
                                      ('6211421000',
                                       'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                       'одежда (пригодная или не пригодная для домашнего применения) женская или для '
                                       'девочек, из хлопчатобумажной пряжи'),
                                      ('6211431000',
                                       'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                       'одежда (пригодная или не пригодная для домашнего применения), из химических '
                                       'нитей, женская или для девочек')))},
 'ЗАЩИТНЫЙ КОСТЮМ': {'Без указания пола': (('6204221000',
                                            '6204231000',
                                            '6204291100',
                                            '6204321000',
                                            '6204331000',
                                            '6204391100',
                                            '6204621100',
                                            '6204625100',
                                            '6204631100',
                                            '6204633100',
                                            '6204691100',
                                            '6204693100',
                                            '6211421000',
                                            '6211431000'),
                                           (('6204221000',
                                             'Комплекты женские или для девочек, производственные и профессиональные, '
                                             'из хлопчатобумажной пряжи'),
                                            ('6204231000',
                                             'Комплекты женские или для девочек, производственные и профессиональные, '
                                             'из синтетических нитей'),
                                            ('6204291100',
                                             'Комплекты женские или для девочек, производственные и профессиональные, '
                                             'из искусственных нитей'),
                                            ('6204321000',
                                             'Жакеты и блайзеры женские или для девочек, производственные и '
                                             'профессиональные, из хлопчатобумажной пряжи'),
                                            ('6204331000',
                                             'Жакеты и блайзеры женские или для девочек, производственные и '
                                             'профессиональные, из синтетических нитей'),
                                            ('6204391100',
                                             'Жакеты и блайзеры женские или для девочек, производственные и '
                                             'профессиональные, из искусственных нитей'),
                                            ('6204621100',
                                             'Брюки и бриджи производственные и профессиональные, женские или для '
                                             'девочек, из хлопчатобумажной пряжи'),
                                            ('6204625100',
                                             'Комбинезоны с нагрудниками и лямками производственные и '
                                             'профессиональные, женские или для девочек, из хлопчатобумажной пряжи'),
                                            ('6204631100',
                                             'Брюки и бриджи производственные и профессиональные, женские или для '
                                             'девочек, из синтетических нитей'),
                                            ('6204633100',
                                             'Комбинезоны с нагрудниками и лямками производственные и '
                                             'профессиональные, женские или для девочек, из синтетических нитей'),
                                            ('6204691100',
                                             'Брюки и бриджи производственные и профессиональные, женские или для '
                                             'девочек, из искусственных нитей'),
                                            ('6204693100',
                                             'Комбинезоны с нагрудниками и лямками производственные и '
                                             'профессиональные, женские или для девочек, из искусственных нитей'),
                                            ('6211421000',
                                             'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                             'профессиональная одежда (пригодная или не пригодная для домашнего '
                                             'применения) женская или для девочек, из хлопчатобумажной пряжи'),
                                            ('6211431000',
                                             'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                             'профессиональная одежда (пригодная или не пригодная для домашнего '
                                             'применения), из химических нитей, женская или для девочек'))),
                     'Жен.': (('6204221000',
                               '6204231000',
                               '6204291100',
                               '6204321000',
                               '6204331000',
                               '6204391100',
                               '6204621100',
                               '6204625100',
                               '6204631100',
                               '6204633100',
                               '6204691100',
                               '6204693100',
                               '6211421000',
                               '6211431000'),
                              (('6204221000',
                                'Комплекты женские или для девочек, производственные и профессиональные, из '
                                'хлопчатобумажной пряжи'),
                               ('6204231000',
                                'Комплекты женские или для девочек, производственные и профессиональные, из '
                                'синтетических нитей'),
                               ('6204291100',
                                'Комплекты женские или для девочек, производственные и профессиональные, из '
                                'искусственных нитей'),
                               ('6204321000',
                                'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                'хлопчатобумажной пряжи'),
                               ('6204331000',
                                'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                'синтетических нитей'),
                               ('6204391100',
                                'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                'искусственных нитей'),
                               ('6204621100',
                                'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                'хлопчатобумажной пряжи'),
                               ('6204625100',
                                'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                                'для девочек, из хлопчатобумажной пряжи'),
                               ('6204631100',
                                'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                'синтетических нитей'),
                               ('6204633100',
                                'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                                'для девочек, из синтетических нитей'),
                               ('6204691100',
                                'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                'искусственных нитей'),
                               ('6204693100',
                                'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                                'для девочек, из искусственных нитей'),
                               ('6211421000',
                                'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                                '(пригодная или не пригодная для домашнего применения) женская или для девочек, из '
                                'хлопчатобумажной пряжи'),
                               ('6211431000',
                                'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                                '(пригодная или не пригодная для домашнего применения), из химических нитей, женская '
                                'или для девочек'))),
                     'Муж.': (('6203221000',
                               '6203231000',
                               '6203291100',
                               '6203321000',
                               '6203331000',
                               '6203391100',
                               '6203421100',
                               '6203425100',
                               '6203431100',
                               '6203433100',
                               '6203491100',
                               '6203493100',
                               '6211321000',
                               '6211331000'),
                              (('6203221000',
                                'Комплекты производственные и профессиональные мужские или для мальчиков, из '
                                'хлопчатобумажной пряжи'),
                               ('6203231000',
                                'Комплекты производственные и профессиональные мужские или для мальчиков, из '
                                'синтетических нитей'),
                               ('6203291100',
                                'Комплекты производственные и профессиональные, мужские или для мальчиков, из '
                                'искусственных нитей'),
                               ('6203321000',
                                'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                                'хлопчатобумажной пряжи'),
                               ('6203331000',
                                'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                                'синтетических нитей'),
                               ('6203391100',
                                'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                                'искусственных нитей'),
                               ('6203421100',
                                'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                                'хлопчатобумажной пряжи'),
                               ('6203425100',
                                'Комбинезоны с нагрудниками и лямками производственные и профессиональные мужские или '
                                'для мальчиков, из хлопчатобумажной пряжи'),
                               ('6203431100',
                                'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                                'синтетических нитей'),
                               ('6203433100',
                                'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские или '
                                'для мальчиков, из синтетических нитей'),
                               ('6203491100',
                                'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                                'искусственных нитей'),
                               ('6203493100',
                                'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские или '
                                'для мальчиков, из искусственных нитей'),
                               ('6211321000',
                                'Производственная и профессиональная одежда мужская или для мальчиков, из '
                                'хлопчатобумажной пряжи'),
                               ('6211331000',
                                'Производственная и профессиональная одежда мужская или для мальчиков, из химических '
                                'нитей'))),
                     'Унисекс': (('6204221000',
                                  '6204231000',
                                  '6204291100',
                                  '6204321000',
                                  '6204331000',
                                  '6204391100',
                                  '6204621100',
                                  '6204625100',
                                  '6204631100',
                                  '6204633100',
                                  '6204691100',
                                  '6204693100',
                                  '6211421000',
                                  '6211431000'),
                                 (('6204221000',
                                   'Комплекты женские или для девочек, производственные и профессиональные, из '
                                   'хлопчатобумажной пряжи'),
                                  ('6204231000',
                                   'Комплекты женские или для девочек, производственные и профессиональные, из '
                                   'синтетических нитей'),
                                  ('6204291100',
                                   'Комплекты женские или для девочек, производственные и профессиональные, из '
                                   'искусственных нитей'),
                                  ('6204321000',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'хлопчатобумажной пряжи'),
                                  ('6204331000',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'синтетических нитей'),
                                  ('6204391100',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'искусственных нитей'),
                                  ('6204621100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'хлопчатобумажной пряжи'),
                                  ('6204625100',
                                   'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                   'или для девочек, из хлопчатобумажной пряжи'),
                                  ('6204631100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'синтетических нитей'),
                                  ('6204633100',
                                   'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                   'или для девочек, из синтетических нитей'),
                                  ('6204691100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'искусственных нитей'),
                                  ('6204693100',
                                   'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские '
                                   'или для девочек, из искусственных нитей'),
                                  ('6211421000',
                                   'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                   'одежда (пригодная или не пригодная для домашнего применения) женская или для '
                                   'девочек, из хлопчатобумажной пряжи'),
                                  ('6211431000',
                                   'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                   'одежда (пригодная или не пригодная для домашнего применения), из химических нитей, '
                                   'женская или для девочек')))},
 'ЗАЩИТНЫЙ ФАРТУК С НАГРУДНИКОМ': {'Без указания пола': (('6204221000',
                                                          '6204231000',
                                                          '6204291100',
                                                          '6204321000',
                                                          '6204331000',
                                                          '6204391100',
                                                          '6204625100',
                                                          '6204633100',
                                                          '6204693100',
                                                          '6211421000',
                                                          '6211431000'),
                                                         (('6204221000',
                                                           'Комплекты женские или для девочек, производственные и '
                                                           'профессиональные, из хлопчатобумажной пряжи'),
                                                          ('6204231000',
                                                           'Комплекты женские или для девочек, производственные и '
                                                           'профессиональные, из синтетических нитей'),
                                                          ('6204291100',
                                                           'Комплекты женские или для девочек, производственные и '
                                                           'профессиональные, из искусственных нитей'),
                                                          ('6204321000',
                                                           'Жакеты и блайзеры женские или для девочек, '
                                                           'производственные и профессиональные, из хлопчатобумажной '
                                                           'пряжи'),
                                                          ('6204331000',
                                                           'Жакеты и блайзеры женские или для девочек, '
                                                           'производственные и профессиональные, из синтетических '
                                                           'нитей'),
                                                          ('6204391100',
                                                           'Жакеты и блайзеры женские или для девочек, '
                                                           'производственные и профессиональные, из искусственных '
                                                           'нитей'),
                                                          ('6204625100',
                                                           'Комбинезоны с нагрудниками и лямками производственные и '
                                                           'профессиональные, женские или для девочек, из '
                                                           'хлопчатобумажной пряжи'),
                                                          ('6204633100',
                                                           'Комбинезоны с нагрудниками и лямками производственные и '
                                                           'профессиональные, женские или для девочек, из '
                                                           'синтетических нитей'),
                                                          ('6204693100',
                                                           'Комбинезоны с нагрудниками и лямками производственные и '
                                                           'профессиональные, женские или для девочек, из '
                                                           'искусственных нитей'),
                                                          ('6211421000',
                                                           'Фартуки, комбинезоны, спецодежда и другая производственная '
                                                           'и профессиональная одежда (пригодная или не пригодная для '
                                                           'домашнего применения) женская или для девочек, из '
                                                           'хлопчатобумажной пряжи'),
                                                          ('6211431000',
                                                           'Фартуки, комбинезоны, спецодежда и другая производственная '
                                                           'и профессиональная одежда (пригодная или не пригодная для '
                                                           'домашнего применения), из химических нитей, женская или '
                                                           'для девочек'))),
                                   'Жен.': (('6204221000',
                                             '6204231000',
                                             '6204291100',
                                             '6204321000',
                                             '6204331000',
                                             '6204391100',
                                             '6204625100',
                                             '6204633100',
                                             '6204693100',
                                             '6211421000',
                                             '6211431000'),
                                            (('6204221000',
                                              'Комплекты женские или для девочек, производственные и профессиональные, '
                                              'из хлопчатобумажной пряжи'),
                                             ('6204231000',
                                              'Комплекты женские или для девочек, производственные и профессиональные, '
                                              'из синтетических нитей'),
                                             ('6204291100',
                                              'Комплекты женские или для девочек, производственные и профессиональные, '
                                              'из искусственных нитей'),
                                             ('6204321000',
                                              'Жакеты и блайзеры женские или для девочек, производственные и '
                                              'профессиональные, из хлопчатобумажной пряжи'),
                                             ('6204331000',
                                              'Жакеты и блайзеры женские или для девочек, производственные и '
                                              'профессиональные, из синтетических нитей'),
                                             ('6204391100',
                                              'Жакеты и блайзеры женские или для девочек, производственные и '
                                              'профессиональные, из искусственных нитей'),
                                             ('6204625100',
                                              'Комбинезоны с нагрудниками и лямками производственные и '
                                              'профессиональные, женские или для девочек, из хлопчатобумажной пряжи'),
                                             ('6204633100',
                                              'Комбинезоны с нагрудниками и лямками производственные и '
                                              'профессиональные, женские или для девочек, из синтетических нитей'),
                                             ('6204693100',
                                              'Комбинезоны с нагрудниками и лямками производственные и '
                                              'профессиональные, женские или для девочек, из искусственных нитей'),
                                             ('6211421000',
                                              'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                              'профессиональная одежда (пригодная или не пригодная для домашнего '
                                              'применения) женская или для девочек, из хлопчатобумажной пряжи'),
                                             ('6211431000',
                                              'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                              'профессиональная одежда (пригодная или не пригодная для домашнего '
                                              'применения), из химических нитей, женская или для девочек'))),
                                   'Муж.': (('6203221000',
                                             '6203231000',
                                             '6203291100',
                                             '6203321000',
                                             '6203331000',
                                             '6203391100',
                                             '6203425100',
                                             '6203433100',
                                             '6203493100',
                                             '6211321000',
                                             '6211331000'),
                                            (('6203221000',
                                              'Комплекты производственные и профессиональные мужские или для '
                                              'мальчиков, из хлопчатобумажной пряжи'),
                                             ('6203231000',
                                              'Комплекты производственные и профессиональные мужские или для '
                                              'мальчиков, из синтетических нитей'),
                                             ('6203291100',
                                              'Комплекты производственные и профессиональные, мужские или для '
                                              'мальчиков, из искусственных нитей'),
                                             ('6203321000',
                                              'Пиджаки и блайзеры производственные и профессиональные, мужские или для '
                                              'мальчиков, из хлопчатобумажной пряжи'),
                                             ('6203331000',
                                              'Пиджаки и блайзеры производственные и профессиональные, мужские или для '
                                              'мальчиков, из синтетических нитей'),
                                             ('6203391100',
                                              'Пиджаки и блайзеры производственные и профессиональные, мужские или для '
                                              'мальчиков, из искусственных нитей'),
                                             ('6203425100',
                                              'Комбинезоны с нагрудниками и лямками производственные и '
                                              'профессиональные мужские или для мальчиков, из хлопчатобумажной пряжи'),
                                             ('6203433100',
                                              'Комбинезоны с нагрудниками и лямками производственные и '
                                              'профессиональные, мужские или для мальчиков, из синтетических нитей'),
                                             ('6203493100',
                                              'Комбинезоны с нагрудниками и лямками производственные и '
                                              'профессиональные, мужские или для мальчиков, из искусственных нитей'),
                                             ('6211321000',
                                              'Производственная и профессиональная одежда мужская или для мальчиков, '
                                              'из хлопчатобумажной пряжи'),
                                             ('6211331000',
                                              'Производственная и профессиональная одежда мужская или для мальчиков, '
                                              'из химических нитей'))),
                                   'Унисекс': (('6204221000',
                                                '6204231000',
                                                '6204291100',
                                                '6204321000',
                                                '6204331000',
                                                '6204391100',
                                                '6204625100',
                                                '6204633100',
                                                '6204693100',
                                                '6211421000',
                                                '6211431000'),
                                               (('6204221000',
                                                 'Комплекты женские или для девочек, производственные и '
                                                 'профессиональные, из хлопчатобумажной пряжи'),
                                                ('6204231000',
                                                 'Комплекты женские или для девочек, производственные и '
                                                 'профессиональные, из синтетических нитей'),
                                                ('6204291100',
                                                 'Комплекты женские или для девочек, производственные и '
                                                 'профессиональные, из искусственных нитей'),
                                                ('6204321000',
                                                 'Жакеты и блайзеры женские или для девочек, производственные и '
                                                 'профессиональные, из хлопчатобумажной пряжи'),
                                                ('6204331000',
                                                 'Жакеты и блайзеры женские или для девочек, производственные и '
                                                 'профессиональные, из синтетических нитей'),
                                                ('6204391100',
                                                 'Жакеты и блайзеры женские или для девочек, производственные и '
                                                 'профессиональные, из искусственных нитей'),
                                                ('6204625100',
                                                 'Комбинезоны с нагрудниками и лямками производственные и '
                                                 'профессиональные, женские или для девочек, из хлопчатобумажной '
                                                 'пряжи'),
                                                ('6204633100',
                                                 'Комбинезоны с нагрудниками и лямками производственные и '
                                                 'профессиональные, женские или для девочек, из синтетических нитей'),
                                                ('6204693100',
                                                 'Комбинезоны с нагрудниками и лямками производственные и '
                                                 'профессиональные, женские или для девочек, из искусственных нитей'),
                                                ('6211421000',
                                                 'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                                 'профессиональная одежда (пригодная или не пригодная для домашнего '
                                                 'применения) женская или для девочек, из хлопчатобумажной пряжи'),
                                                ('6211431000',
                                                 'Фартуки, комбинезоны, спецодежда и другая производственная и '
                                                 'профессиональная одежда (пригодная или не пригодная для домашнего '
                                                 'применения), из химических нитей, женская или для девочек')))},
 'КАПРИ': {'Без указания пола': (('6104610001',
                                  '6104620000',
                                  '6104630000',
                                  '6104690001',
                                  '6104690009',
                                  '6204611000',
                                  '6204618500',
                                  '6204621100',
                                  '6204623100',
                                  '6204623300',
                                  '6204623900',
                                  '6204629000',
                                  '6204631100',
                                  '6204631800',
                                  '6204639000',
                                  '6204691100',
                                  '6204691800',
                                  '6204695000',
                                  '6204699000'),
                                 (('6104610001',
                                   'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                   'волоса животных'),
                                  ('6104620000',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                   'трикотажные женские или для девочек, из хлопка'),
                                  ('6104630000',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                   'трикотажные женские или для девочек, из синтетических нитей'),
                                  ('6104690001',
                                   'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                                  ('6104690009',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                                   'материалов'),
                                  ('6204611000',
                                   'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                   'волоса животных'),
                                  ('6204618500',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                  ('6204621100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'хлопчатобумажной пряжи'),
                                  ('6204623100',
                                   'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                                  ('6204623300',
                                   'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным '
                                   'ворсом'),
                                  ('6204623900',
                                   'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                                  ('6204629000',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из хлопчатобумажной пряжи'),
                                  ('6204631100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'синтетических нитей'),
                                  ('6204631800',
                                   'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                                  ('6204639000',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из синтетических нитей'),
                                  ('6204691100',
                                   'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                   'искусственных нитей'),
                                  ('6204691800',
                                   'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                                  ('6204695000',
                                   'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек, из искусственных нитей'),
                                  ('6204699000',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                   'девочек,из прочих текстильных материалов'))),
           'Жен.': (('6104610001',
                     '6104620000',
                     '6104630000',
                     '6104690001',
                     '6104690009',
                     '6204611000',
                     '6204618500',
                     '6204621100',
                     '6204623100',
                     '6204623300',
                     '6204623900',
                     '6204629000',
                     '6204631100',
                     '6204631800',
                     '6204639000',
                     '6204691100',
                     '6204691800',
                     '6204695000',
                     '6204699000'),
                    (('6104610001',
                      'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6104620000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                      'женские или для девочек, из хлопка'),
                     ('6104630000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                      'женские или для девочек, из синтетических нитей'),
                     ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                     ('6104690009',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов'),
                     ('6204611000',
                      'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6204618500',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6204621100',
                      'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                      'хлопчатобумажной пряжи'),
                     ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                     ('6204623300',
                      'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                     ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                     ('6204629000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'хлопчатобумажной пряжи'),
                     ('6204631100',
                      'Брюки и бриджи производственные и профессиональные, женские или для девочек, из синтетических '
                      'нитей'),
                     ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                     ('6204639000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'синтетических нитей'),
                     ('6204691100',
                      'Брюки и бриджи производственные и профессиональные, женские или для девочек, из искусственных '
                      'нитей'),
                     ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                     ('6204695000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                      'искусственных нитей'),
                     ('6204699000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из прочих '
                      'текстильных материалов'))),
           'Муж.': (('6103410000',
                     '6103420001',
                     '6103430001',
                     '6103490001',
                     '6103490009',
                     '6203411000',
                     '6203419000',
                     '6203421100',
                     '6203423100',
                     '6203423300',
                     '6203423500',
                     '6203429000',
                     '6203431100',
                     '6203431900',
                     '6203439000',
                     '6203491100',
                     '6203491900',
                     '6203495000',
                     '6203499000'),
                    (('6103410000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных) трикотажные, '
                      'мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6103420001', 'Брюки и бриджи, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6103430001', 'Брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                     ('6103490001', 'Брюки и бриджи мужские или для мальчиков, из прочих текстильных материалов'),
                     ('6103490009',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов, '
                      'мужские или для мальчиков'),
                     ('6203411000',
                      'Брюки и бриджи мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6203419000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6203421100',
                      'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                      'хлопчатобумажной пряжи'),
                     ('6203423100', 'Брюки и бриджи мужские или для мальчиков, из денима, или джинсовой ткани'),
                     ('6203423300', 'Брюки и бриджи мужские или для мальчиков, из вельвет-корда с разрезным ворсом'),
                     ('6203423500', 'Прочие брюки и бриджи мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6203429000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из хлопчатобумажной пряжи'),
                     ('6203431100',
                      'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из синтетических '
                      'нитей'),
                     ('6203431900', 'Прочие брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                     ('6203439000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из синтетических нитей'),
                     ('6203491100',
                      'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из искусственных '
                      'нитей'),
                     ('6203491900', 'Прочие брюки и бриджи мужские или для мальчиков, из искусственных нитей'),
                     ('6203495000',
                      'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                      'из искусственных нитей'),
                     ('6203499000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, мужские или для мальчиков, из '
                      'прочих текстильных материалов'))),
           'Унисекс': (('6104610001',
                        '6104620000',
                        '6104630000',
                        '6104690001',
                        '6104690009',
                        '6204611000',
                        '6204618500',
                        '6204621100',
                        '6204623100',
                        '6204623300',
                        '6204623900',
                        '6204629000',
                        '6204631100',
                        '6204631800',
                        '6204639000',
                        '6204691100',
                        '6204691800',
                        '6204695000',
                        '6204699000'),
                       (('6104610001',
                         'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6104620000',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                         'женские или для девочек, из хлопка'),
                        ('6104630000',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                         'женские или для девочек, из синтетических нитей'),
                        ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                        ('6104690009',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                         'материалов'),
                        ('6204611000',
                         'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6204618500',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                        ('6204621100',
                         'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                         'хлопчатобумажной пряжи'),
                        ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                        ('6204623300',
                         'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                        ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                        ('6204629000',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из хлопчатобумажной пряжи'),
                        ('6204631100',
                         'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                         'синтетических нитей'),
                        ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                        ('6204639000',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из синтетических нитей'),
                        ('6204691100',
                         'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                         'искусственных нитей'),
                        ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                        ('6204695000',
                         'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                         'из искусственных нитей'),
                        ('6204699000',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                         'прочих текстильных материалов')))},
 'КАРДИГАН': {'Без указания пола': (('6104310000',
                                     '6104320000',
                                     '6104330000',
                                     '6104390000',
                                     '6110119000',
                                     '6110129009',
                                     '6110199009',
                                     '6110209900',
                                     '6110309900',
                                     '6110901000',
                                     '6110909000',
                                     '6204310000',
                                     '6204321000',
                                     '6204329000',
                                     '6204331000',
                                     '6204339000',
                                     '6204391100',
                                     '6204391900',
                                     '6204399000'),
                                    (('6104310000',
                                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или '
                                      'пряжи из тонкого волоса животных, машинного или ручного вязания'),
                                     ('6104320000',
                                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной '
                                      'пряжи, машинного или ручного вязания'),
                                     ('6104330000',
                                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических '
                                      'нитей, машинного или ручного вязания'),
                                     ('6104390000',
                                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                                      'материалов, машинного или ручного вязания'),
                                     ('6110119000',
                                      'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или '
                                      'девочек, из шерстяной пряжи, машинного или ручного вязания'),
                                     ('6110129009',
                                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                      'вязания, из пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                                     ('6110199009',
                                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                      'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных, для женщин '
                                      'или девочек'),
                                     ('6110209900',
                                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                      'из хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного '
                                      'вязания'),
                                     ('6110309900',
                                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                      'из химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                     ('6110901000',
                                      'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                      'льняных волокон или волокна рами, машинного или ручного вязания'),
                                     ('6110909000',
                                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                      'из прочих текстильных материалов, машинного или ручного вязания'),
                                     ('6204310000',
                                      'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из '
                                      'тонкого волоса животных'),
                                     ('6204321000',
                                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                      'из хлопчатобумажной пряжи'),
                                     ('6204329000',
                                      'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                                     ('6204331000',
                                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                      'из синтетических нитей'),
                                     ('6204339000',
                                      'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                     ('6204391100',
                                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                      'из искусственных нитей'),
                                     ('6204391900',
                                      'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                                     ('6204399000',
                                      'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                      'материалов <6110909000> Прочие свитеры, пуловеры, джемперы, жилеты и '
                                      'аналогичные изделия трикотажные, из прочих текстильных материалов, машинного '
                                      'или ручного вязания'))),
              'Жен.': (('6104310000',
                        '6104320000',
                        '6104330000',
                        '6104390000',
                        '6110119000',
                        '6110129009',
                        '6110199009',
                        '6110209900',
                        '6110309900',
                        '6110901000',
                        '6110909000',
                        '6204310000',
                        '6204321000',
                        '6204329000',
                        '6204331000',
                        '6204339000',
                        '6204391100',
                        '6204391900',
                        '6204399000'),
                       (('6104310000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                         'тонкого волоса животных, машинного или ручного вязания'),
                        ('6104320000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                         'машинного или ручного вязания'),
                        ('6104330000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                         'или ручного вязания'),
                        ('6104390000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                         'машинного или ручного вязания'),
                        ('6110119000',
                         'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                         'шерстяной пряжи, машинного или ручного вязания'),
                        ('6110129009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи '
                         'из тонкого волоса кашмирской козы, для женщин или девочек'),
                        ('6110199009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                        ('6110209900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                         'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                        ('6110309900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                         'нитей, для женщин или девочек, машинного или ручного вязания'),
                        ('6110901000',
                         'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                         'или волокна рами, машинного или ручного вязания'),
                        ('6110909000',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                         'текстильных материалов, машинного или ручного вязания'),
                        ('6204310000',
                         'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6204321000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'хлопчатобумажной пряжи'),
                        ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                        ('6204331000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'синтетических нитей'),
                        ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                        ('6204391100',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'искусственных нитей'),
                        ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                        ('6204399000',
                         'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов '
                         '<6110909000> Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                         'из прочих текстильных материалов, машинного или ручного вязания'))),
              'Муж.': (('6103310000',
                        '6103320000',
                        '6103330000',
                        '6103390000',
                        '6110113000',
                        '6110121009',
                        '6110191009',
                        '6110209100',
                        '6110309100',
                        '6110901000',
                        '6110909000',
                        '6203310000',
                        '6203321000',
                        '6203329000',
                        '6203331000',
                        '6203339000',
                        '6203391100',
                        '6203391900',
                        '6203399000'),
                       (('6103310000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из '
                         'тонкого волоса животных, машинного или ручного вязания'),
                        ('6103320000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                        ('6103330000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из синтетических нитей'),
                        ('6103390000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из прочих текстильных материалов'),
                        ('6110113000',
                         'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для мужчин или мальчиков, из '
                         'шерстяной пряжи, машинного или ручного вязания'),
                        ('6110121009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи '
                         'из тонкого волоса кашмирской козы, для мужчин или мальчиков'),
                        ('6110191009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных, для мужчин или мальчиков'),
                        ('6110209100',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                         'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                        ('6110309100',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                         'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                        ('6110901000',
                         'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                         'или волокна рами, машинного или ручного вязания'),
                        ('6110909000',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                         'текстильных материалов, машинного или ручного вязания'),
                        ('6203310000',
                         'Пиджаки и блайзеры мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6203321000',
                         'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                         'хлопчатобумажной пряжи'),
                        ('6203329000',
                         'Прочие пиджаки и блайзеры мужские или для мальчиков, из хлопчатобумажной пряжи'),
                        ('6203331000',
                         'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                         'синтетических нитей'),
                        ('6203339000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из синтетических нитей'),
                        ('6203391100',
                         'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                         'искусственных нитей'),
                        ('6203391900', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из искусственных нитей'),
                        ('6203399000',
                         'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов <6110909000> '
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                         'текстильных материалов, машинного или ручного вязания'))),
              'Унисекс': (('6104310000',
                           '6104320000',
                           '6104330000',
                           '6104390000',
                           '6110119000',
                           '6110129009',
                           '6110199009',
                           '6110209900',
                           '6110309900',
                           '6110901000',
                           '6110909000',
                           '6204310000',
                           '6204321000',
                           '6204329000',
                           '6204331000',
                           '6204339000',
                           '6204391100',
                           '6204391900',
                           '6204399000'),
                          (('6104310000',
                            'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                            'тонкого волоса животных, машинного или ручного вязания'),
                           ('6104320000',
                            'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                            'машинного или ручного вязания'),
                           ('6104330000',
                            'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, '
                            'машинного или ручного вязания'),
                           ('6104390000',
                            'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                            'материалов, машинного или ручного вязания'),
                           ('6110119000',
                            'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                            'шерстяной пряжи, машинного или ручного вязания'),
                           ('6110129009',
                            'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                            'пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                           ('6110199009',
                            'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                            'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                           ('6110209900',
                            'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                            'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                           ('6110309900',
                            'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                            'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                           ('6110901000',
                            'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                            'или волокна рами, машинного или ручного вязания'),
                           ('6110909000',
                            'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                            'текстильных материалов, машинного или ручного вязания'),
                           ('6204310000',
                            'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                            'животных'),
                           ('6204321000',
                            'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                            'хлопчатобумажной пряжи'),
                           ('6204329000',
                            'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                           ('6204331000',
                            'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                            'синтетических нитей'),
                           ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                           ('6204391100',
                            'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                            'искусственных нитей'),
                           ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                           ('6204399000',
                            'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов '
                            '<6110909000> Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия '
                            'трикотажные, из прочих текстильных материалов, машинного или ручного вязания')))},
 'КЕЙП': {'Без указания пола': (('6102101000',
                                 '6102201000',
                                 '6102301000',
                                 '6102901000',
                                 '6110119000',
                                 '6110129009',
                                 '6110199009',
                                 '6110209900',
                                 '6110309900',
                                 '6110901000',
                                 '6110909000',
                                 '6202200000',
                                 '6202300000',
                                 '6202400001',
                                 '6202400009',
                                 '6202900001',
                                 '6202900009'),
                                (('6102101000',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                                  'шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме изделий '
                                  'товарной позиции 6104'),
                                 ('6102201000',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                                  'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                                 ('6102301000',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                                  'химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                                 ('6102901000',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                                  'прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                                 ('6110119000',
                                  'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, '
                                  'из шерстяной пряжи, машинного или ручного вязания'),
                                 ('6110129009',
                                  'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, '
                                  'из пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                                 ('6110199009',
                                  'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, '
                                  'из шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                                 ('6110209900',
                                  'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                  'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                 ('6110309900',
                                  'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                  'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                 ('6110901000',
                                  'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                                  'волокон или волокна рами, машинного или ручного вязания'),
                                 ('6110909000',
                                  'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                  'прочих текстильных материалов, машинного или ручного вязания'),
                                 ('6202200000',
                                  'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                  'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                  'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                 ('6202300000',
                                  'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                  'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                  'из хлопчатобумажной пряжи'),
                                 ('6202400001',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                  'кроме изделий товарной позиции 6204, из химических нитей, массой одного изделия '
                                  'более 1 кг'),
                                 ('6202400009',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                  'кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                 ('6202900001',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                  'кроме изделий товарной позиции 6204, из прочих текстильных материалов'),
                                 ('6202900009',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                  'кроме изделий товарной позиции 6204, из прочих текстильных материалов, прочие'))),
          'Жен.': (('6102101000',
                    '6102201000',
                    '6102301000',
                    '6102901000',
                    '6110119000',
                    '6110129009',
                    '6110199009',
                    '6110209900',
                    '6110309900',
                    '6110901000',
                    '6110909000',
                    '6202200000',
                    '6202300000',
                    '6202400001',
                    '6202400009',
                    '6202900001',
                    '6202900009'),
                   (('6102101000',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из шерстяной '
                     'пряжи или пряжи из тонкого волоса животных, трикотажные, кроме изделий товарной позиции 6104'),
                    ('6102201000',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                     'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                    ('6102301000',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из химических '
                     'нитей, трикотажные, кроме изделий товарной позиции 6104'),
                    ('6102901000',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из прочих '
                     'текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                    ('6110119000',
                     'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из шерстяной '
                     'пряжи, машинного или ручного вязания'),
                    ('6110129009',
                     'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                     'тонкого волоса кашмирской козы, для женщин или девочек'),
                    ('6110199009',
                     'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из шерстяной '
                     'пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                    ('6110209900',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                     'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                    ('6110309900',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                     'нитей, для женщин или девочек, машинного или ручного вязания'),
                    ('6110901000',
                     'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                     'волокна рами, машинного или ручного вязания'),
                    ('6110909000',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                     'текстильных материалов, машинного или ручного вязания'),
                    ('6202200000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                     'пряжи из тонкого волоса животных'),
                    ('6202300000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной пряжи'),
                    ('6202400001',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                     'товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                    ('6202400009',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                     'товарной позиции 6204, из химических нитей, прочие'),
                    ('6202900001',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                     'товарной позиции 6204, из прочих текстильных материалов'),
                    ('6202900009',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                     'товарной позиции 6204, из прочих текстильных материалов, прочие'))),
          'Муж.': (('6101201000',
                    '6101301000',
                    '6110113000',
                    '6110121009',
                    '6110191009',
                    '6110209100',
                    '6110309100',
                    '6110901000',
                    '6110909000',
                    '6201200000',
                    '6201300000',
                    '6201400000',
                    '6201900000'),
                   (('6101201000',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия из хлопчатобумажной пряжи трикотажные, '
                     'мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                    ('6101301000',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия мужские или для мальчиков из химических '
                     'нитей, трикотажные, кроме изделий товарной позиции 6103'),
                    ('6110113000',
                     'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для мужчин или мальчиков, из '
                     'шерстяной пряжи, машинного или ручного вязания'),
                    ('6110121009',
                     'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                     'тонкого волоса кашмирской козы, для мужчин или мальчиков'),
                    ('6110191009',
                     'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из шерстяной '
                     'пряжи или пряжи из тонкого волоса животных, для мужчин или мальчиков'),
                    ('6110209100',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                     'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                    ('6110309100',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                     'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                    ('6110901000',
                     'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                     'волокна рами, машинного или ручного вязания'),
                    ('6110909000',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                     'текстильных материалов, машинного или ручного вязания'),
                    ('6201200000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                     'пряжи из тонкого волоса животных'),
                    ('6201300000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                     'пряжи'),
                    ('6201400000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                    ('6201900000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                     'материалов'))),
          'Унисекс': (('6102101000',
                       '6102201000',
                       '6102301000',
                       '6102901000',
                       '6110119000',
                       '6110129009',
                       '6110199009',
                       '6110209900',
                       '6110309900',
                       '6110901000',
                       '6110909000',
                       '6202200000',
                       '6202300000',
                       '6202400001',
                       '6202400009',
                       '6202900001',
                       '6202900009'),
                      (('6102101000',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из шерстяной '
                        'пряжи или пряжи из тонкого волоса животных, трикотажные, кроме изделий товарной позиции 6104'),
                       ('6102201000',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                        'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                       ('6102301000',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                        'химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                       ('6102901000',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из прочих '
                        'текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                       ('6110119000',
                        'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                        'шерстяной пряжи, машинного или ручного вязания'),
                       ('6110129009',
                        'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи '
                        'из тонкого волоса кашмирской козы, для женщин или девочек'),
                       ('6110199009',
                        'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                        'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                       ('6110209900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                       ('6110309900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для женщин или девочек, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания'),
                       ('6202200000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6202300000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'хлопчатобумажной пряжи'),
                       ('6202400001',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                       ('6202400009',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из химических нитей, прочие'),
                       ('6202900001',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из прочих текстильных материалов'),
                       ('6202900009',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из прочих текстильных материалов, прочие')))},
 'КИТЕЛЬ': {'Без указания пола': (('6102101000',
                                   '6102201000',
                                   '6102301000',
                                   '6102901000',
                                   '6110119000',
                                   '6110129009',
                                   '6110199009',
                                   '6110209900',
                                   '6110309900',
                                   '6110901000',
                                   '6110909000',
                                   '6202200000',
                                   '6202300000',
                                   '6202400001',
                                   '6202400009',
                                   '6202900001',
                                   '6202900009'),
                                  (('6102101000',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек '
                                    'из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме '
                                    'изделий товарной позиции 6104'),
                                   ('6102201000',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек '
                                    'из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                                   ('6102301000',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек '
                                    'из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                                   ('6102901000',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек '
                                    'из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции '
                                    '6104'),
                                   ('6110119000',
                                    'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или '
                                    'девочек, из шерстяной пряжи, машинного или ручного вязания'),
                                   ('6110129009',
                                    'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                    'вязания, из пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                                   ('6110199009',
                                    'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                    'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или '
                                    'девочек'),
                                   ('6110209900',
                                    'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                    'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                   ('6110309900',
                                    'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                    'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                   ('6110901000',
                                    'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                                    'волокон или волокна рами, машинного или ручного вязания'),
                                   ('6110909000',
                                    'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                    'прочих текстильных материалов, машинного или ручного вязания'),
                                   ('6202200000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'),
                                   ('6202400001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из химических нитей, массой одного изделия '
                                    'более 1 кг'),
                                   ('6202400009',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                   ('6202900001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов'),
                                   ('6202900009',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов, прочие'))),
            'Жен.': (('6102101000',
                      '6102201000',
                      '6102301000',
                      '6102901000',
                      '6110119000',
                      '6110129009',
                      '6110199009',
                      '6110209900',
                      '6110309900',
                      '6110901000',
                      '6110909000',
                      '6202200000',
                      '6202300000',
                      '6202400001',
                      '6202400009',
                      '6202900001',
                      '6202900009'),
                     (('6102101000',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из шерстяной '
                       'пряжи или пряжи из тонкого волоса животных, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102201000',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                       'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102301000',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из химических '
                       'нитей, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102901000',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из прочих '
                       'текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6110119000',
                       'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                       'шерстяной пряжи, машинного или ручного вязания'),
                      ('6110129009',
                       'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                       'тонкого волоса кашмирской козы, для женщин или девочек'),
                      ('6110199009',
                       'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                      ('6110209900',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                       'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                      ('6110309900',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                       'нитей, для женщин или девочек, машинного или ручного вязания'),
                      ('6110901000',
                       'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                       'волокна рами, машинного или ручного вязания'),
                      ('6110909000',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                       'текстильных материалов, машинного или ручного вязания'),
                      ('6202200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'),
                      ('6202400001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                      ('6202400009',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из химических нитей, прочие'),
                      ('6202900001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов'),
                      ('6202900009',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов, прочие'))),
            'Муж.': (('6101201000',
                      '6101301000',
                      '6110113000',
                      '6110121009',
                      '6110191009',
                      '6110209100',
                      '6110309100',
                      '6110901000',
                      '6110909000',
                      '6201200000',
                      '6201300000',
                      '6201400000',
                      '6201900000'),
                     (('6101201000',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия из хлопчатобумажной пряжи '
                       'трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                      ('6101301000',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия мужские или для мальчиков из '
                       'химических нитей, трикотажные, кроме изделий товарной позиции 6103'),
                      ('6110113000',
                       'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для мужчин или мальчиков, из '
                       'шерстяной пряжи, машинного или ручного вязания'),
                      ('6110121009',
                       'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                       'тонкого волоса кашмирской козы, для мужчин или мальчиков'),
                      ('6110191009',
                       'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных, для мужчин или мальчиков'),
                      ('6110209100',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                       'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                      ('6110309100',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                       'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                      ('6110901000',
                       'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                       'волокна рами, машинного или ручного вязания'),
                      ('6110909000',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                       'текстильных материалов, машинного или ручного вязания'),
                      ('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                       'пряжи'),
                      ('6201400000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'))),
            'Унисекс': (('6102101000',
                         '6102201000',
                         '6102301000',
                         '6102901000',
                         '6110119000',
                         '6110129009',
                         '6110199009',
                         '6110209900',
                         '6110309900',
                         '6110901000',
                         '6110909000',
                         '6202200000',
                         '6202300000',
                         '6202400001',
                         '6202400009',
                         '6202900001',
                         '6202900009'),
                        (('6102101000',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме изделий товарной '
                          'позиции 6104'),
                         ('6102201000',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                          'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102301000',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из '
                          'химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102901000',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек из прочих '
                          'текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6110119000',
                          'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                          'шерстяной пряжи, машинного или ручного вязания'),
                         ('6110129009',
                          'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи '
                          'из тонкого волоса кашмирской козы, для женщин или девочек'),
                         ('6110199009',
                          'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                         ('6110209900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                          'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                         ('6110309900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                          'нитей, для женщин или девочек, машинного или ручного вязания'),
                         ('6110901000',
                          'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                          'или волокна рами, машинного или ручного вязания'),
                         ('6110909000',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                          'текстильных материалов, машинного или ручного вязания'),
                         ('6202200000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6202400001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из химических нитей, массой одного изделия более 1 кг'),
                         ('6202400009',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из химических нитей, прочие'),
                         ('6202900001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов'),
                         ('6202900009',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов, прочие')))},
 'КОМБИНЕЗОН': {'Без указания пола': (('6104610009',
                                       '6104620000',
                                       '6104630000',
                                       '6104690002',
                                       '6104690009',
                                       '6204618500',
                                       '6204625100',
                                       '6204625900',
                                       '6204629000',
                                       '6204633100',
                                       '6204633900',
                                       '6204639000',
                                       '6204693100',
                                       '6204693900',
                                       '6204695000',
                                       '6204699000',
                                       '6211421000',
                                       '6211431000'),
                                      (('6104610009',
                                        'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи), женские '
                                        'или для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                       ('6104620000',
                                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме '
                                        'купальных), трикотажные женские или для девочек, из хлопка'),
                                       ('6104630000',
                                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме '
                                        'купальных), трикотажные женские или для девочек, из синтетических нитей'),
                                       ('6104690002',
                                        'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи), женские '
                                        'или для девочек, из искусственных нитей'),
                                       ('6104690009',
                                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих '
                                        'текстильных материалов'),
                                       ('6204618500',
                                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские '
                                        'или для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                       ('6204625100',
                                        'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                        'женские или для девочек, из хлопчатобумажной пряжи'),
                                       ('6204625900',
                                        'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из '
                                        'хлопчатобумажной пряжи'),
                                       ('6204629000',
                                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские '
                                        'или для девочек, из хлопчатобумажной пряжи'),
                                       ('6204633100',
                                        'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                        'женские или для девочек, из синтетических нитей'),
                                       ('6204633900',
                                        'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из '
                                        'синтетических нитей'),
                                       ('6204639000',
                                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские '
                                        'или для девочек, из синтетических нитей'),
                                       ('6204693100',
                                        'Комбинезоны с нагрудниками и лямками производственные и профессиональные, '
                                        'женские или для девочек, из искусственных нитей'),
                                       ('6204693900',
                                        'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из '
                                        'искусственных нитей'),
                                       ('6204695000',
                                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские '
                                        'или для девочек, из искусственных нитей'),
                                       ('6204699000',
                                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                        'девочек,из прочих текстильных материалов'),
                                       ('6211421000',
                                        'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                        'одежда (пригодная или не пригодная для домашнего применения) женская или для '
                                        'девочек, из хлопчатобумажной пряжи'),
                                       ('6211431000',
                                        'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная '
                                        'одежда (пригодная или не пригодная для домашнего применения), из химических '
                                        'нитей, женская или для девочек'))),
                'Жен.': (('6104610009',
                          '6104620000',
                          '6104630000',
                          '6104690002',
                          '6104690009',
                          '6204618500',
                          '6204625100',
                          '6204625900',
                          '6204629000',
                          '6204633100',
                          '6204633900',
                          '6204639000',
                          '6204693100',
                          '6204693900',
                          '6204695000',
                          '6204699000',
                          '6211421000',
                          '6211431000'),
                         (('6104610009',
                           'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи), женские или для '
                           'девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6104620000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                           'женские или для девочек, из хлопка'),
                          ('6104630000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                           'женские или для девочек, из синтетических нитей'),
                          ('6104690002',
                           'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи), женские или для '
                           'девочек, из искусственных нитей'),
                          ('6104690009',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                           'материалов'),
                          ('6204618500',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6204625100',
                           'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или для '
                           'девочек, из хлопчатобумажной пряжи'),
                          ('6204625900',
                           'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из хлопчатобумажной '
                           'пряжи'),
                          ('6204629000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из хлопчатобумажной пряжи'),
                          ('6204633100',
                           'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или для '
                           'девочек, из синтетических нитей'),
                          ('6204633900',
                           'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из синтетических '
                           'нитей'),
                          ('6204639000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из синтетических нитей'),
                          ('6204693100',
                           'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или для '
                           'девочек, из искусственных нитей'),
                          ('6204693900',
                           'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из искусственных '
                           'нитей'),
                          ('6204695000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из искусственных нитей'),
                          ('6204699000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                           'прочих текстильных материалов'),
                          ('6211421000',
                           'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                           '(пригодная или не пригодная для домашнего применения) женская или для девочек, из '
                           'хлопчатобумажной пряжи'),
                          ('6211431000',
                           'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                           '(пригодная или не пригодная для домашнего применения), из химических нитей, женская или '
                           'для девочек'))),
                'Муж.': (('6103410000',
                          '6103420009',
                          '6103430009',
                          '6103490002',
                          '6103490009',
                          '6203413000',
                          '6203419000',
                          '6203425100',
                          '6203425900',
                          '6203429000',
                          '6203433100',
                          '6203433900',
                          '6203439000',
                          '6203493100',
                          '6203493900',
                          '6203495000',
                          '6203499000'),
                         (('6103410000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных) трикотажные, '
                           'мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6103420009',
                           'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи) мужские или для '
                           'мальчиков, из хлопчатобумажной пряжи'),
                          ('6103430009',
                           'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи) мужские или для '
                           'мальчиков, из синтетических нитей'),
                          ('6103490002',
                           'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи) мужские или для '
                           'мальчиков, из искусственных нитей'),
                          ('6103490009',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                           'материалов, мужские или для мальчиков'),
                          ('6203413000',
                           'Комбинезоны с нагрудниками и лямками мужские или для мальчиков, из шерстяной пряжи или '
                           'пряжи из тонкого волоса животных'),
                          ('6203419000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для '
                           'мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6203425100',
                           'Комбинезоны с нагрудниками и лямками производственные и профессиональные мужские или для '
                           'мальчиков, из хлопчатобумажной пряжи'),
                          ('6203425900',
                           'Прочие комбинезоны с нагрудниками и лямками мужские или для мальчиков, из хлопчатобумажной '
                           'пряжи'),
                          ('6203429000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для '
                           'мальчиков, из хлопчатобумажной пряжи'),
                          ('6203433100',
                           'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские или для '
                           'мальчиков, из синтетических нитей'),
                          ('6203433900',
                           'Прочие комбинезоны с нагрудниками и лямками мужские или для мальчиков, из синтетических '
                           'нитей'),
                          ('6203439000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для '
                           'мальчиков, из синтетических нитей'),
                          ('6203493100',
                           'Комбинезоны с нагрудниками и лямками производственные и профессиональные, мужские или для '
                           'мальчиков, из искусственных нитей'),
                          ('6203493900',
                           'Прочие комбинезоны с нагрудниками и лямками мужские или для мальчиков, из искусственных '
                           'нитей'),
                          ('6203495000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для '
                           'мальчиков, из искусственных нитей'),
                          ('6203499000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, мужские или для мальчиков, из '
                           'прочих текстильных материалов'))),
                'Унисекс': (('6104610009',
                             '6104620000',
                             '6104630000',
                             '6104690002',
                             '6104690009',
                             '6204618500',
                             '6204625100',
                             '6204625900',
                             '6204629000',
                             '6204633100',
                             '6204633900',
                             '6204639000',
                             '6204693100',
                             '6204693900',
                             '6204695000',
                             '6204699000',
                             '6211421000',
                             '6211431000'),
                            (('6104610009',
                              'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи), женские или для '
                              'девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                             ('6104620000',
                              'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                              'трикотажные женские или для девочек, из хлопка'),
                             ('6104630000',
                              'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                              'трикотажные женские или для девочек, из синтетических нитей'),
                             ('6104690002',
                              'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи), женские или для '
                              'девочек, из искусственных нитей'),
                             ('6104690009',
                              'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                              'материалов'),
                             ('6204618500',
                              'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                              'девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                             ('6204625100',
                              'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                              'для девочек, из хлопчатобумажной пряжи'),
                             ('6204625900',
                              'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из '
                              'хлопчатобумажной пряжи'),
                             ('6204629000',
                              'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                              'девочек, из хлопчатобумажной пряжи'),
                             ('6204633100',
                              'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                              'для девочек, из синтетических нитей'),
                             ('6204633900',
                              'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из синтетических '
                              'нитей'),
                             ('6204639000',
                              'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                              'девочек, из синтетических нитей'),
                             ('6204693100',
                              'Комбинезоны с нагрудниками и лямками производственные и профессиональные, женские или '
                              'для девочек, из искусственных нитей'),
                             ('6204693900',
                              'Прочие комбинезоны с нагрудниками и лямками женские или для девочек, из искусственных '
                              'нитей'),
                             ('6204695000',
                              'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                              'девочек, из искусственных нитей'),
                             ('6204699000',
                              'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                              'прочих текстильных материалов'),
                             ('6211421000',
                              'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                              '(пригодная или не пригодная для домашнего применения) женская или для девочек, из '
                              'хлопчатобумажной пряжи'),
                             ('6211431000',
                              'Фартуки, комбинезоны, спецодежда и другая производственная и профессиональная одежда '
                              '(пригодная или не пригодная для домашнего применения), из химических нитей, женская или '
                              'для девочек')))},
 'КОСТЮМ': {'Без указания пола': (('6104130000',
                                   '6104192000',
                                   '6104199001',
                                   '6104199009',
                                   '6112110000',
                                   '6112120000',
                                   '6112190000',
                                   '6112200000',
                                   '6204110000',
                                   '6204120000',
                                   '6204130000',
                                   '6204191000',
                                   '6204199000',
                                   '6211200000',
                                   '6211423100',
                                   '6211433100'),
                                  (('6104130000',
                                    'Костюмы трикотажные, женские или для девочек, из синтетических нитей'),
                                   ('6104192000',
                                    'Костюмы трикотажные машинного или ручного вязания, женские или для девочек из '
                                    'хлопчатобумажной пряжи'),
                                   ('6104199001',
                                    'Костюмы женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                                    'животных'),
                                   ('6104199009', 'Костюмы женские или для девочек, из прочих текстильных материалов'),
                                   ('6112110000',
                                    'Костюмы спортивные, трикотажные из хлопчатобумажной пряжи, машинного или ручного '
                                    'вязания'),
                                   ('6112120000',
                                    'Костюмы спортивные, трикотажные из синтетических нитей, машинного или ручного '
                                    'вязания'),
                                   ('6112190000',
                                    'Костюмы спортивные, трикотажные из прочих текстильных материалов, машинного или '
                                    'ручного вязания'),
                                   ('6112200000', 'Лыжные костюмы, трикотажные, машинного или ручного вязания'),
                                   ('6204110000',
                                    'Костюмы женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                                    'животных'),
                                   ('6204120000', 'Костюмы женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6204130000', 'Костюмы женские или для девочек, из синтетических нитей'),
                                   ('6204191000', 'Костюмы женские или для девочек, из искусственных нитей'),
                                   ('6204199000', 'Костюмы женские или для девочек, из прочих текстильных материалов'),
                                   ('6211200000', 'Лыжные костюмы'),
                                   ('6211423100',
                                    'Спортивные костюмы с подкладкой с лицевой стороной из одного и того же материала '
                                    'женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6211433100',
                                    'Спортивные костюмы женские или для девочек с подкладкой с лицевой стороной из '
                                    'одного и того же материала, из химических нитей'))),
            'Жен.': (('6104130000',
                      '6104192000',
                      '6104199001',
                      '6104199009',
                      '6112110000',
                      '6112120000',
                      '6112190000',
                      '6112200000',
                      '6204110000',
                      '6204120000',
                      '6204130000',
                      '6204191000',
                      '6204199000',
                      '6211200000',
                      '6211423100',
                      '6211433100'),
                     (('6104130000', 'Костюмы трикотажные, женские или для девочек, из синтетических нитей'),
                      ('6104192000',
                       'Костюмы трикотажные машинного или ручного вязания, женские или для девочек из хлопчатобумажной '
                       'пряжи'),
                      ('6104199001',
                       'Костюмы женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6104199009', 'Костюмы женские или для девочек, из прочих текстильных материалов'),
                      ('6112110000',
                       'Костюмы спортивные, трикотажные из хлопчатобумажной пряжи, машинного или ручного вязания'),
                      ('6112120000',
                       'Костюмы спортивные, трикотажные из синтетических нитей, машинного или ручного вязания'),
                      ('6112190000',
                       'Костюмы спортивные, трикотажные из прочих текстильных материалов, машинного или ручного '
                       'вязания'),
                      ('6112200000', 'Лыжные костюмы, трикотажные, машинного или ручного вязания'),
                      ('6204110000',
                       'Костюмы женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6204120000', 'Костюмы женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6204130000', 'Костюмы женские или для девочек, из синтетических нитей'),
                      ('6204191000', 'Костюмы женские или для девочек, из искусственных нитей'),
                      ('6204199000', 'Костюмы женские или для девочек, из прочих текстильных материалов'),
                      ('6211200000', 'Лыжные костюмы'),
                      ('6211423100',
                       'Спортивные костюмы с подкладкой с лицевой стороной из одного и того же материала женские или '
                       'для девочек, из хлопчатобумажной пряжи'),
                      ('6211433100',
                       'Спортивные костюмы женские или для девочек с подкладкой с лицевой стороной из одного и того же '
                       'материала, из химических нитей'))),
            'Муж.': (('6103101000',
                      '6103109000',
                      '6112110000',
                      '6112120000',
                      '6112190000',
                      '6112200000',
                      '6203110000',
                      '6203120000',
                      '6203191000',
                      '6203193000',
                      '6203199000',
                      '6211200000',
                      '6211323100',
                      '6211333100'),
                     (('6103101000',
                       'Костюмы трикотажные машинного или ручного вязания, мужские или для мальчиков из шерстяной '
                       'пряжи или пряжи из тонкого волоса животных'),
                      ('6103109000',
                       'Костюмы трикотажные машинного или ручного вязания, мужские или для мальчиков из прочих '
                       'текстильных материалов'),
                      ('6112110000',
                       'Костюмы спортивные, трикотажные из хлопчатобумажной пряжи, машинного или ручного вязания'),
                      ('6112120000',
                       'Костюмы спортивные, трикотажные из синтетических нитей, машинного или ручного вязания'),
                      ('6112190000',
                       'Костюмы спортивные, трикотажные из прочих текстильных материалов, машинного или ручного '
                       'вязания'),
                      ('6112200000', 'Лыжные костюмы, трикотажные, машинного или ручного вязания'),
                      ('6203110000',
                       'Костюмы мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6203120000', 'Костюмы мужские или для мальчиков, из синтетических нитей'),
                      ('6203191000', 'Костюмы мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6203193000', 'Костюмы мужские или для мальчиков, из искусственных нитей'),
                      ('6203199000', 'Костюмы мужские или для мальчиков, из прочих текстильных материалов'),
                      ('6211200000', 'Лыжные костюмы'),
                      ('6211323100',
                       'Спортивные костюмы с подкладкой мужские или для мальчиков с лицевой стороной из одного и того '
                       'же материала, из хлопчатобумажной пряжи'),
                      ('6211333100',
                       'Спортивные костюмы с подкладкой мужские или для мальчиков с лицевой стороной из одного и того '
                       'же материала, из химических нитей'))),
            'Унисекс': (('6104130000',
                         '6104192000',
                         '6104199001',
                         '6104199009',
                         '6112110000',
                         '6112120000',
                         '6112190000',
                         '6112200000',
                         '6204110000',
                         '6204120000',
                         '6204130000',
                         '6204191000',
                         '6204199000',
                         '6211200000',
                         '6211423100',
                         '6211433100'),
                        (('6104130000', 'Костюмы трикотажные, женские или для девочек, из синтетических нитей'),
                         ('6104192000',
                          'Костюмы трикотажные машинного или ручного вязания, женские или для девочек из '
                          'хлопчатобумажной пряжи'),
                         ('6104199001',
                          'Костюмы женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6104199009', 'Костюмы женские или для девочек, из прочих текстильных материалов'),
                         ('6112110000',
                          'Костюмы спортивные, трикотажные из хлопчатобумажной пряжи, машинного или ручного вязания'),
                         ('6112120000',
                          'Костюмы спортивные, трикотажные из синтетических нитей, машинного или ручного вязания'),
                         ('6112190000',
                          'Костюмы спортивные, трикотажные из прочих текстильных материалов, машинного или ручного '
                          'вязания'),
                         ('6112200000', 'Лыжные костюмы, трикотажные, машинного или ручного вязания'),
                         ('6204110000',
                          'Костюмы женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6204120000', 'Костюмы женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6204130000', 'Костюмы женские или для девочек, из синтетических нитей'),
                         ('6204191000', 'Костюмы женские или для девочек, из искусственных нитей'),
                         ('6204199000', 'Костюмы женские или для девочек, из прочих текстильных материалов'),
                         ('6211200000', 'Лыжные костюмы'),
                         ('6211423100',
                          'Спортивные костюмы с подкладкой с лицевой стороной из одного и того же материала женские '
                          'или для девочек, из хлопчатобумажной пряжи'),
                         ('6211433100',
                          'Спортивные костюмы женские или для девочек с подкладкой с лицевой стороной из одного и того '
                          'же материала, из химических нитей')))},
 'КОСУХА': {'Без указания пола': (('4203100001',
                                   '6102109000',
                                   '6102209000',
                                   '6102309000',
                                   '6102909000',
                                   '6104310000',
                                   '6104320000',
                                   '6104330000',
                                   '6104390000',
                                   '6202200000',
                                   '6202300000',
                                   '6204310000',
                                   '6204329000',
                                   '6204339000',
                                   '6204391900',
                                   '6204399000'),
                                  (('4203100001', '- -- из натуральной кожи'),
                                   ('6102109000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, '
                                    'кроме одежды из товарной позиции 6104'),
                                   ('6102209000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной '
                                    'позиции 6104'),
                                   ('6102309000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из химических нитей, трикотажные, кроме изделий товарной позиции '
                                    '6104'),
                                   ('6102909000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной '
                                    'позиции 6104'),
                                   ('6104310000',
                                    'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или '
                                    'пряжи из тонкого волоса животных, машинного или ручного вязания'),
                                   ('6104320000',
                                    'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной '
                                    'пряжи, машинного или ручного вязания'),
                                   ('6104330000',
                                    'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, '
                                    'машинного или ручного вязания'),
                                   ('6104390000',
                                    'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                                    'материалов, машинного или ручного вязания'),
                                   ('6202200000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'),
                                   ('6204310000',
                                    'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из '
                                    'тонкого волоса животных'),
                                   ('6204329000',
                                    'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                   ('6204391900',
                                    'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                                   ('6204399000',
                                    'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                    'материалов            <6104390000> Жакеты и блайзеры, трикотажные, женские или '
                                    'для девочек, из прочих текстильных материалов, машинного или ручного '
                                    'вязания                        <6102909000> Куртки (включая лыжные), ветровки, '
                                    'штормовки и аналогичные изделия женские или для девочек из прочих текстильных '
                                    'материалов, трикотажные, кроме изделий товарной позиции 6104'))),
            'Жен.': (('4203100001',
                      '6102109000',
                      '6102209000',
                      '6102309000',
                      '6102909000',
                      '6104310000',
                      '6104320000',
                      '6104330000',
                      '6104390000',
                      '6202200000',
                      '6202300000',
                      '6204310000',
                      '6204329000',
                      '6204339000',
                      '6204391900',
                      '6204399000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('6102109000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из товарной '
                       'позиции 6104'),
                      ('6102209000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102309000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102909000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6104310000',
                       'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                       'тонкого волоса животных, машинного или ручного вязания'),
                      ('6104320000',
                       'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, машинного '
                       'или ручного вязания'),
                      ('6104330000',
                       'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного или '
                       'ручного вязания'),
                      ('6104390000',
                       'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                       'машинного или ручного вязания'),
                      ('6202200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'),
                      ('6204310000',
                       'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                      ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                      ('6204399000',
                       'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов            '
                       '<6104390000> Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                       'материалов, машинного или ручного вязания                        <6102909000> Куртки (включая '
                       'лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из прочих '
                       'текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'))),
            'Муж.': (('4203100001',
                      '6101209000',
                      '6101309000',
                      '6101908000',
                      '6103310000',
                      '6103320000',
                      '6103330000',
                      '6103390000',
                      '6201200000',
                      '6201300000',
                      '6201400000',
                      '6201900000',
                      '6203310000',
                      '6203321000',
                      '6203329000',
                      '6203331000',
                      '6203339000',
                      '6203391100',
                      '6203391900',
                      '6203399000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('6101209000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия из хлопчатобумажной пряжи '
                       'трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                      ('6101309000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские или для мальчиков '
                       'из химических нитей, трикотажные, кроме изделий товарной позиции 6103'),
                      ('6101908000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих текстильных '
                       'материалов <6103390000> Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из прочих '
                       'текстильных материалов <6203399000> Пиджаки и блайзеры мужские или для мальчиков из прочих '
                       'текстильных материалов'),
                      ('6103310000',
                       'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из '
                       'тонкого волоса животных, машинного или ручного вязания'),
                      ('6103320000',
                       'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6103330000',
                       'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из синтетических нитей'),
                      ('6103390000',
                       'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из прочих текстильных материалов'),
                      ('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                       'пряжи'),
                      ('6201400000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'),
                      ('6203310000',
                       'Пиджаки и блайзеры мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6203321000',
                       'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                       'хлопчатобумажной пряжи'),
                      ('6203329000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6203331000',
                       'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                       'синтетических нитей'),
                      ('6203339000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из синтетических нитей'),
                      ('6203391100',
                       'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                       'искусственных нитей'),
                      ('6203391900', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из искусственных нитей'),
                      ('6203399000', 'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов'))),
            'Унисекс': (('4203100001',
                         '6102109000',
                         '6102209000',
                         '6102309000',
                         '6102909000',
                         '6104310000',
                         '6104320000',
                         '6104330000',
                         '6104390000',
                         '6202200000',
                         '6202300000',
                         '6204310000',
                         '6204329000',
                         '6204339000',
                         '6204391900',
                         '6204399000'),
                        (('4203100001', '- -- из натуральной кожи'),
                         ('6102109000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из '
                          'товарной позиции 6104'),
                         ('6102209000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102309000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102909000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6104310000',
                          'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                          'тонкого волоса животных, машинного или ручного вязания'),
                         ('6104320000',
                          'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                          'машинного или ручного вязания'),
                         ('6104330000',
                          'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                          'или ручного вязания'),
                         ('6104390000',
                          'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                          'машинного или ручного вязания'),
                         ('6202200000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6204310000',
                          'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                         ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                         ('6204399000',
                          'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                          'материалов            <6104390000> Жакеты и блайзеры, трикотажные, женские или для девочек, '
                          'из прочих текстильных материалов, машинного или ручного вязания                        '
                          '<6102909000> Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                          'для девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции '
                          '6104')))},
 'КОФТА': {'Без указания пола': (('6104310000',
                                  '6104320000',
                                  '6104330000',
                                  '6104390000',
                                  '6110111000',
                                  '6110119000',
                                  '6110129001',
                                  '6110129009',
                                  '6110199001',
                                  '6110199009',
                                  '6110209900',
                                  '6110309900',
                                  '6110901000',
                                  '6110909000',
                                  '6204310000',
                                  '6204321000',
                                  '6204329000',
                                  '6204331000',
                                  '6204339000',
                                  '6204391100',
                                  '6204391900',
                                  '6204399000'),
                                 (('6104310000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или '
                                   'пряжи из тонкого волоса животных, машинного или ручного вязания'),
                                  ('6104320000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной '
                                   'пряжи, машинного или ручного вязания'),
                                  ('6104330000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, '
                                   'машинного или ручного вязания'),
                                  ('6104390000',
                                   'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                                   'материалов, машинного или ручного вязания'),
                                  ('6110111000',
                                   'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и '
                                   'содержащие не менее 50 мас.% шерсти'),
                                  ('6110119000',
                                   'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или '
                                   'девочек, из шерстяной пряжи, машинного или ручного вязания'),
                                  ('6110129001',
                                   'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного '
                                   'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                                   'девочек'),
                                  ('6110129009',
                                   'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, '
                                   'из пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                                  ('6110199001',
                                   'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой '
                                   'одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин '
                                   'или девочек'),
                                  ('6110199009',
                                   'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, '
                                   'из шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                                  ('6110209900',
                                   'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                   'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                  ('6110309900',
                                   'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                   'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                  ('6110901000',
                                   'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                                   'волокон или волокна рами, машинного или ручного вязания'),
                                  ('6110909000',
                                   'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                   'прочих текстильных материалов, машинного или ручного вязания <6204399000> Прочие '
                                   'жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'),
                                  ('6204310000',
                                   'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                   'волоса животных'),
                                  ('6204321000',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'хлопчатобумажной пряжи'),
                                  ('6204329000',
                                   'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                                  ('6204331000',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'синтетических нитей'),
                                  ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                  ('6204391100',
                                   'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                                   'искусственных нитей'),
                                  ('6204391900',
                                   'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                                  ('6204399000',
                                   'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                   'материалов'))),
           'Жен.': (('6104310000',
                     '6104320000',
                     '6104330000',
                     '6104390000',
                     '6110111000',
                     '6110119000',
                     '6110129001',
                     '6110129009',
                     '6110199001',
                     '6110199009',
                     '6110209900',
                     '6110309900',
                     '6110901000',
                     '6110909000',
                     '6204310000',
                     '6204321000',
                     '6204329000',
                     '6204331000',
                     '6204339000',
                     '6204391100',
                     '6204391900',
                     '6204399000'),
                    (('6104310000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                      'тонкого волоса животных, машинного или ручного вязания'),
                     ('6104320000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, машинного '
                      'или ручного вязания'),
                     ('6104330000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного или '
                      'ручного вязания'),
                     ('6104390000',
                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                      'машинного или ручного вязания'),
                     ('6110111000',
                      'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и содержащие не '
                      'менее 50 мас.% шерсти'),
                     ('6110119000',
                      'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                      'шерстяной пряжи, машинного или ручного вязания'),
                     ('6110129001',
                      'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г или '
                      'более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                     ('6110129009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                      'тонкого волоса кашмирской козы, для женщин или девочек'),
                     ('6110199001',
                      'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                      'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                     ('6110199009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из шерстяной '
                      'пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                     ('6110209900',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                      'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                     ('6110309900',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                      'нитей, для женщин или девочек, машинного или ручного вязания'),
                     ('6110901000',
                      'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                      'волокна рами, машинного или ручного вязания'),
                     ('6110909000',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                      'текстильных материалов, машинного или ручного вязания <6204399000> Прочие жакеты и блайзеры '
                      'женские или для девочек, из прочих текстильных материалов'),
                     ('6204310000',
                      'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6204321000',
                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                      'хлопчатобумажной пряжи'),
                     ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                     ('6204331000',
                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                      'синтетических нитей'),
                     ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                     ('6204391100',
                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                      'искусственных нитей'),
                     ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                     ('6204399000',
                      'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'))),
           'Муж.': (('6103310000',
                     '6103320000',
                     '6103330000',
                     '6103390000',
                     '6110111000',
                     '6110113000',
                     '6110121001',
                     '6110121009',
                     '6110191001',
                     '6110191009',
                     '6110209100',
                     '6110309100',
                     '6110901000',
                     '6110909000',
                     '6203310000',
                     '6203321000',
                     '6203329000',
                     '6203331000',
                     '6203339000',
                     '6203391100',
                     '6203391900',
                     '6203399000'),
                    (('6103310000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из '
                      'тонкого волоса животных, машинного или ручного вязания'),
                     ('6103320000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6103330000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из синтетических нитей'),
                     ('6103390000',
                      'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из прочих текстильных материалов'),
                     ('6110111000',
                      'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и содержащие не '
                      'менее 50 мас.% шерсти'),
                     ('6110113000',
                      'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для мужчин или мальчиков, из '
                      'шерстяной пряжи, машинного или ручного вязания'),
                     ('6110121001',
                      'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г или '
                      'более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                     ('6110121009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи из '
                      'тонкого волоса кашмирской козы, для мужчин или мальчиков'),
                     ('6110191001',
                      'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                      'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                     ('6110191009',
                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из шерстяной '
                      'пряжи или пряжи из тонкого волоса животных, для мужчин или мальчиков'),
                     ('6110209100',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                      'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                     ('6110309100',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                      'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                     ('6110901000',
                      'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                      'волокна рами, машинного или ручного вязания'),
                     ('6110909000',
                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                      'текстильных материалов, машинного или ручного вязания        <6103390000> Пиджаки и блайзеры '
                      'трикотажные, мужские или для мальчиков, из прочих текстильных материалов'),
                     ('6203310000',
                      'Пиджаки и блайзеры мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6203321000',
                      'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                      'хлопчатобумажной пряжи'),
                     ('6203329000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6203331000',
                      'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                      'синтетических нитей'),
                     ('6203339000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из синтетических нитей'),
                     ('6203391100',
                      'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                      'искусственных нитей'),
                     ('6203391900', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из искусственных нитей'),
                     ('6203399000', 'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов'))),
           'Унисекс': (('6104310000',
                        '6104320000',
                        '6104330000',
                        '6104390000',
                        '6110111000',
                        '6110119000',
                        '6110129001',
                        '6110129009',
                        '6110199001',
                        '6110199009',
                        '6110209900',
                        '6110309900',
                        '6110901000',
                        '6110909000',
                        '6204310000',
                        '6204321000',
                        '6204329000',
                        '6204331000',
                        '6204339000',
                        '6204391100',
                        '6204391900',
                        '6204399000'),
                       (('6104310000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                         'тонкого волоса животных, машинного или ручного вязания'),
                        ('6104320000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                         'машинного или ручного вязания'),
                        ('6104330000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                         'или ручного вязания'),
                        ('6104390000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                         'машинного или ручного вязания'),
                        ('6110111000',
                         'Свитеры и пуловеры из шерстяной пряжи, массой одного изделия 600 г или более и содержащие не '
                         'менее 50 мас.% шерсти'),
                        ('6110119000',
                         'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                         'шерстяной пряжи, машинного или ручного вязания'),
                        ('6110129001',
                         'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                         'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                        ('6110129009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи '
                         'из тонкого волоса кашмирской козы, для женщин или девочек'),
                        ('6110199001',
                         'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                         'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                        ('6110199009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                        ('6110209900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                         'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                        ('6110309900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                         'нитей, для женщин или девочек, машинного или ручного вязания'),
                        ('6110901000',
                         'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                         'или волокна рами, машинного или ручного вязания'),
                        ('6110909000',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                         'текстильных материалов, машинного или ручного вязания <6204399000> Прочие жакеты и блайзеры '
                         'женские или для девочек, из прочих текстильных материалов'),
                        ('6204310000',
                         'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6204321000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'хлопчатобумажной пряжи'),
                        ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                        ('6204331000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'синтетических нитей'),
                        ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                        ('6204391100',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'искусственных нитей'),
                        ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                        ('6204399000',
                         'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов')))},
 'КУРТКА': {'Без указания пола': (('4203100001',
                                   '6102109000',
                                   '6102209000',
                                   '6102309000',
                                   '6102909000',
                                   '6202200000',
                                   '6202300000'),
                                  (('4203100001', '- -- из натуральной кожи'),
                                   ('6102109000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, '
                                    'кроме одежды из товарной позиции 6104'),
                                   ('6102209000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной '
                                    'позиции 6104'),
                                   ('6102309000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из химических нитей, трикотажные, кроме изделий товарной позиции '
                                    '6104'),
                                   ('6102909000',
                                    'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                    'для девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной '
                                    'позиции 6104'),
                                   ('6202200000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'))),
            'Жен.': (('4203100001', '6102109000', '6102209000', '6102309000', '6102909000', '6202200000', '6202300000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('6102109000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из товарной '
                       'позиции 6104'),
                      ('6102209000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102309000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6102909000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек из '
                       'прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                      ('6202200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'))),
            'Муж.': (('4203100001',
                      '6101209000',
                      '6101309000',
                      '6101908000',
                      '6201200000',
                      '6201300000',
                      '6201400000',
                      '6201900000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('6101209000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия из хлопчатобумажной пряжи '
                       'трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                      ('6101309000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские или для мальчиков '
                       'из химических нитей, трикотажные, кроме изделий товарной позиции 6103'),
                      ('6101908000',
                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих текстильных '
                       'материалов'),
                      ('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                       'пряжи'),
                      ('6201400000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'))),
            'Унисекс': (('4203100001',
                         '6102109000',
                         '6102209000',
                         '6102309000',
                         '6102909000',
                         '6202200000',
                         '6202300000'),
                        (('4203100001', '- -- из натуральной кожи'),
                         ('6102109000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из '
                          'товарной позиции 6104'),
                         ('6102209000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102309000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102909000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6202200000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи')))},
 'КУРТКА-ЖИЛЕТ': {'Без указания пола': (('4203100001',
                                         '6102109000',
                                         '6102209000',
                                         '6102309000',
                                         '6102909000',
                                         '6202200000',
                                         '6202300000'),
                                        (('4203100001', '- -- из натуральной кожи'),
                                         ('6102109000',
                                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские '
                                          'или для девочек из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                          'трикотажные, кроме одежды из товарной позиции 6104'),
                                         ('6102209000',
                                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские '
                                          'или для девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий '
                                          'товарной позиции 6104'),
                                         ('6102309000',
                                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские '
                                          'или для девочек из химических нитей, трикотажные, кроме изделий товарной '
                                          'позиции 6104'),
                                         ('6102909000',
                                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские '
                                          'или для девочек из прочих текстильных материалов, трикотажные, кроме '
                                          'изделий товарной позиции 6104'),
                                         ('6202200000',
                                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                          'штормовки и аналогичные изделия женские или для девочек, кроме изделий '
                                          'товарной позиции 6204, из шерстяной пряжи или пряжи из тонкого волоса '
                                          'животных'),
                                         ('6202300000',
                                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                          'штормовки и аналогичные изделия женские или для девочек, кроме изделий '
                                          'товарной позиции 6204, из хлопчатобумажной пряжи'))),
                  'Жен.': (('4203100001',
                            '6102109000',
                            '6102209000',
                            '6102309000',
                            '6102909000',
                            '6202200000',
                            '6202300000'),
                           (('4203100001', '- -- из натуральной кожи'),
                            ('6102109000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме '
                             'одежды из товарной позиции 6104'),
                            ('6102209000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                            ('6102309000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                            ('6102909000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции '
                             '6104'),
                            ('6202200000',
                             'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                             'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                             'шерстяной пряжи или пряжи из тонкого волоса животных'),
                            ('6202300000',
                             'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                             'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                             'хлопчатобумажной пряжи'))),
                  'Муж.': (('4203100001',
                            '6101209000',
                            '6101309000',
                            '6101908000',
                            '6201200000',
                            '6201300000',
                            '6201400000',
                            '6201900000'),
                           (('4203100001', '- -- из натуральной кожи'),
                            ('6101209000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия из хлопчатобумажной '
                             'пряжи трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                            ('6101309000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские или для '
                             'мальчиков из химических нитей, трикотажные, кроме изделий товарной позиции 6103'),
                            ('6101908000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих '
                             'текстильных материалов'),
                            ('6201200000',
                             'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                             'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                             'шерстяной пряжи или пряжи из тонкого волоса животных'),
                            ('6201300000',
                             'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                             'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                             'хлопчатобумажной пряжи'),
                            ('6201400000',
                             'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                             'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                             'химических нитей'),
                            ('6201900000',
                             'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                             'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                             'прочих текстильных материалов'))),
                  'Унисекс': (('4203100001',
                               '6102109000',
                               '6102209000',
                               '6102309000',
                               '6102909000',
                               '6202200000',
                               '6202300000'),
                              (('4203100001', '- -- из натуральной кожи'),
                               ('6102109000',
                                'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                                'девочек из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме '
                                'одежды из товарной позиции 6104'),
                               ('6102209000',
                                'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                                'девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                               ('6102309000',
                                'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                                'девочек из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                               ('6102909000',
                                'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                                'девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции '
                                '6104'),
                               ('6202200000',
                                'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                                'шерстяной пряжи или пряжи из тонкого волоса животных'),
                               ('6202300000',
                                'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                                'хлопчатобумажной пряжи')))},
 'КУРТКА-ПИЛОТ (БОМБЕР)': {'Без указания пола': (('4203100001',), (('4203100001', '- -- из натуральной кожи'),)),
                           'Жен.': (('4203100001', '6202300000', '6202900001'),
                                    (('4203100001', '- -- из натуральной кожи'),
                                     ('6202300000',
                                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                      'штормовки и аналогичные изделия женские или для девочек, кроме изделий товарной '
                                      'позиции 6204, из хлопчатобумажной пряжи'),
                                     ('6202900001',
                                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                      'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                      'материалов'))),
                           'Муж.': (('4203100001', '6201200000', '6201300000', '6201900000'),
                                    (('4203100001', '- -- из натуральной кожи'),
                                     ('6201200000',
                                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                      'штормовки и аналогичные изделия мужские или для мальчиков, кроме изделий '
                                      'товарной позиции 6203, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                     ('6201300000',
                                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                      'штормовки и аналогичные изделия мужские или для мальчиков, кроме изделий '
                                      'товарной позиции 6203, из хлопчатобумажной пряжи'),
                                     ('6201900000',
                                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                      'штормовки и аналогичные изделия мужские или для мальчиков, кроме изделий '
                                      'товарной позиции 6203, из прочих текстильных материалов'))),
                           'Унисекс': (('4203100001', '6202300000', '6202900001'),
                                       (('4203100001', '- -- из натуральной кожи'),
                                        ('6202300000',
                                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                         'штормовки и аналогичные изделия женские или для девочек, кроме изделий '
                                         'товарной позиции 6204, из хлопчатобумажной пряжи'),
                                        ('6202900001',
                                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                         'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                         'материалов')))},
 'КЮЛОТЫ': {'Без указания пола': (('6104610001',
                                   '6104620000',
                                   '6104630000',
                                   '6104690001',
                                   '6204611000',
                                   '6204618500',
                                   '6204621100',
                                   '6204623100',
                                   '6204623300',
                                   '6204623900',
                                   '6204629000',
                                   '6204631100',
                                   '6204631800',
                                   '6204639000',
                                   '6204691100',
                                   '6204691800',
                                   '6204695000',
                                   '6204699000'),
                                  (('6104610001',
                                    'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                    'волоса животных'),
                                   ('6104620000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                    'трикотажные женские или для девочек, из хлопка'),
                                   ('6104630000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                    'трикотажные женские или для девочек, из синтетических нитей'),
                                   ('6104690001',
                                    'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                                   ('6204611000',
                                    'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                    'волоса животных'),
                                   ('6204618500',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6204621100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'хлопчатобумажной пряжи'),
                                   ('6204623100',
                                    'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                                   ('6204623300',
                                    'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным '
                                    'ворсом'),
                                   ('6204623900',
                                    'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                                   ('6204629000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из хлопчатобумажной пряжи'),
                                   ('6204631100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'синтетических нитей'),
                                   ('6204631800',
                                    'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                                   ('6204639000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из синтетических нитей'),
                                   ('6204691100',
                                    'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                    'искусственных нитей'),
                                   ('6204691800',
                                    'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                                   ('6204695000',
                                    'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                    'для девочек, из искусственных нитей'),
                                   ('6204699000',
                                    'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                    'девочек,из прочих текстильных материалов'))),
            'Жен.': (('6104610001',
                      '6104620000',
                      '6104630000',
                      '6104690001',
                      '6204611000',
                      '6204618500',
                      '6204621100',
                      '6204623100',
                      '6204623300',
                      '6204623900',
                      '6204629000',
                      '6204631100',
                      '6204631800',
                      '6204639000',
                      '6204691100',
                      '6204691800',
                      '6204695000',
                      '6204699000'),
                     (('6104610001',
                       'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6104620000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                       'женские или для девочек, из хлопка'),
                      ('6104630000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                       'женские или для девочек, из синтетических нитей'),
                      ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                      ('6204611000',
                       'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6204618500',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6204621100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                       'хлопчатобумажной пряжи'),
                      ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                      ('6204623300',
                       'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                      ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                      ('6204629000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'хлопчатобумажной пряжи'),
                      ('6204631100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из синтетических '
                       'нитей'),
                      ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                      ('6204639000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'синтетических нитей'),
                      ('6204691100',
                       'Брюки и бриджи производственные и профессиональные, женские или для девочек, из искусственных '
                       'нитей'),
                      ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                      ('6204695000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, из '
                       'искусственных нитей'),
                      ('6204699000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из прочих '
                       'текстильных материалов'))),
            'Муж.': (('6103410000',
                      '6103420001',
                      '6103430001',
                      '6103430009',
                      '6103490001',
                      '6103490009',
                      '6203411000',
                      '6203419000',
                      '6203421100',
                      '6203423100',
                      '6203423300',
                      '6203423500',
                      '6203429000',
                      '6203431100',
                      '6203431900',
                      '6203439000',
                      '6203491100',
                      '6203491900',
                      '6203495000',
                      '6203499000'),
                     (('6103410000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных) трикотажные, '
                       'мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6103420001', 'Брюки и бриджи, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6103430001', 'Брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                      ('6103430009',
                       'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи) мужские или для мальчиков, '
                       'из синтетических нитей'),
                      ('6103490001', 'Брюки и бриджи мужские или для мальчиков, из прочих текстильных материалов'),
                      ('6103490009',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов, '
                       'мужские или для мальчиков'),
                      ('6203411000',
                       'Брюки и бриджи мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6203419000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6203421100',
                       'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                       'хлопчатобумажной пряжи'),
                      ('6203423100', 'Брюки и бриджи мужские или для мальчиков, из денима, или джинсовой ткани'),
                      ('6203423300', 'Брюки и бриджи мужские или для мальчиков, из вельвет-корда с разрезным ворсом'),
                      ('6203423500', 'Прочие брюки и бриджи мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6203429000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из хлопчатобумажной пряжи'),
                      ('6203431100',
                       'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                       'синтетических нитей'),
                      ('6203431900', 'Прочие брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                      ('6203439000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из синтетических нитей'),
                      ('6203491100',
                       'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                       'искусственных нитей'),
                      ('6203491900', 'Прочие брюки и бриджи мужские или для мальчиков, из искусственных нитей'),
                      ('6203495000',
                       'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                       'из искусственных нитей'),
                      ('6203499000',
                       'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, мужские или для мальчиков, из '
                       'прочих текстильных материалов'))),
            'Унисекс': (('6104610001',
                         '6104620000',
                         '6104630000',
                         '6104690001',
                         '6204611000',
                         '6204618500',
                         '6204621100',
                         '6204623100',
                         '6204623300',
                         '6204623900',
                         '6204629000',
                         '6204631100',
                         '6204631800',
                         '6204639000',
                         '6204691100',
                         '6204691800',
                         '6204695000',
                         '6204699000'),
                        (('6104610001',
                          'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6104620000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                          'женские или для девочек, из хлопка'),
                         ('6104630000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                          'женские или для девочек, из синтетических нитей'),
                         ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                         ('6204611000',
                          'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6204618500',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6204621100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'хлопчатобумажной пряжи'),
                         ('6204623100',
                          'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                         ('6204623300',
                          'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                         ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                         ('6204629000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из хлопчатобумажной пряжи'),
                         ('6204631100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'синтетических нитей'),
                         ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                         ('6204639000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из синтетических нитей'),
                         ('6204691100',
                          'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                          'искусственных нитей'),
                         ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                         ('6204695000',
                          'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                          'из искусственных нитей'),
                         ('6204699000',
                          'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                          'прочих текстильных материалов')))},
 'ЛЕГИНСЫ': {'Без указания пола': (('6104610001',
                                    '6104620000',
                                    '6104630000',
                                    '6104690001',
                                    '6204611000',
                                    '6204618500',
                                    '6204621100',
                                    '6204623100',
                                    '6204623300',
                                    '6204623900',
                                    '6204629000',
                                    '6204631100',
                                    '6204631800',
                                    '6204639000',
                                    '6204691100',
                                    '6204691800',
                                    '6204695000',
                                    '6204699000'),
                                   (('6104610001',
                                     'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                     'волоса животных'),
                                    ('6104620000',
                                     'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                     'трикотажные женские или для девочек, из хлопка'),
                                    ('6104630000',
                                     'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                     'трикотажные женские или для девочек, из синтетических нитей'),
                                    ('6104690001',
                                     'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                                    ('6204611000',
                                     'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                                     'волоса животных'),
                                    ('6204618500',
                                     'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                     'для девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                    ('6204621100',
                                     'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                     'хлопчатобумажной пряжи'),
                                    ('6204623100',
                                     'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                                    ('6204623300',
                                     'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным '
                                     'ворсом'),
                                    ('6204623900',
                                     'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                                    ('6204629000',
                                     'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                     'для девочек, из хлопчатобумажной пряжи'),
                                    ('6204631100',
                                     'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                     'синтетических нитей'),
                                    ('6204631800',
                                     'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                                    ('6204639000',
                                     'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                     'для девочек, из синтетических нитей'),
                                    ('6204691100',
                                     'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                                     'искусственных нитей'),
                                    ('6204691800',
                                     'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                                    ('6204695000',
                                     'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                     'для девочек, из искусственных нитей'),
                                    ('6204699000',
                                     'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                     'девочек,из прочих текстильных материалов'))),
             'Жен.': (('6104610001',
                       '6104620000',
                       '6104630000',
                       '6104690001',
                       '6204611000',
                       '6204618500',
                       '6204621100',
                       '6204623100',
                       '6204623300',
                       '6204623900',
                       '6204629000',
                       '6204631100',
                       '6204631800',
                       '6204639000',
                       '6204691100',
                       '6204691800',
                       '6204695000',
                       '6204699000'),
                      (('6104610001',
                        'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                        'животных'),
                       ('6104620000',
                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                        'женские или для девочек, из хлопка'),
                       ('6104630000',
                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                        'женские или для девочек, из синтетических нитей'),
                       ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                       ('6204611000',
                        'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                        'животных'),
                       ('6204618500',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                        'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6204621100',
                        'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                        'хлопчатобумажной пряжи'),
                       ('6204623100', 'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                       ('6204623300',
                        'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                       ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                       ('6204629000',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                        'из хлопчатобумажной пряжи'),
                       ('6204631100',
                        'Брюки и бриджи производственные и профессиональные, женские или для девочек, из синтетических '
                        'нитей'),
                       ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                       ('6204639000',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                        'из синтетических нитей'),
                       ('6204691100',
                        'Брюки и бриджи производственные и профессиональные, женские или для девочек, из искусственных '
                        'нитей'),
                       ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                       ('6204695000',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек, '
                        'из искусственных нитей'),
                       ('6204699000',
                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из прочих '
                        'текстильных материалов'))),
             'Муж.': (('6103410000',
                       '6103420001',
                       '6103430001',
                       '6103430009',
                       '6103490001',
                       '6103490009',
                       '6203411000',
                       '6203419000',
                       '6203421100',
                       '6203423100',
                       '6203423300',
                       '6203423500',
                       '6203429000',
                       '6203431100',
                       '6203431900',
                       '6203439000',
                       '6203491100',
                       '6203491900',
                       '6203495000',
                       '6203499000'),
                      (('6103410000',
                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных) трикотажные, '
                        'мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6103420001', 'Брюки и бриджи, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                       ('6103430001', 'Брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                       ('6103430009',
                        'Комбинезоны с нагрудниками и лямками, шорты (кроме: брюки и бриджи) мужские или для '
                        'мальчиков, из синтетических нитей'),
                       ('6103490001', 'Брюки и бриджи мужские или для мальчиков, из прочих текстильных материалов'),
                       ('6103490009',
                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                        'материалов, мужские или для мальчиков'),
                       ('6203411000',
                        'Брюки и бриджи мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                        'животных'),
                       ('6203419000',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                        'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6203421100',
                        'Брюки и бриджи производственные и профессиональные мужские или для мальчиков, из '
                        'хлопчатобумажной пряжи'),
                       ('6203423100', 'Брюки и бриджи мужские или для мальчиков, из денима, или джинсовой ткани'),
                       ('6203423300', 'Брюки и бриджи мужские или для мальчиков, из вельвет-корда с разрезным ворсом'),
                       ('6203423500', 'Прочие брюки и бриджи мужские или для мальчиков, из хлопчатобумажной пряжи'),
                       ('6203429000',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                        'из хлопчатобумажной пряжи'),
                       ('6203431100',
                        'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                        'синтетических нитей'),
                       ('6203431900', 'Прочие брюки и бриджи мужские или для мальчиков, из синтетических нитей'),
                       ('6203439000',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                        'из синтетических нитей'),
                       ('6203491100',
                        'Брюки и бриджи производственные и профессиональные, мужские или для мальчиков, из '
                        'искусственных нитей'),
                       ('6203491900', 'Прочие брюки и бриджи мужские или для мальчиков, из искусственных нитей'),
                       ('6203495000',
                        'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты мужские или для мальчиков, '
                        'из искусственных нитей'),
                       ('6203499000',
                        'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, мужские или для мальчиков, из '
                        'прочих текстильных материалов'))),
             'Унисекс': (('6104610001',
                          '6104620000',
                          '6104630000',
                          '6104690001',
                          '6204611000',
                          '6204618500',
                          '6204621100',
                          '6204623100',
                          '6204623300',
                          '6204623900',
                          '6204629000',
                          '6204631100',
                          '6204631800',
                          '6204639000',
                          '6204691100',
                          '6204691800',
                          '6204695000',
                          '6204699000'),
                         (('6104610001',
                           'Брюки и бриджи, женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                           'животных'),
                          ('6104620000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                           'женские или для девочек, из хлопка'),
                          ('6104630000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                           'женские или для девочек, из синтетических нитей'),
                          ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                          ('6204611000',
                           'Брюки и бриджи женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                           'животных'),
                          ('6204618500',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6204621100',
                           'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                           'хлопчатобумажной пряжи'),
                          ('6204623100',
                           'Прочие брюки и бриджи женские или для девочек, из денима, или джинсовой ткани'),
                          ('6204623300',
                           'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'),
                          ('6204623900', 'Прочие брюки и бриджи женские или для девочек, из хлопчатобумажной пряжи'),
                          ('6204629000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из хлопчатобумажной пряжи'),
                          ('6204631100',
                           'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                           'синтетических нитей'),
                          ('6204631800', 'Прочие брюки и бриджи женские или для девочек, из синтетических нитей'),
                          ('6204639000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из синтетических нитей'),
                          ('6204691100',
                           'Брюки и бриджи производственные и профессиональные, женские или для девочек, из '
                           'искусственных нитей'),
                          ('6204691800', 'Прочие брюки и бриджи женские или для девочек, из искусственных нитей'),
                          ('6204695000',
                           'Прочие брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                           'девочек, из искусственных нитей'),
                          ('6204699000',
                           'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                           'прочих текстильных материалов')))},
 'ЛОНГСЛИВ': {'Без указания пола': (('6104320000',
                                     '6104330000',
                                     '6104390000',
                                     '6110119000',
                                     '6110129009',
                                     '6110199009',
                                     '6110201000',
                                     '6110209900',
                                     '6110301000',
                                     '6110309900',
                                     '6110901000',
                                     '6110909000',
                                     '6204310000',
                                     '6204321000',
                                     '6204329000',
                                     '6204331000',
                                     '6204339000',
                                     '6204391100',
                                     '6204391900',
                                     '6204399000'),
                                    (('6104320000',
                                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной '
                                      'пряжи, машинного или ручного вязания'),
                                     ('6104330000',
                                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических '
                                      'нитей, машинного или ручного вязания'),
                                     ('6104390000',
                                      'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                                      'материалов, машинного или ручного вязания'),
                                     ('6110119000',
                                      'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или '
                                      'девочек, из шерстяной пряжи, машинного или ручного вязания'),
                                     ('6110129009',
                                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                      'вязания, из пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                                     ('6110199009',
                                      'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного '
                                      'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных, для женщин '
                                      'или девочек'),
                                     ('6110201000',
                                      'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или '
                                      'высоким одинарным или двойным воротом из хлопчатобумажной пряжи, машинного или '
                                      'ручного вязания'),
                                     ('6110209900',
                                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                      'из хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного '
                                      'вязания'),
                                     ('6110301000',
                                      'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или '
                                      'высоким одинарным или двойным воротом, из химических нитей, машинного или '
                                      'ручного вязания'),
                                     ('6110309900',
                                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                      'из химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                     ('6110901000',
                                      'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                      'льняных волокон или волокна рами, машинного или ручного вязания'),
                                     ('6110909000',
                                      'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                      'из прочих текстильных материалов, машинного или ручного вязания'),
                                     ('6204310000',
                                      'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из '
                                      'тонкого волоса животных'),
                                     ('6204321000',
                                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                      'из хлопчатобумажной пряжи'),
                                     ('6204329000',
                                      'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                                     ('6204331000',
                                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                      'из синтетических нитей'),
                                     ('6204339000',
                                      'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                     ('6204391100',
                                      'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                      'из искусственных нитей'),
                                     ('6204391900',
                                      'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                                     ('6204399000',
                                      'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                      'материалов'))),
              'Жен.': (('6104320000',
                        '6104330000',
                        '6104390000',
                        '6110119000',
                        '6110129009',
                        '6110199009',
                        '6110201000',
                        '6110209900',
                        '6110301000',
                        '6110309900',
                        '6110901000',
                        '6110909000',
                        '6204310000',
                        '6204321000',
                        '6204329000',
                        '6204331000',
                        '6204339000',
                        '6204391100',
                        '6204391900',
                        '6204399000'),
                       (('6104320000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                         'машинного или ручного вязания'),
                        ('6104330000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                         'или ручного вязания'),
                        ('6104390000',
                         'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                         'машинного или ручного вязания'),
                        ('6110119000',
                         'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                         'шерстяной пряжи, машинного или ручного вязания'),
                        ('6110129009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из пряжи '
                         'из тонкого волоса кашмирской козы, для женщин или девочек'),
                        ('6110199009',
                         'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                        ('6110201000',
                         'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                         'или двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                        ('6110209900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                         'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                        ('6110301000',
                         'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                         'или двойным воротом, из химических нитей, машинного или ручного вязания'),
                        ('6110309900',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                         'нитей, для женщин или девочек, машинного или ручного вязания'),
                        ('6110901000',
                         'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                         'или волокна рами, машинного или ручного вязания'),
                        ('6110909000',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                         'текстильных материалов, машинного или ручного вязания'),
                        ('6204310000',
                         'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6204321000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'хлопчатобумажной пряжи'),
                        ('6204329000', 'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                        ('6204331000',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'синтетических нитей'),
                        ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                        ('6204391100',
                         'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                         'искусственных нитей'),
                        ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                        ('6204399000',
                         'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'))),
              'Муж.': (('6103310000',
                        '6103320000',
                        '6103330000',
                        '6103390000',
                        '6110201000',
                        '6110209100',
                        '6110301000',
                        '6110309100',
                        '6110901000',
                        '6110909000',
                        '6203310000',
                        '6203321000',
                        '6203329000',
                        '6203331000',
                        '6203339000',
                        '6203391100',
                        '6203391900',
                        '6203399000'),
                       (('6103310000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из '
                         'тонкого волоса животных, машинного или ручного вязания'),
                        ('6103320000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                        ('6103330000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из синтетических нитей'),
                        ('6103390000',
                         'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из прочих текстильных материалов'),
                        ('6110201000',
                         'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                         'или двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                        ('6110209100',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                         'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                        ('6110301000',
                         'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                         'или двойным воротом, из химических нитей, машинного или ручного вязания'),
                        ('6110309100',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                         'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                        ('6110901000',
                         'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                         'или волокна рами, машинного или ручного вязания'),
                        ('6110909000',
                         'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                         'текстильных материалов, машинного или ручного вязания'),
                        ('6203310000',
                         'Пиджаки и блайзеры мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                         'животных'),
                        ('6203321000',
                         'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                         'хлопчатобумажной пряжи'),
                        ('6203329000',
                         'Прочие пиджаки и блайзеры мужские или для мальчиков, из хлопчатобумажной пряжи'),
                        ('6203331000',
                         'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                         'синтетических нитей'),
                        ('6203339000', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из синтетических нитей'),
                        ('6203391100',
                         'Пиджаки и блайзеры производственные и профессиональные, мужские или для мальчиков, из '
                         'искусственных нитей'),
                        ('6203391900', 'Прочие пиджаки и блайзеры мужские или для мальчиков, из искусственных нитей'),
                        ('6203399000',
                         'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов'))),
              'Унисекс': (('6104320000',
                           '6104330000',
                           '6104390000',
                           '6110119000',
                           '6110129009',
                           '6110199009',
                           '6110201000',
                           '6110209900',
                           '6110301000',
                           '6110309900',
                           '6110901000',
                           '6110909000',
                           '6204310000',
                           '6204321000',
                           '6204329000',
                           '6204331000',
                           '6204339000',
                           '6204391100',
                           '6204391900',
                           '6204399000'),
                          (('6104320000',
                            'Жакеты и блайзеры, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                            'машинного или ручного вязания'),
                           ('6104330000',
                            'Жакеты и блайзеры, трикотажные, женские или для девочек, из синтетических нитей, '
                            'машинного или ручного вязания'),
                           ('6104390000',
                            'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                            'материалов, машинного или ручного вязания'),
                           ('6110119000',
                            'Прочие кардиганы, жилеты и аналогичные изделия трикотажные, для женщин или девочек, из '
                            'шерстяной пряжи, машинного или ручного вязания'),
                           ('6110129009',
                            'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                            'пряжи из тонкого волоса кашмирской козы, для женщин или девочек'),
                           ('6110199009',
                            'Кардиганы, жилеты и аналогичные изделия трикотажные машинного или ручного вязания, из '
                            'шерстяной пряжи или пряжи из тонкого волоса животных, для женщин или девочек'),
                           ('6110201000',
                            'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким '
                            'одинарным или двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                           ('6110209900',
                            'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                            'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                           ('6110301000',
                            'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким '
                            'одинарным или двойным воротом, из химических нитей, машинного или ручного вязания'),
                           ('6110309900',
                            'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                            'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                           ('6110901000',
                            'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                            'или волокна рами, машинного или ручного вязания'),
                           ('6110909000',
                            'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                            'текстильных материалов, машинного или ручного вязания'),
                           ('6204310000',
                            'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                            'животных'),
                           ('6204321000',
                            'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                            'хлопчатобумажной пряжи'),
                           ('6204329000',
                            'Прочие жакеты и блайзеры женские или для девочек, из хлопчатобумажной пряжи'),
                           ('6204331000',
                            'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                            'синтетических нитей'),
                           ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                           ('6204391100',
                            'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                            'искусственных нитей'),
                           ('6204391900', 'Прочие жакеты и блайзеры женские или для девочек, из искусственных нитей'),
                           ('6204399000',
                            'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов')))},
 'МАЙКА': {'Жен.': (('6109100000',
                     '6109902000',
                     '6109909000',
                     '6206100000',
                     '6206200000',
                     '6206300000',
                     '6206400000',
                     '6206901000',
                     '6206909000',
                     '6208910000',
                     '6208920000',
                     '6208990000'),
                    (('6109100000',
                      'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного вязания, '
                      'из хлопчатобумажной пряжи'),
                     ('6109902000',
                      'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного вязания, '
                      'из шерстяной пряжи или пряжи из тонкого волоса животных или из химических нитей'),
                     ('6109909000',
                      'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного вязания, '
                      'из прочих текстильных материалов'),
                     ('6206100000',
                      'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых отходов'),
                     ('6206200000',
                      'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных'),
                     ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                     ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                     ('6206901000',
                      'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                     ('6206909000',
                      'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов'),
                     ('6208910000',
                      'Майки и нательные фуфайки прочие, трусы, панталоны, пеньюары, купальные халаты, домашние халаты '
                      'и аналогичные изделия женские или для девочек, из хлопчатобумажной пряжи'),
                     ('6208920000',
                      'Майки и нательные фуфайки прочие, трусы, панталоны, пеньюары, купальные халаты, домашние халаты '
                      'и аналогичные изделия женские или для девочек, из химических нитей'),
                     ('6208990000',
                      'Майки и нательные фуфайки прочие, трусы, панталоны, пеньюары, купальные халаты, домашние халаты '
                      'и аналогичные изделия женские или для девочек, из прочих текстильных материалов         '
                      '<6206909000> Блузки, блузы и блузоны женские или для девочек, из прочих текстильных '
                      'материалов'))),
           'Муж.': (('6105100000',
                     '6105201000',
                     '6105209000',
                     '6105901000',
                     '6105909000',
                     '6205200000',
                     '6205300000',
                     '6205901000',
                     '6205908001',
                     '6205908009',
                     '6207910000',
                     '6207991000',
                     '6207999000'),
                    (('6105100000',
                      'Рубашки трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи, машинного или '
                      'ручного вязания'),
                     ('6105201000',
                      'Рубашки трикотажные, мужские или для мальчиков, из химических синтетических нитей, машинного '
                      'или ручного вязания'),
                     ('6105209000',
                      'Рубашки трикотажные, мужские или для мальчиков, из химических искусственных нитей, машинного '
                      'или ручного вязания'),
                     ('6105901000',
                      'Рубашки трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса '
                      'животных, машинного или ручного вязания'),
                     ('6105909000',
                      'Рубашки трикотажные, мужские или для мальчиков, из прочих текстильных материалов, машинного или '
                      'ручного вязания'),
                     ('6205200000', 'Рубашки мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6205300000', 'Рубашки мужские или для мальчиков, из химических нитей'),
                     ('6205901000', 'Рубашки мужские или для мальчиков, из льняных волокон или волокна рами'),
                     ('6205908001',
                      'Рубашки мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                     ('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'),
                     ('6207910000',
                      'Майки и нательные фуфайки прочие, купальные халаты, домашние халаты и аналогичные изделия '
                      'мужские или для мальчиков, из хлопчатобумажной пряжи'),
                     ('6207991000',
                      'Майки и нательные фуфайки прочие, купальные халаты, домашние халаты и аналогичные изделия '
                      'мужские или для мальчиков, из химических нитей'),
                     ('6207999000',
                      'Майки и нательные фуфайки прочие, купальные халаты, домашние халаты и аналогичные изделия '
                      'мужские или для мальчиков, из прочих текстильных материалов                               '
                      '<6205908009> Рубашки мужские или для мальчиков, из прочих текстильных материалов')))},
 'МАНТО': {'Без указания пола': (('4304000000', '6202200000'),
                                 (('4304000000', 'Мех искусственный и изделия из него'),
                                  ('6202200000',
                                   'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                   'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                   'из шерстяной пряжи или пряжи из тонкого волоса животных'))),
           'Жен.': (('4304000000', '6202200000'),
                    (('4304000000', 'Мех искусственный и изделия из него'),
                     ('6202200000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                      'пряжи из тонкого волоса животных'))),
           'Муж.': (('4304000000', '6201200000'),
                    (('4304000000', 'Мех искусственный и изделия из него'),
                     ('6201200000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                      'пряжи из тонкого волоса животных'))),
           'Унисекс': (('4304000000', '6202200000'),
                       (('4304000000', 'Мех искусственный и изделия из него'),
                        ('6202200000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных')))},
 'МОТОКУРТКА': {'Без указания пола': (('4203100001', '4203100009', '6101908000', '6102209000', '6102309000'),
                                      (('4203100001', '- -- из натуральной кожи'),
                                       ('4203100009', '- -- прочие'),
                                       ('6101908000',
                                        'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих '
                                        'текстильных материалов'),
                                       ('6102209000',
                                        'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские '
                                        'или для девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий '
                                        'товарной позиции 6104'),
                                       ('6102309000',
                                        'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские '
                                        'или для девочек из химических нитей, трикотажные, кроме изделий товарной '
                                        'позиции 6104'))),
                'Жен.': (('4203100001', '4203100009', '6102209000', '6102309000', '6102909000'),
                         (('4203100001', '- -- из натуральной кожи'),
                          ('4203100009', '- -- прочие'),
                          ('6102209000',
                           'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                           'из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                          ('6102309000',
                           'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                           'из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                          ('6102909000',
                           'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                           'из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'))),
                'Муж.': (('4203100001', '4203100009', '6101209000', '6101309000', '6101908000'),
                         (('4203100001', '- -- из натуральной кожи'),
                          ('4203100009', '- -- прочие'),
                          ('6101209000',
                           'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия из хлопчатобумажной '
                           'пряжи трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103'),
                          ('6101309000',
                           'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские или для '
                           'мальчиков из химических нитей, трикотажные, кроме изделий товарной позиции 6103'),
                          ('6101908000',
                           'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих текстильных '
                           'материалов'))),
                'Унисекс': (('4203100001', '4203100009', '6101908000', '6102209000', '6102309000'),
                            (('4203100001', '- -- из натуральной кожи'),
                             ('4203100009', '- -- прочие'),
                             ('6101908000',
                              'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих '
                              'текстильных материалов'),
                             ('6102209000',
                              'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                              'девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104'),
                             ('6102309000',
                              'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                              'девочек из химических нитей, трикотажные, кроме изделий товарной позиции 6104')))},
 'НАКИДКА': {'Без указания пола': (('4304000000', '6202200000'),
                                   (('4304000000', 'Мех искусственный и изделия из него'),
                                    ('6202200000',
                                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                     'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                     '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'))),
             'Жен.': (('4304000000', '6202200000'),
                      (('4304000000', 'Мех искусственный и изделия из него'),
                       ('6202200000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'шерстяной пряжи или пряжи из тонкого волоса животных'))),
             'Муж.': (('4304000000', '6201200000'),
                      (('4304000000', 'Мех искусственный и изделия из него'),
                       ('6201200000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                        'шерстяной пряжи или пряжи из тонкого волоса животных'))),
             'Унисекс': (('4304000000', '6202200000'),
                         (('4304000000', 'Мех искусственный и изделия из него'),
                          ('6202200000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                           'шерстяной пряжи или пряжи из тонкого волоса животных')))},
 'ПАЛЬТО': {'Без указания пола': (('6202300000', '6202900001'),
                                  (('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'),
                                   ('6202900001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов'))),
            'Жен.': (('6202300000', '6202900001'),
                     (('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'),
                      ('6202900001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов'))),
            'Муж.': (('6201200000', '6201900000'),
                     (('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'))),
            'Унисекс': (('6202300000', '6202900001'),
                        (('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6202900001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ПАРКА': {'Без указания пола': (('6202300000', '6202900001'),
                                 (('6202300000',
                                   'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                   'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                   'из хлопчатобумажной пряжи'),
                                  ('6202900001',
                                   'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                   'кроме изделий товарной позиции 6204, из прочих текстильных материалов'))),
           'Жен.': (('6202300000', '6202900001'),
                    (('6202300000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                      'пряжи'),
                     ('6202900001',
                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                      'товарной позиции 6204, из прочих текстильных материалов'))),
           'Муж.': (('6201200000', '6201900000'),
                    (('6201200000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                      'пряжи из тонкого волоса животных'),
                     ('6201900000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                      'материалов'))),
           'Унисекс': (('6202300000', '6202900001'),
                       (('6202300000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                         'хлопчатобумажной пряжи'),
                        ('6202900001',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ПИДЖАК': {'Без указания пола': (('6211490009',),
                                  (('6211490009',
                                    'Предметы одежды прочие женские или для девочек, из прочих текстильных '
                                    'материалов'),)),
            'Жен.': (('6211490009',),
                     (('6211490009',
                       'Предметы одежды прочие женские или для девочек, из прочих текстильных материалов'),)),
            'Муж.': (('6211390000',),
                     (('6211390000',
                       'Предметы одежды прочие мужские или для мальчиков, из прочих текстильных материалов'),)),
            'Унисекс': (('6211490009',),
                        (('6211490009',
                          'Предметы одежды прочие женские или для девочек, из прочих текстильных материалов'),))},
 'ПИХОРА': {'Без указания пола': (('6202300000', '6202900001'),
                                  (('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'),
                                   ('6202900001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов'))),
            'Жен.': (('6202300000', '6202900001'),
                     (('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'),
                      ('6202900001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов'))),
            'Муж.': (('6201200000', '6201900000'),
                     (('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'))),
            'Унисекс': (('6202300000', '6202900001'),
                        (('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6202900001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ПЛАТЬЕ': {'Без указания пола': (('6204499000',),
                                  (('6204499000',
                                    'Платья женские или для девочек, из прочих текстильных материалов'),)),
            'Жен.': (('6204499000',),
                     (('6204499000', 'Платья женские или для девочек, из прочих текстильных материалов'),)),
            'Унисекс': (('6204499000',),
                        (('6204499000', 'Платья женские или для девочек, из прочих текстильных материалов'),))},
 'ПЛАЩ': {'Без указания пола': (('6202300000', '6202900001'),
                                (('6202300000',
                                  'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                  'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                  'из хлопчатобумажной пряжи'),
                                 ('6202900001',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                  'кроме изделий товарной позиции 6204, из прочих текстильных материалов'))),
          'Жен.': (('6202300000', '6202900001'),
                   (('6202300000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной пряжи'),
                    ('6202900001',
                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                     'товарной позиции 6204, из прочих текстильных материалов'))),
          'Муж.': (('6201200000', '6201900000'),
                   (('6201200000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                     'пряжи из тонкого волоса животных'),
                    ('6201900000',
                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                     'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                     'материалов'))),
          'Унисекс': (('6202300000', '6202900001'),
                      (('6202300000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'хлопчатобумажной пряжи'),
                       ('6202900001',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ПОЛО': {'Без указания пола': (('6106909000',
                                 '6110201000',
                                 '6110301000',
                                 '6206200000',
                                 '6206300000',
                                 '6206400000',
                                 '6206901000',
                                 '6206909000'),
                                (('6106909000', '- -- из прочих текстильных материалов'),
                                 ('6110201000',
                                  'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким '
                                  'одинарным или двойным воротом из хлопчатобумажной пряжи, машинного или ручного '
                                  'вязания'),
                                 ('6110301000',
                                  'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким '
                                  'одинарным или двойным воротом, из химических нитей, машинного или ручного вязания'),
                                 ('6206200000',
                                  'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из '
                                  'тонкого волоса животных'),
                                 ('6206300000',
                                  'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                                 ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                                 ('6206901000',
                                  'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна '
                                  'рами'),
                                 ('6206909000',
                                  'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных '
                                  'материалов'))),
          'Жен.': (('6106909000',
                    '6110201000',
                    '6110301000',
                    '6206200000',
                    '6206300000',
                    '6206400000',
                    '6206901000',
                    '6206909000'),
                   (('6106909000', '- -- из прочих текстильных материалов'),
                    ('6110201000',
                     'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным или '
                     'двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                    ('6110301000',
                     'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным или '
                     'двойным воротом, из химических нитей, машинного или ручного вязания'),
                    ('6206200000',
                     'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                     'животных'),
                    ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                    ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                    ('6206901000',
                     'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                    ('6206909000',
                     'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов'))),
          'Муж.': (('6110201000', '6110301000', '6205200000', '6205300000', '6205901000', '6205908001', '6205908009'),
                   (('6110201000',
                     'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным или '
                     'двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                    ('6110301000',
                     'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным или '
                     'двойным воротом, из химических нитей, машинного или ручного вязания'),
                    ('6205200000', 'Рубашки мужские или для мальчиков, из хлопчатобумажной пряжи'),
                    ('6205300000', 'Рубашки мужские или для мальчиков, из химических нитей'),
                    ('6205901000', 'Рубашки мужские или для мальчиков, из льняных волокон или волокна рами'),
                    ('6205908001',
                     'Рубашки мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                    ('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'))),
          'Унисекс': (('6106909000',
                       '6110201000',
                       '6110301000',
                       '6206200000',
                       '6206300000',
                       '6206400000',
                       '6206901000',
                       '6206909000'),
                      (('6106909000', '- -- из прочих текстильных материалов'),
                       ('6110201000',
                        'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                        'или двойным воротом из хлопчатобумажной пряжи, машинного или ручного вязания'),
                       ('6110301000',
                        'Легкие тонкие джемперы и пуловеры трикотажной вязки с воротом "поло" или высоким одинарным '
                        'или двойным воротом, из химических нитей, машинного или ручного вязания'),
                       ('6206200000',
                        'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                        'волоса животных'),
                       ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                       ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                       ('6206901000',
                        'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                       ('6206909000',
                        'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов')))},
 'ПОЛУКОМБИНЕЗОН': {'Без указания пола': (('6204699000',),
                                          (('6204699000',
                                            'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или '
                                            'для девочек,из прочих текстильных материалов'),)),
                    'Жен.': (('6204699000',),
                             (('6204699000',
                               'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для девочек,из '
                               'прочих текстильных материалов'),)),
                    'Муж.': (('6103490009',),
                             (('6103490009',
                               'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                               'материалов, мужские или для мальчиков'),)),
                    'Унисекс': (('6204699000',),
                                (('6204699000',
                                  'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты женские или для '
                                  'девочек,из прочих текстильных материалов'),))},
 'ПОЛУПАЛЬТО': {'Без указания пола': (('6202300000', '6202900001'),
                                      (('6202300000',
                                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                        'штормовки и аналогичные изделия женские или для девочек, кроме изделий '
                                        'товарной позиции 6204, из хлопчатобумажной пряжи'),
                                       ('6202900001',
                                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                        'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                        'материалов'))),
                'Жен.': (('6202300000', '6202900001'),
                         (('6202300000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                           'хлопчатобумажной пряжи'),
                          ('6202900001',
                           'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                           'изделий товарной позиции 6204, из прочих текстильных материалов'))),
                'Муж.': (('6201200000', '6201900000'),
                         (('6201200000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                           'шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6201900000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                           'прочих текстильных материалов')))},
 'ПОЛУШУБОК': {'Без указания пола': (('4203100001',
                                      '4203100009',
                                      '4303109010',
                                      '4303109050',
                                      '4303109060',
                                      '4304000000',
                                      '6210500000'),
                                     (('4203100001', '- -- из натуральной кожи'),
                                      ('4203100009', '- - прочие'),
                                      ('4303109010', '- - - предметы одежды из норки'),
                                      ('4303109050', '- - - предметы одежды из енота'),
                                      ('4303109060', '- - - предметы одежды из овчины'),
                                      ('4304000000', 'Мех искусственный и изделия из него'),
                                      ('6210500000', '- кожзам')))},
 'ПОНЧО': {'Без указания пола': (('6202200000',),
                                 (('6202200000',
                                   'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                   'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                   'из шерстяной пряжи или пряжи из тонкого волоса животных'),)),
           'Жен.': (('6202200000',),
                    (('6202200000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                      'пряжи из тонкого волоса животных'),)),
           'Муж.': (('6201200000',),
                    (('6201200000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                      'пряжи из тонкого волоса животных'),))},
 'ПУЛОВЕР': {'Без указания пола': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                                   (('6110129001',
                                     'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного '
                                     'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                                     'девочек'),
                                    ('6110199001',
                                     'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                     'массой одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для '
                                     'женщин или девочек'),
                                    ('6110209900',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                    ('6110309900',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                    ('6110901000',
                                     'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'льняных волокон или волокна рами, машинного или ручного вязания'),
                                    ('6110909000',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'прочих текстильных материалов, машинного или ручного вязания'))),
             'Жен.': (('6110129001',
                       '6110199001',
                       '6110209900',
                       '6110309100',
                       '6110309900',
                       '6110901000',
                       '6110909000'),
                      (('6110129001',
                        'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                        'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                       ('6110199001',
                        'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                        'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                       ('6110209900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                       ('6110309100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110309900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для женщин или девочек, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания'))),
             'Муж.': (('6110121001', '6110191001', '6110209100', '6110309100', '6110901000', '6110909000'),
                      (('6110121001',
                        'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                        'или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                       ('6110191001',
                        'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                        'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                       ('6110209100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110309100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания'))),
             'Унисекс': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                         (('6110129001',
                           'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                           'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                          ('6110199001',
                           'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                           'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                          ('6110209900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                          ('6110309900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                          ('6110901000',
                           'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                           'или волокна рами, машинного или ручного вязания'),
                          ('6110909000',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                           'текстильных материалов, машинного или ручного вязания')))},
 'ПУХОВИК': {'Без указания пола': (('6202300000', '6202900001'),
                                   (('6202300000',
                                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                     'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                     '6204, из хлопчатобумажной пряжи'),
                                    ('6202900001',
                                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                     'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                     'материалов'))),
             'Жен.': (('6202300000', '6202900001'),
                      (('6202300000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'хлопчатобумажной пряжи'),
                       ('6202900001',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из прочих текстильных материалов'))),
             'Муж.': (('6201200000', '6201900000'),
                      (('6201200000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                        'шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6201900000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих '
                        'текстильных материалов'))),
             'Унисекс': (('6202300000', '6202900001'),
                         (('6202300000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                           'хлопчатобумажной пряжи'),
                          ('6202900001',
                           'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                           'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ПЫЛЬНИК': {'Без указания пола': (('6202300000', '6202400009', '6202900001'),
                                   (('6202300000',
                                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                     'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                     '6204, из хлопчатобумажной пряжи'),
                                    ('6202400009',
                                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                     'девочек, кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                    ('6202900001',
                                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                     'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                     'материалов'))),
             'Жен.': (('6202300000', '6202400009', '6202900001'),
                      (('6202300000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'хлопчатобумажной пряжи'),
                       ('6202400009',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из химических нитей, прочие'),
                       ('6202900001',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из прочих текстильных материалов'))),
             'Муж.': (('6201300000', '6201400000', '6201900000'),
                      (('6201300000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                        'хлопчатобумажной пряжи'),
                       ('6201400000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                        'химических нитей'),
                       ('6201900000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих '
                        'текстильных материалов'))),
             'Унисекс': (('4203100001', '6202300000', '6202400009', '6202900001'),
                         (('4203100001', '- -- из натуральной кожи'),
                          ('6202300000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                           'хлопчатобумажной пряжи'),
                          ('6202400009',
                           'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                           'изделий товарной позиции 6204, из химических нитей, прочие'),
                          ('6202900001',
                           'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                           'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'РАСПАШОНКА': {'Без указания пола': (('6111209000', '6111309000', '6111909000'),
                                      (('6111209000',
                                        'ПРОЧАЯ ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ТРИКОТАЖНЫЕ, ИЗ ХЛОПЧАТОБУМАЖНОЙ '
                                        'ПРЯЖИ, МАШИННОГО ИЛИ РУЧНОГО '
                                        'ВЯЗАНИЯ                                                                                                                                                                                      '
                                        '6209200000 ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ИЗ ХЛОПЧАТОБУМАЖНОЙ ПРЯЖИ'),
                                       ('6111309000',
                                        'ПРОЧАЯ ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ТРИКОТАЖНЫЕ ИЗ СИНТЕТИЧЕСКИХ '
                                        'НИТЕЙ, МАШИННОГО ИЛИ РУЧНОГО '
                                        'ВЯЗАНИЯ                                                                                                                                                                                                      '
                                        '6209300000 ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ИЗ СИНТЕТИЧЕСКИХ НИТЕЙ'),
                                       ('6111909000',
                                        'ПРОЧАЯ ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ТРИКОТАЖНЫЕ ИЗ ПРОЧИХ '
                                        'ТЕКСТИЛЬНЫХ МАТЕРИАЛОВ, МАШИННОГО ИЛИ РУЧНОГО '
                                        'ВЯЗАНИЯ                                                                                                                 '
                                        '6209909000 ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ИЗ ПРОЧИХ ТЕКСТИЛЬНЫХ '
                                        'МАТЕРИАЛОВ')))},
 'РУБАШЕЧКА ДЛЯ НОВОРОЖДЕННЫХ': {'Без указания пола': (('6111209000', '6111309000', '6111909000'),
                                                       (('6111209000',
                                                         'ПРОЧАЯ ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ТРИКОТАЖНЫЕ, ИЗ '
                                                         'ХЛОПЧАТОБУМАЖНОЙ ПРЯЖИ, МАШИННОГО ИЛИ РУЧНОГО '
                                                         'ВЯЗАНИЯ                                                                                                                                                                                      '
                                                         '6209200000 ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ИЗ '
                                                         'ХЛОПЧАТОБУМАЖНОЙ ПРЯЖИ'),
                                                        ('6111309000',
                                                         'ПРОЧАЯ ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ТРИКОТАЖНЫЕ ИЗ '
                                                         'СИНТЕТИЧЕСКИХ НИТЕЙ, МАШИННОГО ИЛИ РУЧНОГО '
                                                         'ВЯЗАНИЯ                                                                                                                                                                                                      '
                                                         '6209300000 ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ИЗ '
                                                         'СИНТЕТИЧЕСКИХ НИТЕЙ'),
                                                        ('6111909000',
                                                         'ПРОЧАЯ ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ТРИКОТАЖНЫЕ ИЗ '
                                                         'ПРОЧИХ ТЕКСТИЛЬНЫХ МАТЕРИАЛОВ, МАШИННОГО ИЛИ РУЧНОГО '
                                                         'ВЯЗАНИЯ                                                                                                                 '
                                                         '6209909000 ДЕТСКАЯ ОДЕЖДА И ПРИНАДЛЕЖНОСТИ К НЕЙ ИЗ ПРОЧИХ '
                                                         'ТЕКСТИЛЬНЫХ МАТЕРИАЛОВ')))},
 'РУБАШКА': {'Без указания пола': (('6106909000', '6206200000', '6206300000', '6206400000', '6206901000', '6206909000'),
                                   (('6106909000', '- -- из прочих текстильных материалов'),
                                    ('6206200000',
                                     'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из '
                                     'тонкого волоса животных'),
                                    ('6206300000',
                                     'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                                    ('6206400000',
                                     'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                                    ('6206901000',
                                     'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна '
                                     'рами'),
                                    ('6206909000',
                                     'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных '
                                     'материалов'))),
             'Жен.': (('6106909000', '6206200000', '6206300000', '6206400000', '6206901000', '6206909000'),
                      (('6106909000', '- -- из прочих текстильных материалов'),
                       ('6206200000',
                        'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                        'волоса животных'),
                       ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                       ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                       ('6206901000',
                        'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами'),
                       ('6206909000',
                        'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов'))),
             'Муж.': (('6205200000', '6205300000', '6205901000', '6205908001', '6205908009'),
                      (('6205200000', 'Рубашки мужские или для мальчиков, из хлопчатобумажной пряжи'),
                       ('6205300000', 'Рубашки мужские или для мальчиков, из химических нитей'),
                       ('6205901000', 'Рубашки мужские или для мальчиков, из льняных волокон или волокна рами'),
                       ('6205908001',
                        'Рубашки мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'))),
             'Унисекс': (('6106909000', '6205908009', '6206200000', '6206300000', '6206400000', '6206901000'),
                         (('6106909000', '- -- из прочих текстильных материалов'),
                          ('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'),
                          ('6206200000',
                           'Блузки, блузы и блузоны женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                           'волоса животных'),
                          ('6206300000', 'Блузки, блузы и блузоны женские или для девочек, из хлопчатобумажной пряжи'),
                          ('6206400000', 'Блузки, блузы и блузоны женские или для девочек, из химических нитей'),
                          ('6206901000',
                           'Блузки, блузы и блузоны женские или для девочек, из льняных волокон или волокна рами')))},
 'СВИТЕР': {'Без указания пола': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                                  (('6110129001',
                                    'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного '
                                    'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                                    'девочек'),
                                   ('6110199001',
                                    'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                    'массой одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для '
                                    'женщин или девочек'),
                                   ('6110209900',
                                    'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                    'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                   ('6110309900',
                                    'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                    'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                   ('6110901000',
                                    'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                                    'волокон или волокна рами, машинного или ручного вязания'),
                                   ('6110909000',
                                    'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                    'прочих текстильных материалов, машинного или ручного вязания'))),
            'Жен.': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                     (('6110129001',
                       'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г или '
                       'более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                      ('6110199001',
                       'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                       'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                      ('6110209900',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                       'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                      ('6110309900',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                       'нитей, для женщин или девочек, машинного или ручного вязания'),
                      ('6110901000',
                       'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                       'волокна рами, машинного или ручного вязания'),
                      ('6110909000',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                       'текстильных материалов, машинного или ручного вязания'))),
            'Муж.': (('6110121001', '6110191001', '6110209100', '6110309100', '6110901000', '6110909000'),
                     (('6110121001',
                       'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г или '
                       'более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                      ('6110191001',
                       'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                       'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                      ('6110209100',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                       'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                      ('6110309100',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                       'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                      ('6110901000',
                       'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                       'волокна рами, машинного или ручного вязания'),
                      ('6110909000',
                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                       'текстильных материалов, машинного или ручного вязания'))),
            'Унисекс': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                        (('6110129001',
                          'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                          'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                         ('6110199001',
                          'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                          'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                         ('6110209900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                          'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                         ('6110309900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                          'нитей, для женщин или девочек, машинного или ручного вязания'),
                         ('6110901000',
                          'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                          'или волокна рами, машинного или ручного вязания'),
                         ('6110909000',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                          'текстильных материалов, машинного или ручного вязания')))},
 'СВИТШОТ': {'Без указания пола': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                                   (('6110129001',
                                     'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного '
                                     'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                                     'девочек'),
                                    ('6110199001',
                                     'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                     'массой одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для '
                                     'женщин или девочек'),
                                    ('6110209900',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                    ('6110309900',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                    ('6110901000',
                                     'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'льняных волокон или волокна рами, машинного или ручного вязания'),
                                    ('6110909000',
                                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                     'прочих текстильных материалов, машинного или ручного вязания'))),
             'Жен.': (('6110129001',
                       '6110199001',
                       '6110209900',
                       '6110309100',
                       '6110309900',
                       '6110901000',
                       '6110909000'),
                      (('6110129001',
                        'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                        'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                       ('6110199001',
                        'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                        'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                       ('6110209900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                       ('6110309100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110309900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для женщин или девочек, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания'))),
             'Муж.': (('6110121001', '6110191001', '6110209100', '6110309100', '6110901000', '6110909000'),
                      (('6110121001',
                        'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                        'или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                       ('6110191001',
                        'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                        'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                       ('6110209100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110309100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания'))),
             'Унисекс': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                         (('6110129001',
                           'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                           'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                          ('6110199001',
                           'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                           'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                          ('6110209900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                          ('6110309900',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                           'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                          ('6110901000',
                           'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                           'или волокна рами, машинного или ручного вязания'),
                          ('6110909000',
                           'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                           'текстильных материалов, машинного или ручного вязания')))},
 'СМОКИНГ': {'Без указания пола': (('4203100001',
                                    '4203100009',
                                    '6104390000',
                                    '6204310000',
                                    '6204321000',
                                    '6204339000',
                                    '6204399000'),
                                   (('4203100001', '- -- из натуральной кожи'),
                                    ('4203100009', '- -- прочие'),
                                    ('6104390000',
                                     'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                                     'материалов, машинного или ручного вязания'),
                                    ('6204310000',
                                     'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из '
                                     'тонкого волоса животных'),
                                    ('6204321000',
                                     'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                     'из хлопчатобумажной пряжи'),
                                    ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                    ('6204399000',
                                     'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                     'материалов'))),
             'Жен.': (('4203100001',
                       '4203100009',
                       '6104390000',
                       '6204310000',
                       '6204321000',
                       '6204339000',
                       '6204399000'),
                      (('4203100001', '- -- из натуральной кожи'),
                       ('4203100009', '- -- прочие'),
                       ('6104390000',
                        'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                        'машинного или ручного вязания'),
                       ('6204310000',
                        'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                        'животных'),
                       ('6204321000',
                        'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                        'хлопчатобумажной пряжи'),
                       ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                       ('6204399000',
                        'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'))),
             'Муж.': (('4203100001', '4203100009', '6103310000', '6103320000', '6103330000', '6203399000'),
                      (('4203100001', '- -- из натуральной кожи'),
                       ('4203100009', '- -- прочие'),
                       ('6103310000',
                        'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из '
                        'тонкого волоса животных, машинного или ручного вязания'),
                       ('6103320000',
                        'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                       ('6103330000',
                        'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из синтетических нитей'),
                       ('6203399000',
                        'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов'))),
             'Унисекс': (('4203100001',
                          '4203100009',
                          '6104390000',
                          '6204310000',
                          '6204321000',
                          '6204339000',
                          '6204399000'),
                         (('4203100001', '- -- из натуральной кожи'),
                          ('4203100009', '- -- прочие'),
                          ('6104390000',
                           'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                           'машинного или ручного вязания'),
                          ('6204310000',
                           'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                           'животных'),
                          ('6204321000',
                           'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                           'хлопчатобумажной пряжи'),
                          ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                          ('6204399000',
                           'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов')))},
 'СПОРТИВНЫЙ ПИДЖАК': {'Без указания пола': (('6206909000', '6211424100', '6211434100'),
                                             (('6206909000',
                                               'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных '
                                               'материалов'),
                                              ('6211424100',
                                               'Верхние части спортивных костюмов с подкладкой женские или для '
                                               'девочек, из хлопчатобумажной пряжи'),
                                              ('6211434100',
                                               'Верхние части спортивных костюмов с подкладкой женские или для '
                                               'девочек, из химических нитей'))),
                       'Жен.': (('6206909000', '6211424100', '6211434100'),
                                (('6206909000',
                                  'Блузки, блузы и блузоны женские или для девочек, из прочих текстильных материалов'),
                                 ('6211424100',
                                  'Верхние части спортивных костюмов с подкладкой женские или для девочек, из '
                                  'хлопчатобумажной пряжи'),
                                 ('6211434100',
                                  'Верхние части спортивных костюмов с подкладкой женские или для девочек, из '
                                  'химических нитей'))),
                       'Муж.': (('6205908009', '6211324100', '6211334100'),
                                (('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'),
                                 ('6211324100',
                                  'Верхние части спортивных костюмов с подкладкой мужские или для мальчиков, из '
                                  'хлопчатобумажной пряжи'),
                                 ('6211334100',
                                  'Верхние части спортивных костюмов с подкладкой мужские или для мальчиков, из '
                                  'химических нитей'))),
                       'Унисекс': (('6205908009', '6211424100', '6211434100'),
                                   (('6205908009',
                                     'Рубашки мужские или для мальчиков, из прочих текстильных материалов'),
                                    ('6211424100',
                                     'Верхние части спортивных костюмов с подкладкой женские или для девочек, из '
                                     'хлопчатобумажной пряжи'),
                                    ('6211434100',
                                     'Верхние части спортивных костюмов с подкладкой женские или для девочек, из '
                                     'химических нитей')))},
 'СЮРТУК': {'Без указания пола': (('4203100001',
                                   '4203100009',
                                   '6104390000',
                                   '6204310000',
                                   '6204321000',
                                   '6204339000',
                                   '6204399000'),
                                  (('4203100001', '- -- из натуральной кожи'),
                                   ('4203100009', '- -- прочие'),
                                   ('6104390000',
                                    'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных '
                                    'материалов, машинного или ручного вязания'),
                                   ('6204310000',
                                    'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из '
                                    'тонкого волоса животных'),
                                   ('6204321000',
                                    'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, '
                                    'из хлопчатобумажной пряжи'),
                                   ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                                   ('6204399000',
                                    'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных '
                                    'материалов'))),
            'Жен.': (('4203100001', '4203100009', '6104390000', '6204310000', '6204321000', '6204339000', '6204399000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('4203100009', '- -- прочие'),
                      ('6104390000',
                       'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                       'машинного или ручного вязания'),
                      ('6204310000',
                       'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                       'животных'),
                      ('6204321000',
                       'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                       'хлопчатобумажной пряжи'),
                      ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                      ('6204399000',
                       'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов'))),
            'Муж.': (('4203100001', '4203100009', '6103310000', '6103320000', '6103330000', '6203399000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('4203100009', '- -- прочие'),
                      ('6103310000',
                       'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из шерстяной пряжи или пряжи из '
                       'тонкого волоса животных, машинного или ручного вязания'),
                      ('6103320000',
                       'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6103330000',
                       'Пиджаки и блайзеры трикотажные, мужские или для мальчиков, из синтетических нитей'),
                      ('6203399000', 'Пиджаки и блайзеры мужские или для мальчиков из прочих текстильных материалов'))),
            'Унисекс': (('4203100001',
                         '4203100009',
                         '6104390000',
                         '6204310000',
                         '6204321000',
                         '6204339000',
                         '6204399000'),
                        (('4203100001', '- -- из натуральной кожи'),
                         ('4203100009', '- -- прочие'),
                         ('6104390000',
                          'Жакеты и блайзеры, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                          'машинного или ручного вязания'),
                         ('6204310000',
                          'Жакеты и блайзеры женские или для девочек, из шерстяной пряжи или пряжи из тонкого волоса '
                          'животных'),
                         ('6204321000',
                          'Жакеты и блайзеры женские или для девочек, производственные и профессиональные, из '
                          'хлопчатобумажной пряжи'),
                         ('6204339000', 'Жакеты и блайзеры женские или для девочек, из синтетических нитей'),
                         ('6204399000',
                          'Прочие жакеты и блайзеры женские или для девочек, из прочих текстильных материалов')))},
 'ТЕЛЬНЯШКА': {'Без указания пола': (('6106100000',
                                      '6106200000',
                                      '6106901000',
                                      '6106903000',
                                      '6106905000',
                                      '6106909000'),
                                     (('6106100000', '- - из хлопчатобумажной пряжи'),
                                      ('6106200000', '- - из химических нитей'),
                                      ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                      ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                                      ('6106905000', '- -- из льняных волокон или волокна рами'),
                                      ('6106909000', '- -- из прочих текстильных материалов'))),
               'Жен.': (('6106909000',), (('6106909000', '- -- из прочих текстильных материалов'),)),
               'Муж.': (('6106909000', '6205200000', '6205300000', '6205901000', '6205908001', '6205908009'),
                        (('6106909000', '- -- из прочих текстильных материалов'),
                         ('6205200000', 'Рубашки мужские или для мальчиков, из хлопчатобумажной пряжи'),
                         ('6205300000', 'Рубашки мужские или для мальчиков, из химических нитей'),
                         ('6205901000', 'Рубашки мужские или для мальчиков, из льняных волокон или волокна рами'),
                         ('6205908001',
                          'Рубашки мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'))),
               'Унисекс': (('6106100000', '6106200000', '6106901000', '6106903000', '6106905000', '6106909000'),
                           (('6106100000', '- - из хлопчатобумажной пряжи'),
                            ('6106200000', '- - из химических нитей'),
                            ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                            ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                            ('6106905000', '- -- из льняных волокон или волокна рами'),
                            ('6106909000', '- -- из прочих текстильных материалов')))},
 'ТЕННИСКА': {'Без указания пола': (('6106100000',
                                     '6106200000',
                                     '6106901000',
                                     '6106903000',
                                     '6106905000',
                                     '6106909000'),
                                    (('6106100000', '- - из хлопчатобумажной пряжи'),
                                     ('6106200000', '- - из химических нитей'),
                                     ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                     ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                                     ('6106905000', '- -- из льняных волокон или волокна рами'),
                                     ('6106909000', '- -- из прочих текстильных материалов'))),
              'Жен.': (('6106909000',), (('6106909000', '- -- из прочих текстильных материалов'),)),
              'Муж.': (('6106909000', '6205200000', '6205300000', '6205901000', '6205908001', '6205908009'),
                       (('6106909000', '- -- из прочих текстильных материалов'),
                        ('6205200000', 'Рубашки мужские или для мальчиков, из хлопчатобумажной пряжи'),
                        ('6205300000', 'Рубашки мужские или для мальчиков, из химических нитей'),
                        ('6205901000', 'Рубашки мужские или для мальчиков, из льняных волокон или волокна рами'),
                        ('6205908001',
                         'Рубашки мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                        ('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'))),
              'Унисекс': (('6106100000', '6106200000', '6106901000', '6106903000', '6106905000', '6106909000'),
                          (('6106100000', '- - из хлопчатобумажной пряжи'),
                           ('6106200000', '- - из химических нитей'),
                           ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                           ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                           ('6106905000', '- -- из льняных волокон или волокна рами'),
                           ('6106909000', '- -- из прочих текстильных материалов')))},
 'ТОЛСТОВКА': {'Без указания пола': (('6110129001',
                                      '6110199001',
                                      '6110209900',
                                      '6110309900',
                                      '6110901000',
                                      '6110909000'),
                                     (('6110129001',
                                       'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного '
                                       'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                                       'девочек'),
                                      ('6110199001',
                                       'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                       'массой одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, '
                                       'для женщин или девочек'),
                                      ('6110209900',
                                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                       'из хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного '
                                       'вязания'),
                                      ('6110309900',
                                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                       'из химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                      ('6110901000',
                                       'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                       'льняных волокон или волокна рами, машинного или ручного вязания'),
                                      ('6110909000',
                                       'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, '
                                       'из прочих текстильных материалов, машинного или ручного вязания'))),
               'Жен.': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                        (('6110129001',
                          'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                          'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                         ('6110199001',
                          'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                          'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                         ('6110209900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                          'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                         ('6110309900',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                          'нитей, для женщин или девочек, машинного или ручного вязания'),
                         ('6110901000',
                          'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                          'или волокна рами, машинного или ручного вязания'),
                         ('6110909000',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                          'текстильных материалов, машинного или ручного вязания'))),
               'Муж.': (('6110121001', '6110191001', '6110209100', '6110309100', '6110901000', '6110909000'),
                        (('6110121001',
                          'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                          'или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                         ('6110191001',
                          'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                          'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                         ('6110209100',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                          'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                         ('6110309100',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                          'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                         ('6110901000',
                          'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон '
                          'или волокна рами, машинного или ручного вязания'),
                         ('6110909000',
                          'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                          'текстильных материалов, машинного или ручного вязания'))),
               'Унисекс': (('6110129001', '6110199001', '6110209900', '6110309900', '6110901000', '6110909000'),
                           (('6110129001',
                             'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 '
                             'г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                            ('6110199001',
                             'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой '
                             'одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                             'девочек'),
                            ('6110209900',
                             'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                             'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                            ('6110309900',
                             'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                             'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                            ('6110901000',
                             'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                             'волокон или волокна рами, машинного или ручного вязания'),
                            ('6110909000',
                             'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                             'текстильных материалов, машинного или ручного вязания')))},
 'ТОП': {'Без указания пола': (('6109100000', '6109902000'),
                               (('6109100000',
                                 'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или '
                                 'ручного вязания, из хлопчатобумажной пряжи'),
                                ('6109902000',
                                 'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или '
                                 'ручного вязания, из шерстяной пряжи или пряжи из тонкого волоса животных или из '
                                 'химических нитей'))),
         'Жен.': (('6109100000', '6109902000', '6206100000'),
                  (('6109100000',
                    'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного вязания, '
                    'из хлопчатобумажной пряжи'),
                   ('6109902000',
                    'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного вязания, '
                    'из шерстяной пряжи или пряжи из тонкого волоса животных или из химических нитей'),
                   ('6206100000',
                    'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых отходов'))),
         'Муж.': (('6106903000', '6109100000', '6109902000'),
                  (('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                   ('6109100000',
                    'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного вязания, '
                    'из хлопчатобумажной пряжи'),
                   ('6109902000',
                    'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного вязания, '
                    'из шерстяной пряжи или пряжи из тонкого волоса животных или из химических нитей'))),
         'Унисекс': (('6109100000', '6109902000'),
                     (('6109100000',
                       'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                       'вязания, из хлопчатобумажной пряжи'),
                      ('6109902000',
                       'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                       'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных или из химических нитей')))},
 'ТРЕНЧ': {'Без указания пола': (('4203100001', '6202300000', '6202400009', '6202900001'),
                                 (('4203100001', '- -- из натуральной кожи'),
                                  ('6202300000',
                                   'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                   'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                   'из хлопчатобумажной пряжи'),
                                  ('6202400009',
                                   'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                   'кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                  ('6202900001',
                                   'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                   'кроме изделий товарной позиции 6204, из прочих текстильных материалов'))),
           'Жен.': (('6202300000', '6202400009', '6202900001'),
                    (('6202300000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                      'пряжи'),
                     ('6202400009',
                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                      'товарной позиции 6204, из химических нитей, прочие'),
                     ('6202900001',
                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                      'товарной позиции 6204, из прочих текстильных материалов'))),
           'Муж.': (('6201300000', '6201400000', '6201900000'),
                    (('6201300000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                      'пряжи'),
                     ('6201400000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                     ('6201900000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                      'материалов'))),
           'Унисекс': (('4203100001', '6202300000', '6202400009', '6202900001'),
                       (('4203100001', '- -- из натуральной кожи'),
                        ('6202300000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                         'хлопчатобумажной пряжи'),
                        ('6202400009',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из химических нитей, прочие'),
                        ('6202900001',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ТУЛУП': {'Без указания пола': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                                 (('4203100001', '- -- из натуральной кожи'),
                                  ('6202200000',
                                   'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                   'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                   'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                  ('6202300000',
                                   'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                   'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                   'из хлопчатобумажной пряжи'),
                                  ('6202400009',
                                   'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                   'кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                  ('6202900001',
                                   'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                   'кроме изделий товарной позиции 6204, из прочих текстильных материалов'))),
           'Жен.': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                    (('4203100001', '- -- из натуральной кожи'),
                     ('6202200000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                      'пряжи из тонкого волоса животных'),
                     ('6202300000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                      'пряжи'),
                     ('6202400009',
                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                      'товарной позиции 6204, из химических нитей, прочие'),
                     ('6202900001',
                      'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме изделий '
                      'товарной позиции 6204, из прочих текстильных материалов'))),
           'Муж.': (('4203100001', '6201200000', '6201300000', '6201400000', '6201900000'),
                    (('4203100001', '- -- из натуральной кожи'),
                     ('6201200000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                      'пряжи из тонкого волоса животных'),
                     ('6201300000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                      'пряжи'),
                     ('6201400000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                     ('6201900000',
                      'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                      'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                      'материалов'))),
           'Унисекс': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                       (('4203100001', '- -- из натуральной кожи'),
                        ('6202200000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                         'шерстяной пряжи или пряжи из тонкого волоса животных'),
                        ('6202300000',
                         'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                         'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                         'хлопчатобумажной пряжи'),
                        ('6202400009',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из химических нитей, прочие'),
                        ('6202900001',
                         'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                         'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ТУНИКА': {'Без указания пола': (('6106100000', '6106200000', '6106901000', '6106903000', '6106905000', '6106909000'),
                                  (('6106100000', '- - из хлопчатобумажной пряжи'),
                                   ('6106200000', '- - из химических нитей'),
                                   ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                                   ('6106905000', '- -- из льняных волокон или волокна рами'),
                                   ('6106909000', '- -- из прочих текстильных материалов'))),
            'Жен.': (('6106909000',), (('6106909000', '- -- из прочих текстильных материалов'),)),
            'Муж.': (('6106909000', '6205200000', '6205300000', '6205901000', '6205908001', '6205908009'),
                     (('6106909000', '- -- из прочих текстильных материалов'),
                      ('6205200000', 'Рубашки мужские или для мальчиков, из хлопчатобумажной пряжи'),
                      ('6205300000', 'Рубашки мужские или для мальчиков, из химических нитей'),
                      ('6205901000', 'Рубашки мужские или для мальчиков, из льняных волокон или волокна рами'),
                      ('6205908001',
                       'Рубашки мужские или для мальчиков, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                      ('6205908009', 'Рубашки мужские или для мальчиков, из прочих текстильных материалов'))),
            'Унисекс': (('6106100000', '6106200000', '6106901000', '6106903000', '6106905000', '6106909000'),
                        (('6106100000', '- - из хлопчатобумажной пряжи'),
                         ('6106200000', '- - из химических нитей'),
                         ('6106901000', '- -- из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                         ('6106905000', '- -- из льняных волокон или волокна рами'),
                         ('6106909000', '- -- из прочих текстильных материалов')))},
 'ФРЕНЧ': {'Без указания пола': (('6211490009',),
                                 (('6211490009',
                                   'Предметы одежды прочие женские или для девочек, из прочих текстильных '
                                   'материалов'),)),
           'Жен.': (('6211490009',),
                    (('6211490009',
                      'Предметы одежды прочие женские или для девочек, из прочих текстильных материалов'),)),
           'Муж.': (('6211390000',),
                    (('6211390000',
                      'Предметы одежды прочие мужские или для мальчиков, из прочих текстильных материалов'),)),
           'Унисекс': (('6211490009',),
                       (('6211490009',
                         'Предметы одежды прочие женские или для девочек, из прочих текстильных материалов'),))},
 'ФУТБОЛКА': {'Без указания пола': (('6109100000', '6109902000', '6206100000'),
                                    (('6109100000',
                                      'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или '
                                      'ручного вязания, из хлопчатобумажной пряжи'),
                                     ('6109902000',
                                      'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или '
                                      'ручного вязания, из шерстяной пряжи или пряжи из тонкого волоса животных или из '
                                      'химических нитей'),
                                     ('6206100000',
                                      'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из '
                                      'шелковых отходов'))),
              'Жен.': (('6109100000', '6109902000', '6206100000'),
                       (('6109100000',
                         'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                         'вязания, из хлопчатобумажной пряжи'),
                        ('6109902000',
                         'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                         'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных или из химических нитей'),
                        ('6206100000',
                         'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых '
                         'отходов'))),
              'Муж.': (('6105201000', '6106903000', '6109100000', '6109902000'),
                       (('6105201000',
                         'Рубашки трикотажные, мужские или для мальчиков, из химических синтетических нитей, машинного '
                         'или ручного вязания'),
                        ('6106903000', '- -- из шелковых нитей или из пряжи из шелковых отходов'),
                        ('6109100000',
                         'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                         'вязания, из хлопчатобумажной пряжи'),
                        ('6109902000',
                         'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                         'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных или из химических нитей'))),
              'Унисекс': (('6109100000', '6109902000', '6206100000'),
                          (('6109100000',
                            'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                            'вязания, из хлопчатобумажной пряжи'),
                           ('6109902000',
                            'Майки, фуфайки с рукавами и прочие нательные фуфайки трикотажные машинного или ручного '
                            'вязания, из шерстяной пряжи или пряжи из тонкого волоса животных или из химических нитей'),
                           ('6206100000',
                            'Блузки, блузы блузоны женские или для девочек, из шелковых нитей или пряжи из шелковых '
                            'отходов')))},
 'ФУФАЙКА': {'Без указания пола': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                                   (('4203100001', '- -- из натуральной кожи'),
                                    ('6202200000',
                                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                     'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                     '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                    ('6202300000',
                                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                     'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                     '6204, из хлопчатобумажной пряжи'),
                                    ('6202400009',
                                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                     'девочек, кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                    ('6202900001',
                                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                     'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                     'материалов'))),
             'Жен.': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                      (('4203100001', '- -- из натуральной кожи'),
                       ('6202200000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6202300000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                        'хлопчатобумажной пряжи'),
                       ('6202400009',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из химических нитей, прочие'),
                       ('6202900001',
                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                        'изделий товарной позиции 6204, из прочих текстильных материалов'))),
             'Муж.': (('4203100001', '6201200000', '6201300000', '6201400000', '6201900000'),
                      (('4203100001', '- -- из натуральной кожи'),
                       ('6201200000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                        'шерстяной пряжи или пряжи из тонкого волоса животных'),
                       ('6201300000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                        'хлопчатобумажной пряжи'),
                       ('6201400000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                        'химических нитей'),
                       ('6201900000',
                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                        'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих '
                        'текстильных материалов'))),
             'Унисекс': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                         (('4203100001', '- -- из натуральной кожи'),
                          ('6202200000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                           'шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6202300000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                           'хлопчатобумажной пряжи'),
                          ('6202400009',
                           'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                           'изделий товарной позиции 6204, из химических нитей, прочие'),
                          ('6202900001',
                           'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                           'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ХАЛАТ МЕДИЦИНСКИЙ': {'Без указания пола': (('6202300000', '6202900001', '6211490009'),
                                             (('6202300000',
                                               'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                               'штормовки и аналогичные изделия женские или для девочек, кроме изделий '
                                               'товарной позиции 6204, из хлопчатобумажной пряжи'),
                                              ('6202900001',
                                               'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или '
                                               'для девочек, кроме изделий товарной позиции 6204, из прочих '
                                               'текстильных материалов'),
                                              ('6211490009',
                                               'Предметы одежды прочие женские или для девочек, из прочих текстильных '
                                               'материалов'))),
                       'Жен.': (('6202300000', '6202900001', '6211490009'),
                                (('6202300000',
                                  'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                  'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, '
                                  'из хлопчатобумажной пряжи'),
                                 ('6202900001',
                                  'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                  'кроме изделий товарной позиции 6204, из прочих текстильных материалов'),
                                 ('6211490009',
                                  'Предметы одежды прочие женские или для девочек, из прочих текстильных материалов'))),
                       'Муж.': (('6114900000', '6201200000', '6201900000', '6211390000'),
                                (('6114900000',
                                  'Предметы одежды прочие трикотажные машинного или ручного вязания, из прочих '
                                  'текстильных материалов'),
                                 ('6201200000',
                                  'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                  'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, '
                                  'из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                 ('6201900000',
                                  'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                                  'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, '
                                  'из прочих текстильных материалов'),
                                 ('6211390000',
                                  'Предметы одежды прочие мужские или для мальчиков, из прочих текстильных '
                                  'материалов'))),
                       'Унисекс': (('6202300000', '6202900001', '6211490009'),
                                   (('6202300000',
                                     'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                     'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                     '6204, из хлопчатобумажной пряжи'),
                                    ('6202900001',
                                     'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                     'девочек, кроме изделий товарной позиции 6204, из прочих текстильных материалов'),
                                    ('6211490009',
                                     'Предметы одежды прочие женские или для девочек, из прочих текстильных '
                                     'материалов')))},
 'ХАРРИНГТОН': {'Без указания пола': (('6202300000', '6202900001'),
                                      (('6202300000',
                                        'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                                        'штормовки и аналогичные изделия женские или для девочек, кроме изделий '
                                        'товарной позиции 6204, из хлопчатобумажной пряжи'),
                                       ('6202900001',
                                        'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для '
                                        'девочек, кроме изделий товарной позиции 6204, из прочих текстильных '
                                        'материалов'))),
                'Жен.': (('6202300000', '6202900001'),
                         (('6202300000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                           'хлопчатобумажной пряжи'),
                          ('6202900001',
                           'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                           'изделий товарной позиции 6204, из прочих текстильных материалов'))),
                'Муж.': (('6201200000', '6201900000'),
                         (('6201200000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                           'шерстяной пряжи или пряжи из тонкого волоса животных'),
                          ('6201900000',
                           'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                           'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                           'прочих текстильных материалов'))),
                'Унисекс': (('6202300000', '6202900001'),
                            (('6202300000',
                              'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                              'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                              'хлопчатобумажной пряжи'),
                             ('6202900001',
                              'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                              'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ХУДИ': {'Без указания пола': (('6110129001',
                                 '6110199001',
                                 '6110209900',
                                 '6110309100',
                                 '6110309900',
                                 '6110901000',
                                 '6110909000'),
                                (('6110129001',
                                  'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного '
                                  'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или '
                                  'девочек'),
                                 ('6110199001',
                                  'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой '
                                  'одного изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин '
                                  'или девочек'),
                                 ('6110209900',
                                  'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                  'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                                 ('6110309100',
                                  'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                  'химических нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                                 ('6110309900',
                                  'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                  'химических нитей, для женщин или девочек, машинного или ручного вязания'),
                                 ('6110901000',
                                  'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных '
                                  'волокон или волокна рами, машинного или ручного вязания'),
                                 ('6110909000',
                                  'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                                  'прочих текстильных материалов, машинного или ручного вязания'))),
          'Жен.': (('6110129001', '6110199001', '6110209900', '6110309100', '6110309900', '6110901000', '6110909000'),
                   (('6110129001',
                     'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г или '
                     'более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                    ('6110199001',
                     'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                     'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                    ('6110209900',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                     'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                    ('6110309100',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                     'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                    ('6110309900',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                     'нитей, для женщин или девочек, машинного или ручного вязания'),
                    ('6110901000',
                     'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                     'волокна рами, машинного или ручного вязания'),
                    ('6110909000',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                     'текстильных материалов, машинного или ручного вязания'))),
          'Муж.': (('6110121001', '6110191001', '6110209100', '6110309100', '6110901000', '6110909000'),
                   (('6110121001',
                     'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г или '
                     'более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                    ('6110191001',
                     'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                     'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для мужчин или мальчиков'),
                    ('6110209100',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                     'хлопчатобумажной пряжи, для мужчин или мальчиков, машинного или ручного вязания'),
                    ('6110309100',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                     'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                    ('6110901000',
                     'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                     'волокна рами, машинного или ручного вязания'),
                    ('6110909000',
                     'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                     'текстильных материалов, машинного или ручного вязания'))),
          'Унисекс': (('6110129001',
                       '6110199001',
                       '6110209900',
                       '6110309100',
                       '6110309900',
                       '6110901000',
                       '6110909000'),
                      (('6110129001',
                        'Свитеры и пуловеры из пряжи из тонкого волоса кашмирской козы, массой одного изделия 600 г '
                        'или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                       ('6110199001',
                        'Свитеры и пуловеры из шерстяной пряжи или пряжи из тонкого волоса животных, массой одного '
                        'изделия 600 г или более и содержащие не менее 50 мас.% шерсти, для женщин или девочек'),
                       ('6110209900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из '
                        'хлопчатобумажной пряжи, для женщин или девочек, машинного или ручного вязания'),
                       ('6110309100',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для мужчин или мальчиков, машинного или ручного вязания'),
                       ('6110309900',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из химических '
                        'нитей, для женщин или девочек, машинного или ручного вязания'),
                       ('6110901000',
                        'Свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из льняных волокон или '
                        'волокна рами, машинного или ручного вязания'),
                       ('6110909000',
                        'Прочие свитеры, пуловеры, джемперы, жилеты и аналогичные изделия трикотажные, из прочих '
                        'текстильных материалов, машинного или ручного вязания')))},
 'ШИНЕЛЬ': {'Без указания пола': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                                  (('4203100001', '- -- из натуральной кожи'),
                                   ('6202200000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                                   ('6202300000',
                                    'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки '
                                    'и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                                    '6204, из хлопчатобумажной пряжи'),
                                   ('6202400009',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из химических нитей, прочие'),
                                   ('6202900001',
                                    'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, '
                                    'кроме изделий товарной позиции 6204, из прочих текстильных материалов'))),
            'Жен.': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('6202200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6202300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия женские или для девочек, кроме изделий товарной позиции 6204, из хлопчатобумажной '
                       'пряжи'),
                      ('6202400009',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из химических нитей, прочие'),
                      ('6202900001',
                       'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                       'изделий товарной позиции 6204, из прочих текстильных материалов'))),
            'Муж.': (('4203100001', '6201200000', '6201300000', '6201400000', '6201900000'),
                     (('4203100001', '- -- из натуральной кожи'),
                      ('6201200000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или '
                       'пряжи из тонкого волоса животных'),
                      ('6201300000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из хлопчатобумажной '
                       'пряжи'),
                      ('6201400000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из химических нитей'),
                      ('6201900000',
                       'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные '
                       'изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из прочих текстильных '
                       'материалов'))),
            'Унисекс': (('4203100001', '6202200000', '6202300000', '6202400009', '6202900001'),
                        (('4203100001', '- -- из натуральной кожи'),
                         ('6202200000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6202300000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6202400009',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из химических нитей, прочие'),
                         ('6202900001',
                          'Пальто, полупальто, накидки, плащи и аналогичные изделия женские или для девочек, кроме '
                          'изделий товарной позиции 6204, из прочих текстильных материалов')))},
 'ШОРТЫ': {'Без указания пола': (('6104620000', '6104690001', '6104690009', '6204623300'),
                                 (('6104620000',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), '
                                   'трикотажные женские или для девочек, из хлопка'),
                                  ('6104690001',
                                   'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                                  ('6104690009',
                                   'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                                   'материалов'),
                                  ('6204623300',
                                   'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным '
                                   'ворсом'))),
           'Жен.': (('6104620000', '6104690001', '6104690009', '6204623300'),
                    (('6104620000',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                      'женские или для девочек, из хлопка'),
                     ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                     ('6104690009',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов'),
                     ('6204623300',
                      'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом'))),
           'Муж.': (('6103490009', '6203423100', '6203423300'),
                    (('6103490009',
                      'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных материалов, '
                      'мужские или для мальчиков'),
                     ('6203423100', 'Брюки и бриджи мужские или для мальчиков, из денима, или джинсовой ткани'),
                     ('6203423300', 'Брюки и бриджи мужские или для мальчиков, из вельвет-корда с разрезным ворсом'))),
           'Унисекс': (('6104620000', '6104690001', '6104690009', '6204623300'),
                       (('6104620000',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты (кроме купальных), трикотажные '
                         'женские или для девочек, из хлопка'),
                        ('6104690001', 'Брюки и бриджи, женские или для девочек, из прочих текстильных материалов'),
                        ('6104690009',
                         'Брюки, комбинезоны с нагрудниками и лямками, бриджи и шорты, из прочих текстильных '
                         'материалов'),
                        ('6204623300',
                         'Прочие брюки и бриджи женские или для девочек, из вельвет-корда с разрезным ворсом')))},
 'ШТОРМОВКА': {'Без указания пола': (('4203100001', '6102109000', '6102209000', '6102309000', '6102909000'),
                                     (('4203100001', '- -- из натуральной кожи'),
                                      ('6102109000',
                                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                       'для девочек из шерстяной пряжи или пряжи из тонкого волоса животных, '
                                       'трикотажные, кроме одежды из товарной позиции '
                                       '6104                                                                                    '
                                       '<6202200000> Пальто, полупальто, накидки, плащи, куртки (включая лыжные), '
                                       'ветровки, штормовки и аналогичные изделия женские или для девочек, кроме '
                                       'изделий товарной позиции 6204, из шерстяной пряжи или пряжи из тонкого волоса '
                                       'животных'),
                                      ('6102209000',
                                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                       'для девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной '
                                       'позиции 6104 <6202300000> Пальто, полупальто, накидки, плащи, куртки (включая '
                                       'лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек, '
                                       'кроме изделий товарной позиции 6204, из хлопчатобумажной пряжи'),
                                      ('6102309000',
                                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                       'для девочек из химических нитей, трикотажные, кроме изделий товарной позиции '
                                       '6104'),
                                      ('6102909000',
                                       'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или '
                                       'для девочек из прочих текстильных материалов, трикотажные, кроме изделий '
                                       'товарной позиции 6104'))),
               'Жен.': (('4203100001', '6102109000', '6102209000', '6102309000', '6102909000'),
                        (('4203100001', '- -- из натуральной кожи'),
                         ('6102109000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме одежды из '
                          'товарной позиции '
                          '6104                                                                                    '
                          '<6202200000> Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                          'штормовки и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                          '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                         ('6102209000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104 <6202300000> '
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия женские или для девочек, кроме изделий товарной позиции 6204, из '
                          'хлопчатобумажной пряжи'),
                         ('6102309000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                         ('6102909000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для девочек '
                          'из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции 6104'))),
               'Муж.': (('4203100001', '6101209000', '6101309000', '6101908000', '6201200000', '6201900000'),
                        (('4203100001', '- -- из натуральной кожи'),
                         ('6101209000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия из хлопчатобумажной '
                          'пряжи трикотажные, мужские или для мальчиков, кроме изделий товарной позиции 6103 '
                          '<6201300000> Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                          'штормовки и аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции '
                          '6203, из хлопчатобумажной пряжи'),
                         ('6101309000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские или для '
                          'мальчиков из химических нитей, трикотажные, кроме изделий товарной позиции 6103<6201400000> '
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                          'химических нитей'),
                         ('6101908000',
                          'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия, из прочих текстильных '
                          'материалов'),
                         ('6201200000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                          'шерстяной пряжи или пряжи из тонкого волоса животных <6201200000> Пальто, полупальто, '
                          'накидки, плащи, куртки (включая лыжные), ветровки, штормовки и аналогичные изделия мужские '
                          'или для мальчиков, кроме изделий товарной позиции 6203, из шерстяной пряжи или пряжи из '
                          'тонкого волоса животных'),
                         ('6201900000',
                          'Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия мужские или для мальчиков, кроме изделий товарной позиции 6203, из '
                          'прочих текстильных материалов <6101908000> Куртки (включая лыжные), ветровки, штормовки и '
                          'аналогичные изделия, из прочих текстильных материалов'))),
               'Унисекс': (('4203100001', '6102109000', '6102209000', '6102309000', '6102909000'),
                           (('4203100001', '- -- из натуральной кожи'),
                            ('6102109000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из шерстяной пряжи или пряжи из тонкого волоса животных, трикотажные, кроме '
                             'одежды из товарной позиции '
                             '6104                                                                                    '
                             '<6202200000> Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                             'штормовки и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                             '6204, из шерстяной пряжи или пряжи из тонкого волоса животных'),
                            ('6102209000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из хлопчатобумажной пряжи, трикотажные, кроме изделий товарной позиции 6104 '
                             '<6202300000> Пальто, полупальто, накидки, плащи, куртки (включая лыжные), ветровки, '
                             'штормовки и аналогичные изделия женские или для девочек, кроме изделий товарной позиции '
                             '6204, из хлопчатобумажной пряжи'),
                            ('6102309000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из химических нитей, трикотажные, кроме изделий товарной позиции 6104'),
                            ('6102909000',
                             'Куртки (включая лыжные), ветровки, штормовки и аналогичные изделия женские или для '
                             'девочек из прочих текстильных материалов, трикотажные, кроме изделий товарной позиции '
                             '6104')))},
 'ШУБА': {'Без указания пола': (('4203100009', '4303109010', '4303109050', '4303109060', '4304000000'),
                                (('4203100009', '- - прочие'),
                                 ('4303109010', '- - - предметы одежды из норки'),
                                 ('4303109050', '- - - предметы одежды из енота'),
                                 ('4303109060', '- - - предметы одежды из овчины'),
                                 ('4304000000', 'Мех искусственный и изделия из него')))},
 'ЮБКА': {'Без указания пола': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                                (('6104510000',
                                  'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи или '
                                  'пряжи из тонкого волоса животных, машинного или ручного вязания'),
                                 ('6104520000',
                                  'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                                  'машинного или ручного вязания'),
                                 ('6104530000',
                                  'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических нитей, '
                                  'машинного или ручного вязания'),
                                 ('6104590000',
                                  'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих текстильных '
                                  'материалов, машинного или ручного вязания'),
                                 ('6204599000',
                                  'Юбки и юбки-брюки женские или для девочек, из прочих текстильных материалов'))),
          'Жен.': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                   (('6104510000',
                     'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из тонкого '
                     'волоса животных, машинного или ручного вязания'),
                    ('6104520000',
                     'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, машинного '
                     'или ручного вязания'),
                    ('6104530000',
                     'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических нитей, машинного или '
                     'ручного вязания'),
                    ('6104590000',
                     'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                     'машинного или ручного вязания'),
                    ('6204599000', 'Юбки и юбки-брюки женские или для девочек, из прочих текстильных материалов'))),
          'Унисекс': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                      (('6104510000',
                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                        'тонкого волоса животных, машинного или ручного вязания'),
                       ('6104520000',
                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, машинного '
                        'или ручного вязания'),
                       ('6104530000',
                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                        'или ручного вязания'),
                       ('6104590000',
                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                        'машинного или ручного вязания'),
                       ('6204599000', 'Юбки и юбки-брюки женские или для девочек, из прочих текстильных материалов')))},
 'ЮБКА-БРЮКИ': {'Без указания пола': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                                      (('6104510000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи '
                                        'или пряжи из тонкого волоса животных, машинного или ручного вязания'),
                                       ('6104520000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной '
                                        'пряжи, машинного или ручного вязания'),
                                       ('6104530000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических '
                                        'нитей, машинного или ручного вязания'),
                                       ('6104590000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих '
                                        'текстильных материалов, машинного или ручного вязания'),
                                       ('6204599000',
                                        'Юбки и юбки-брюки женские или для девочек, из прочих текстильных '
                                        'материалов'))),
                'Жен.': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                         (('6104510000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                           'тонкого волоса животных, машинного или ручного вязания'),
                          ('6104520000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                           'машинного или ручного вязания'),
                          ('6104530000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                           'или ручного вязания'),
                          ('6104590000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                           'машинного или ручного вязания'),
                          ('6204599000',
                           'Юбки и юбки-брюки женские или для девочек, из прочих текстильных материалов'))),
                'Унисекс': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                            (('6104510000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи '
                              'из тонкого волоса животных, машинного или ручного вязания'),
                             ('6104520000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                              'машинного или ручного вязания'),
                             ('6104530000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических нитей, '
                              'машинного или ручного вязания'),
                             ('6104590000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих текстильных '
                              'материалов, машинного или ручного вязания'),
                             ('6204599000',
                              'Юбки и юбки-брюки женские или для девочек, из прочих текстильных материалов')))},
 'ЮБКА-ШОРТЫ': {'Без указания пола': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                                      (('6104510000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи '
                                        'или пряжи из тонкого волоса животных, машинного или ручного вязания'),
                                       ('6104520000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной '
                                        'пряжи, машинного или ручного вязания'),
                                       ('6104530000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических '
                                        'нитей, машинного или ручного вязания'),
                                       ('6104590000',
                                        'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих '
                                        'текстильных материалов, машинного или ручного вязания'),
                                       ('6204599000',
                                        'Юбки и юбки-брюки женские или для девочек, из прочих текстильных '
                                        'материалов'))),
                'Жен.': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                         (('6104510000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи из '
                           'тонкого волоса животных, машинного или ручного вязания'),
                          ('6104520000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                           'машинного или ручного вязания'),
                          ('6104530000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических нитей, машинного '
                           'или ручного вязания'),
                          ('6104590000',
                           'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих текстильных материалов, '
                           'машинного или ручного вязания'),
                          ('6204599000',
                           'Юбки и юбки-брюки женские или для девочек, из прочих текстильных материалов'))),
                'Унисекс': (('6104510000', '6104520000', '6104530000', '6104590000', '6204599000'),
                            (('6104510000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из шерстяной пряжи или пряжи '
                              'из тонкого волоса животных, машинного или ручного вязания'),
                             ('6104520000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из хлопчатобумажной пряжи, '
                              'машинного или ручного вязания'),
                             ('6104530000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из синтетических нитей, '
                              'машинного или ручного вязания'),
                             ('6104590000',
                              'Юбки и юбки-брюки, трикотажные, женские или для девочек, из прочих текстильных '
                              'материалов, машинного или ручного вязания'),
                             ('6204599000',
                              'Юбки и юбки-брюки женские или для девочек, из прочих текстильных материалов')))}}

CLOTHES_TYPES: list = ['АНОРАК', 'БАБОЧКА', 'БАТНИК', 'БЕЗРУКАВКА', 'БЕКЕША', 'БЛЕЙЗЕР', 'БЛУЗА', 'БЛУЗКА',
                       'БЛУЗОН', 'БОДИ', 'БРИДЖИ', 'БРЮКИ', 'БУШЛАТ', 'ВЕТРОВКА', 'ВОДОЛАЗКА',
                       'ГАЛСТУК', 'КОМБИНЕЗОН', 'ДЖЕМПЕР', 'ДЖИНСЫ', 'ДОЖДЕВИК', 'ДУБЛЕНКА', 'ЖАКЕТ',
                       'ЖИЛЕТ', 'ЗАЩИТНАЯ ФОРМА', 'ЗАЩИТНЫЙ КОМБИНЕЗОН', 'ЗАЩИТНЫЙ КОСТЮМ', 'ЗАЩИТНЫЙ ФАРТУК С НАГРУДНИКОМ',
                       'КАПРИ', 'КАРДИГАН', 'КЕЙП', 'КИТЕЛЬ',
                       'КОСТЮМ', 'КОСУХА', 'КОФТА', 'КУРТКА', 'КУРТКА-ЖИЛЕТ', 'КУРТКА-ПИЛОТ (БОМБЕР)', 'КЮЛОТЫ', 'ЛОНГСЛИВ',
                       'ЛЕГИНСЫ', 'МАЙКА', 'МАНТО', 'МОТОКУРТКА', 'НАКИДКА', 'ПАЛЬТО', 'ПАРКА', 'ПИДЖАК',
                       'ПИХОРА', 'ПЛАТЬЕ', 'ПЛАЩ', 'ПОЛО', 'ПОЛУКОМБИНЕЗОН', 'ПОЛУПАЛЬТО', 'ПОЛУШУБОК', 'ПОНЧО',
                       'ПУЛОВЕР', 'ПУХОВИК', 'ПЫЛЬНИК', 'РАСПАШОНКА', 'РУБАШЕЧКА ДЛЯ НОВОРОЖДЕННЫХ', 'РУБАШКА',
                       'СВИТЕР', 'СВИТШОТ', 'СМОКИНГ', 'СПОРТИВНЫЙ ПИДЖАК', 'СЮРТУК', 'ТЕЛЬНЯШКА', 'ТЕННИСКА',
                       'ТОЛСТОВКА', 'ТОП', 'ТРЕНЧ', 'ТУЛУП', 'ТУНИКА', 'ФРЕНЧ', 'ФУТБОЛКА', 'ФУФАЙКА',
                       'ХАЛАТ МЕДИЦИНСКИЙ', 'ХАРРИНГТОН', 'ХУДИ', 'ШИНЕЛЬ', 'ШОРТЫ', 'ШТОРМОВКА', 'ШУБА',
                       'ЮБКА', 'ЮБКА-БРЮКИ', 'ЮБКА-ШОРТЫ', ]
if __name__ == '__main__':
    clothes_genders = {}
    for k, v in CLOTHES_TNVED_DICT.items():
        temp_genders = []
        ng_flag = False
        for el in v:
            if el =='Без указания пола':
                ng_flag = True
                continue
            temp_genders.append(el)
        if ng_flag:
            temp_genders.append('Без указания пола')
        clothes_genders[k] = temp_genders
    print(clothes_genders)

    # for el in CLOTHES_TNVED_DICT:
    #     if el in CLOTHES_TYPES:
    #         CLOTHES_TYPES.remove(el)
    #     else:
    #         print(el)
    # print(CLOTHES_TYPES)
