from views.main.categories.toys.subcategories.data import ToysSubcategories


SUBCATEGORY_SLUG = ToysSubcategories.scale_models_other.value
SUBCATEGORY_TITLE = "Игрушки прочие и модели в масштабе"
SUBCATEGORY_CATEGORY_CODE = ""

CAST_METAL_TNVED_CODE = "9503008500"
PLASTIC_SCALE_TNVED_CODE = "9503009500"
OTHER_SCALE_TNVED_CODE = "9503009909"

ALLOWED_TNVED_CODES = (CAST_METAL_TNVED_CODE, PLASTIC_SCALE_TNVED_CODE, OTHER_SCALE_TNVED_CODE)
ALLOWED_TNVED_CHOICES = (
    (CAST_METAL_TNVED_CODE, "Мини-модели литые металлические"),
    (
        PLASTIC_SCALE_TNVED_CODE,
        'Игрушки прочие; модели в уменьшенном размере ("в масштабе") и аналогичные модели для развлечений, пластмассовые',
    ),
    (
        OTHER_SCALE_TNVED_CODE,
        'Игрушки прочие; модели в уменьшенном размере ("в масштабе") и аналогичные модели для развлечений, прочие',
    ),
)

CATEGORY_CODE_BY_TNVED = {
    CAST_METAL_TNVED_CODE: SUBCATEGORY_CATEGORY_CODE,
    PLASTIC_SCALE_TNVED_CODE: SUBCATEGORY_CATEGORY_CODE,
    OTHER_SCALE_TNVED_CODE: SUBCATEGORY_CATEGORY_CODE,
}

OKPD2_CHOICES_BY_TNVED = {
    CAST_METAL_TNVED_CODE: (
        ("32.40.39.231", "Мини-модели литые"),
    ),
    PLASTIC_SCALE_TNVED_CODE: (
        ("32.40.39.131", "Игрушки пластмассовые транспортные, технические (в том числе игрушечные сооружения) механические (заводные, инерционные, пружинные, рычажные), не включенные в другие группировки"),
    ),
    OTHER_SCALE_TNVED_CODE: (
        ("32.40.39.211", "Предметы игрового обихода резиновые формовые"),
        ("32.40.39.221", "Предметы игрового обихода из ткани, меха, ваты, кожи и ее заменителей, нетканых материалов (мягконабивные) без механизмов"),
        ("32.40.41.000", "Карты игральные"),
        ("32.40.42.199", "Игры и изделия для игр прочие, не включенные в другие группировки"),
        ("32.40.42.110", "Изделия и принадлежности для бильярда"),
    ),
}

MODEL_ARTICLE_TYPES = ("Модель", "Артикул", "Модель / Артикул")

PRODUCT_TYPES = (
    "ДОМИНО",
    "ИГРУШКА ДЛЯ ПЕСОЧНИЦЫ",
    "ИГРУШКА ЗАВОДНАЯ",
    "ИГРУШКА МЯГКАЯ",
    "ИГРУШКА РАЗВИВАЮЩАЯ",
    "ИГРУШКА-АНТИСТРЕСС",
    "ИГРУШКА-КАТАЛКА",
    "ИГРУШКА-ПОДВЕСКА",
    "КОВРИК ИГРОВОЙ",
    "КУБИКИ",
    "МЕБЕЛЬ И ПРЕДМЕТЫ БЫТА",
    "МОЛОТОК-ПИЩАЛКА",
    "МУЗЫКАЛЬНЫЙ ИНСТРУМЕНТ",
    "МЫЛЬНЫЕ ПУЗЫРИ",
    "МЯЧ",
    "МЯЧ БАСКЕТБОЛЬНЫЙ",
    "МЯЧ ВОЛЕЙБОЛЬНЫЙ",
    "МЯЧ ГАНДБОЛЬНЫЙ",
    "МЯЧ ДЛЯ БОЛЬШОГО ТЕННИСА",
    "МЯЧ ДЛЯ НАСТОЛЬНОГО ТЕННИСА",
    "МЯЧ ИГРУШЕЧНЫЙ",
    "МЯЧ НАДУВНОЙ",
    "МЯЧ ФУТБОЛЬНЫЙ",
    "ПАЛЬЧИКОВЫЙ ЛАБИРИНТ",
    "ПИРАМИДКА",
    "ПОГРЕМУШКА",
    "ПОСУДА",
    "РАСТЯЖКА",
    "РОМБИКИ",
    "СОРТЕР",
    "СТРОЕНИЕ",
    "ТРАНСПОРТ АВАРИЙНЫЙ",
    "ТРАНСПОРТ АВИАЦИОННЫЙ",
    "ТРАНСПОРТ ВОДНЫЙ",
    "ТРАНСПОРТ ВОЕННЫЙ",
    "ТРАНСПОРТ ГОНОЧНЫЙ",
    "ТРАНСПОРТ ГОРОДСКОЙ И ОБЩЕСТВЕННЫЙ",
    "ТРАНСПОРТ ГРУЗОВОЙ",
    "ТРАНСПОРТ КОММУНАЛЬНЫЙ",
    "ТРАНСПОРТ КОСМИЧЕСКИЙ",
    "ТРАНСПОРТ ЛЕГКОВОЙ",
    "ТРАНСПОРТ СЕЛЬСКОХОЗЯЙСТВЕННЫЙ",
    "ТРАНСПОРТ СПЕЦСЛУЖБ",
    "ТРАНСПОРТ СТРОИТЕЛЬНЫЙ",
    "ФИГУРКА",
    "ШАРИК",
    "НЕТ В СПРАВОЧНИКЕ",
)

ALLOWED_TNVED_CODES_BY_PRODUCT_TYPE = {
    product_type: ALLOWED_TNVED_CODES
    for product_type in PRODUCT_TYPES
}

MATERIAL_CHOICES = (
    "АКРИЛ",
    "БАРХАТ",
    "БУМАГА",
    "ВАТА",
    "ДЕРЕВО",
    "ДРЕВЕСНО-ОПИЛОЧНАЯ МАССА",
    "ЗАМЕНИТЕЛЬ КОЖИ",
    "ИСКУССТВЕННЫЙ МЕХ",
    "КАРТОН",
    "КЕРАМИКА",
    "ЛАТЕКС",
    "ЛАТЕКС НАТУРАЛЬНЫЙ",
    "КОЖА",
    "МЕТАЛЛ",
    "МЕХ",
    "МЯГКОНАБИВНОЙ МАТЕРИАЛ",
    "НАБИВНОЙ МАТЕРИАЛ",
    "НЕТКАНЫЙ МАТЕРИАЛ",
    "ПАПЬЕ-МАШЕ",
    "ПЛАСТМАССА",
    "ПЛЕНКА ПОЛИМЕРНАЯ",
    "ПЛЕНКА ФОЛЬГИРОВАННАЯ",
    "ПЛЮШ",
    "ПОЛИВИНИЛХЛОРИД (ПВХ, PVC)",
    "ПОЛИМЕРНЫЕ МАТЕРИАЛЫ",
    "ПОЛИПРОПИЛЕН",
    "ПОЛИЭСТЕР",
    "РЕЗИНА",
    "СИЛИКОН",
    "СИНТЕПУХ",
    "СТЕКЛО",
    "ТКАНЬ",
    "ФАРФОР",
    "ФАЯНС",
    "ФЕТР",
    "ФЛАНЕЛЬ",
    "ХЛОПОК",
    "ЭТИЛЕНВИНИЛАЦЕТАТ (ЭВА, EVA)",
    "КОМБИНИРОВАННЫЙ",
)

MIN_CHILD_AGE_CHOICES = (
    "ОТ 0 МЕС",
    "ОТ 1 МЕС",
    "ОТ 2 МЕС",
    "ОТ 3 МЕС",
    "ОТ 4 МЕС",
    "ОТ 5 МЕС",
    "ОТ 6 МЕС",
    "ОТ 7 МЕС",
    "ОТ 8 МЕС",
    "ОТ 9 МЕС",
    "ОТ 10 МЕС",
    "ОТ 11 МЕС",
    "ОТ 1 ГОДА",
    "ОТ 1,5 ЛЕТ",
    "ОТ 2 ЛЕТ",
    "ОТ 3 ЛЕТ",
    "ОТ 4 ЛЕТ",
    "ОТ 5 ЛЕТ",
    "ОТ 6 ЛЕТ",
    "ОТ 7 ЛЕТ",
    "ОТ 8 ЛЕТ",
    "ОТ 9 ЛЕТ",
    "ОТ 10 ЛЕТ",
    "ОТ 11 ЛЕТ",
    "ОТ 12 ЛЕТ",
    "ОТ 13 ЛЕТ",
    "ОТ 14 ЛЕТ",
)

USAGE_TERM_TYPES = (
    "СРОК ГОДНОСТИ",
    "СРОК СЛУЖБЫ",
    "СРОК ИСПОЛЬЗОВАНИЯ НЕ УСТАНАВЛИВАЕТСЯ",
)

SERVICE_LIFE_TYPES = ("сут; дн", "мес", "г; лет")
DEFAULT_COUNTRIES = ("ГОНКОНГ", "РОССИЯ", "КИТАЙ")
